{"pageProps":{"posts":[{"title":"바쁜 엄마가 PC 팬 코르시-로젠탈 박스를 만드는 방법","description":"","date":"2024-06-23 18:05","slug":"2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox","content":"\n\n<img src=\"/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_0.png\" />\n\nDIY 공기 청정기를 만드려는 관심에 감사드립니다! 2021년 여름에 처음으로 이에 대해 알게 되었을 때, 시작하고 싶었지만 약간 겁먹었습니다. 그 후로 다른 사람들로부터도 같은 이야기를 많이 들었습니다. 자료를 모으기 시작하고 실제로 공기 청정기를 만드는 데 조금 망설이는 것은 흔한 일입니다. 제 경험에 대해 읽는 것이 여러분이 자신의 장치를 만드는 데 도움이 되길 바랍니다.\n\n비용이 제한적이었다는 점도 솔직히 말씀드리겠습니다. 저는 파트타임으로 일하는 엄마이고 조금의 여유 재정이 없습니다. 모든 부품을 구입할 만큼의 자금이 필요하기까지 몇 달이 걸렸고, 가능한 것을 살 때마다 구입하는 식으로 비용을 조절했습니다. (Donate a Mask Canada에서 필터 재료를 기부해주고 있으므로 DIY 공기 청정이 경제적인 어려움이 되는 경우 선택할 수도 있습니다.)\n\n이 글은 자세하고 상세합니다. 주문한 부품, 상자 하나를 만드는 과정을 보여주는 사진과 함께 상세한 설명, 자원이 제한적인 부모/옹호자/일반인으로서 박스 팬 Corsi-Rosenthal 박스 대 PC 팬 버전에 대한 제 생각, 사용한 정보 자료 및 끝에 다른 대기질 자료 목록 등을 다룰 것입니다.\n\n<div class=\"content-ad\"></div>\n\n요즘 결과물을 보여주는 몇 장의 사진이 있어요:\n\n![사진1](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_1.png)\n\n![사진2](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_2.png)\n\n## 그래서, 이것을 어떻게 만들었고 비용은 얼마인지 궁금하신가요?\n\n<div class=\"content-ad\"></div>\n\n다른 사람들이 제작한 내용을 읽어본 것이 다행이었어요. PC 팬 버전은 더 복잡해 보였기 때문에 많은 도움이 되었습니다.\n\n여기 제가 시작한 내용이에요!\n\n![이미지](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_3.png)\n\n제 주요 조언은 이에요: DIY 공기 청정기를 많이 제작해야 하거나 급하게 필요하다면, 일반 박스 팬 Corsi-Rosenthal 박스 디자인을 선택하세요. 20x20인치 MERV-13 필터 4개와 20인치 박스 팬이 필요해요. 이런 부품들을 찾는 데 시간이 덜 걸리고, 그 스타일로 제작하는 것이 더 직관적이고 저렴할 거예요. 결국 캐나다에서 일반 박스 팬 DIY 공기 청정기를 제작하는데 소요되는 비용은 대개 $100~150이고 한 어른이 30분이면 제작이 가능해요. PC 팬 버전은 비용이 약 $230~250이 들고 제가 3~3.5시간이 걸려요.\n\n<div class=\"content-ad\"></div>\n\n돈과 시간이 충분하다면 PC 팬 버전을 만들어 보세요! 만들 때는 급하긴 하지 말고 충분한 시간을 투자해 보세요. PC 팬을 구동하는 데 처음이라면 조립하기 전에 모든 연결 방법을 확인하기 위해 먼저 시험해 보는 것이 좋습니다.\n\n## 사용한 부품 목록\n\n필터 (2개)\n\n팬 (8개)\n\n<div class=\"content-ad\"></div>\n\n전원 공급\n\n어댑터/커넥터/분배기(필요한 경우)\n\n팬 그릴/손가락 가드(8)\n\n팬을 부착할 무언가(나무 또는 폼)\n\n<div class=\"content-ad\"></div>\n\n테이프 또는 접착제 (나는 가퍼 테이프를 사용하지만, 아마존에서 퀄리티가 낮은 가퍼 테이프에 주의하세요)\n\n폼 코어를 자르기 위한 박스 커터 - 부족한 점을 보완하기 위해 컴퍼스(원을 자를 때 사용하는 도구)를 강력히 추천합니다!\n\n제가 나열한 가격은 캐나다 달러이며 링크는 캐나다로 배송하는 곳을 가리킵니다. 미국에 계시다면 다른 링크가 필요하지만, 가격은 더 저렴할 것입니다.\n\n## 필터\n\n<div class=\"content-ad\"></div>\n\n어떤 사람들은 HEPA 또는 IKEA 필터를 사용하고 다른 사람들은 난로 필터를 사용해요. 저는 United Filter Canada에서 대량 구매한 MERV-13 필터를 사용했어요.\n\n참고: 최근에 이러한 필터의 품질에 대한 우려가 있었어요. 이 중 하나는 필터 소재에 충분한 주름이 없다는 점입니다. 독립적인 테스터 중 한 명은 이러한 필터를 통한 유속이 한 크기에서 매우 낮고, 다른 크기에서는 원활하다고 발견했어요. 전문가는 아니에요. United Filter 제품의 현재 품질에 대해 더 많은 이해를 할 때까지 3M Filtrete 필터를 구입하기로 결정했어요. 캐나다의 UF 필터보다 약 두 배 비싸기 때문에 DIY 공기 청정기를 더 적게 만들 수밖에 없을 거에요. 그 때 사용했던 United Filter 제품에 대해 계속 이야기할 것이지만, 현재 가장 안전한 접근 방법은 3M Filtretes를 구매하는 것 같아요.\n\n내 비용: 12개의 필터에 세금 포함 $146.89, 즉 필터당 $12.24 — 장치 당 $24.48. 내가 사는 곳에서는 MERV-13과 동등한 3M Filtretes를 찾기 어려우며, 일반적으로 각각 거의 $30 CAD에 판매돼요. 그래서 3M Filtretes를 선택하거나 대량으로 다른 MERV-13 필터를 구할 수 없다면 필터당 $12.24보다 비용이 더 많이 들 거에요. (또한 Rob Wissmann의 \"Tower of Power\" 디자인을 위해 United Canada로부터 20x30 MERV-13 필터 한 대량 세트를 구매했는데, 그 필터들은 조금 더 비싸고 주문했을 때 수 주가 소요됐어요. 20x20 크기는 몇 일 내에 도착했어요. UF 필터에 대해 알고 있는 내용을 고려하면, 그들의 필터로 제 PC 팬 CR 장치를 만들기 전에 품질을 확인할 때까지 기다릴 거에요.)\n\n제가 한 것처럼 2개의 필터 디자인을 만든 경우, 3개월마다 필터를 교체해야 해요. 일반 Corsi-Rosenthal 박스보다 필터가 적기 때문에 필터가 더 빠르게 더 많이 적재될 거에요. 원한다면 상단의 박스 팬을 9개의 PC 팬으로 교체하여 4개 필터 버전을 만들 수도 있습니다. 그럼 4개 필터의 경우 6~12개월 주기로 교체할 수 있어요.\n\n<div class=\"content-ad\"></div>\n\n최근에 2개의 필터 디자인을 사용한 교체 시간이 빨라진 사실과 훨씬 저렴한 United Filter 필터의 잠재적인 문제에 대해 최근에 알게 되었습니다. 이는 더 비싼 필터(3M)로 자주 교체해야 하며, 이로 인해 예상보다 운영 비용이 증가함을 의미합니다. 저에게는 DIY 공기 청정 또는 Honeywell 제품과 같은 HEPA 필터링 구입 중 선택이 있습니다. Honeywell은 HEPA 필터(매년 교체; 대형 장치는 2개 필터 사용), 프리 필터(매 3개월 교체) 및 운영 비용(전력 사용량)이 필요합니다. 올바르게 제작된 경우 DIY 필터링은 일반적으로 Honeywell이나 동등한 HEPA보다 더 높은 CADR을 제공하며, PC 팬 공기 청정기의 경우 소음이 적고 전력 소비량이 적습니다. 따라서 PC 팬 버전의 필터 비용이 증가하더라도 여전히 DIY 공기 청정의 장점이 있습니다.\n\n저는 현재 집에서 PC 팬 공기 청정기를 사용하고 있습니다. 가족 의료 연습실인 저희 가족 의학 오피스에는 다양한 크기의 허니웰 장치와 같은 HEPA 공기 청정기를 구매하고 있으며, 대기실에는 전통적인 Corsi-Rosenthal 상자를 두고 있습니다.\n\n## 팬\n\n대부분의 건축가들은 12 또는 14cm 컴퓨터 케이스 팬(120mm 또는 140mm)을 권장합니다. 팬을 한 세트에 판매하거나 “데이지 체인”으로 팬을 서로 연결할 수 있는 버전을 구매할 수 있습니다. 이를 통해 모든 팬을 구동하기 위해 스플리터를 별도로 구매할 필요가 없습니다. 위스만은 필터가 먼지로 적재되기 시작할 때 140mm이 조금 더 강력하고 오랫동안 최적으로 작동할 것이라고 권장합니다. 참고: 140mm 팬 가드는 구하기 어렵거나 건설 당시 어려웠습니다. 120mm 가드는 저렴하게 많이 구할 수 있습니다. 3D 프린터에 접근할 수 있다면 팬 가드를 3D 프린팅할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 옵션\n\n나는 내 Arctic 120mm 팬을 개당 $9.20에 삿어요.\n\n- Arctic 120mm 데이지 체인 버전 (PWM PST) in black\n- Arctic 140mm 데이지 체인 버전 (PWM PST) in black\n\n<div class=\"content-ad\"></div>\n\n5팩을 링크드해서 더 저렴하고 팬이 많이 필요할 것 같아서 추천해요. 물론 개별적으로도 구매할 수 있어요. 아마존이 아닌 다른 곳에서도 판매하고 있으니 Arctic에서 직접 주문할 수도 있어요.\n\n화이트로 제공되는 Arctic 팬도 구매할 수 있어요. RGB 팬으로 조립하고 싶은데 일부 비-RGB 팬을 섞어서 돈을 절약하고 싶다면 좋은 선택일 거예요.\n\n참고: 처음에는 데이지 체인(세이비 PST) 기능이 있는 것을 주문하지 않았어요. 선택이 주어진다면 언제나 데이지 체인 기능이 있는 것을 고르는 게 좋을 거예요. 데이지 체인 버전을 사용하면 $10분할기를 사지 않아도 될 가능성이 높아요.\n\n다른 회사에서 다른 팬 옵션이 있지만, 사람들은 Arctic 팬이 좋은 품질에 합리적인 가격으로 판매되고 있다고 동의하고 있어요.\n\n<div class=\"content-ad\"></div>\n\n제 사진들은 어린이 방에 사용된 PC 팬 빌드 사진들인데, 사진 속 주 DIY 공기 청정기는 Corsair RGB 팬을 사용하고 있어요. 나중에 해당 글에서 링크된 Wissmann의 테스트 결과를 보면, 일부 RGB 팬은 필터가 더 많이 물려있을수록 성능이 떨어진다는 것을 알 수 있는데요. 그 점도 고려해야 할 사항입니다. 필터를 3개월마다 교체하는 것이 그러한 염려를 줄일 수 있습니디까? Wissmann은 이전 필터로 테스트했는데, 그만큼 고려해보세요.\n\n## 팬 그릴 또는 손가락 그림/보호대\n\n제 빌드들은 어린이가 있는 방에 설치될 예정입니다. 그들의 손가락을 보호하고, 장난감이나 다른 물체가 들어가 화장기기를 손상시키지 않도록 팬 그릴을 부착해야 했어요. 이것이 기기에 약간의 비용과 무게를 추가하지만, 사용하는 곳에서는 필요합니다. 실수로 돌아가는 팬으로 손가락을 베었을 때, 그 통증은 정말 굉장합니다. 제 손가락이 날개에서 벗어났다고 생각하고 팬을 테스트하려 했지만 그것은 아니었습니다. 아파요!\n\n구입한 팬 크기에 따라 120mm 또는 140mm 팬 그릴 또는 팬 보호대를 찾아보세요. \"망\" 형태의 스크린을 구할 수도 있지만, 제가 살펴본 사양에 따르면 공기 흐름에 더 많은 영향을 줍니다. 팬의 공기 유속을 크게 감소시키면 DIY 공기 청정기의 효과가 줄어들게 됩니다.\n\n<div class=\"content-ad\"></div>\n\n아마존에서 그릴을 살려고 했는데 너무 비싸보이고 대량 구매할만한 좋은 옵션이 없어요. 대부분의 PC 팬 필터 빌드는 최소한 6개의 팬을 사용하는데, 워프 코어 형태로 쌓지 않는 한 많은 그릴이 필요할 것 같아요. Digikey에서 더 많은 옵션을 찾게 되어 기뻤어요.\n\n여기 Digikey 사이트에 팬 가드를 찾아볼 수 있어요 — 개당 $1.40 또는 더 싼 가격에 구할 수 있어요. 배송도 빨랐어요. 나는 이 모델과 비슷한 것을 구매했고, 금속 소재도 있어요.\n\n## 폼 보드\n\n어떤 사람이 이것을 추천했어요. 일부 사람들은 달러 상점이나 공예 용품 가게에서 구할 수도 있었어요.\n\n<div class=\"content-ad\"></div>\n\n나의 비용: 10개의 보드에 $58.80이 듭니다. 만약 20x30 필터를 사용 중이라면, 20x30 폼 보드를 사용하시면 좋습니다. 필터와 가능한 가까운 크기의 폼 보드를 찾으셔야 합니다. 만약 길이가 일치한다면 많은 절단을 할 필요가 없습니다. 폼 코어를 선풍기 폭보다 약간 넓게 자르시면, 필터 가장자리에 부착할 공간과 전선이 붙이거나 다른 곳에 숨겨질 공간이 확보됩니다. 만약 20x30 필터를 사용하지 않는다면, 20x30 폼 코어를 구매할 필요는 없지만, 저는 이것을 구매하여 현재까지 만족했습니다. 폼 코어를 사용하고 싶지 않다면, 나무나 튼튼한 판지를 사용할 수 있습니다. 어떤 사람들은 하드보드를 사용하기도 합니다. 선거 표지판을 재활용하는 사람들도 있다고 합니다.\n\n저는 Rob이 추천한 이 나침반을 사용하여 원을 자르고 있습니다. 나는 나침반 없이 PC 선풍기 필터를 만들고 싶지 않습니다.\n\n## 전원\n\n선풍기는 벽 콘센트에 연결할 수 있는 것(또는 휴대용 파워 뱅크, 차량 전원 콘센트 등)에 연결되어야 합니다. 제품으로 제공되는 선풍기는 컴퓨터 마더보드에 연결되도록 설계되어 있기 때문에 직접 콘센트에 꽂을 수 없습니다. 전원을 구매할 때, UL 인증이 되어 있는지 확인해야 합니다. 또한 선풍기를 전원 공급 장치에 연결할 수 있는 어댑터도 구매했습니다.\n\n<div class=\"content-ad\"></div>\n\n어댑터\n\nUSB에 선풍기를 연결할 수 있는 어댑터 - 이 제품의 가격이 꽤 올랐으니 대안을 찾아보시는 것이 좋을 것 같아요. 아마존에서 어댑터를 찾는 한 가지 어려움은 제품이 계속 바뀌고 제품이 더 이상 구할 수 없는 경우가 있다는 것입니다. 전통적인 CR 박스에는 이러한 어려움이 없어요!\n\n## 전원 공급\n\nRob Wissmann의 정보를 바탕으로, 많은 선풍기를 구동할 예정이었기 때문에 UL 인증 받은 2A 전원 공급기를 선택했습니다. 더 적은 선풍기로 작은 걸 만드시는 경우 1A 전원 공급기를 선택할 수 있어요. (제 비용: 전원 공급기 당 $10)\n\n<div class=\"content-ad\"></div>\n\n다른 옵션\n\n내 RGB 및 차량 모델 장치에 대해 위에 제시된 USB 어댑터 옵션과 Anker의 2A 이중 USB 전원(또는 USB를 사용하는 차량 전원 어댑터)을 사용해왔어요.\n\n## RGB 라이트 — 선택 사항\n\nRGB 라이트가 있는 팬을 선택했다면, 라이트와 라이트 허브를 공급해야 합니다. 이것은 조금 더 복잡하며 팬과 라이트를 공급해야 하므로 두 가지를 연결해야 합니다. 이것은 Alex가 작성한 RGB 라이트를 공급하는 방법에 대한 설명입니다.\n\n<div class=\"content-ad\"></div>\n\n12월에 Corsair 브랜드를 세일해서 사용 중이에요. 참고로, 리모컨은 따로 안 오니까 무지개 색상으로 변하는 팬이에요. (제품 설명에 언급된 소프트웨어로 제어하려면 팬이 실제로 마더보드에 연결되어야 하는 거 같은데요. 공기 청정기 안에만 있을 때는 Corsair 팬 색상을 제어할 방법이 없어요.) 전원 공급은 SATA에서 USB 어댑터가 필요해요. 이에 관한 내용은 바로 위에 연결된 Alex의 스레드에서 다루고 있어요.\n\n다른 사람들은 다른 브랜드의 RGB 팬을 선호하는데요 — 가장 싼 것들은 고유의 연결 방식을 가지고 있을 가능성이 높아요 — 예를 들어 Cool Moon/UpHere 팬 같은 경우죠. 이 고유 연결 방식은 제가 처리하지 못하는 부분이에요. 주문하기 전에 항목들이 어떤 종류의 연결을 가지고 있는지 꼭 확인하세요.\n\n캐나다인들은 RGB 팬을 사용하면 DIY 공기 청정기 가격이 상당히 올라가요. 최근에는 RGB 팬 한 개가 $30-35 정도 하는데요; 위에 보신 대로, 평범한 Arctic 팬 5개 팩은 팬 당 $10 이하일 수 있어요. 저는 진짜 RGB 팬의 모습을 아주 좋아해요, 아이들 방에는 멋진 야간 조명이 되어주니까요. 아이들 방, 미디어 룸, 리크리에이션 룸, 놀이 방 등 집 안의 다양한 곳에 좋은 아이디어에요. 친구들 중 일부는 무대에서 공연 중에 공기 청정기로 사용하기도 했어요. 다양한 멋진 용도가 있지만, 건설 비용이 상당히 늘어나니까 유념해주세요. RGB 팬에 예산을 다 써버려서 이제 만드는 것은 그냥 평범한 것만 남았어요. LED 스트립으로 공기 청정기를 꾸밀 수도 있어요.\n\n## Splitter\n\n<div class=\"content-ad\"></div>\n\n올바른 팬을 얻으면 분배기 없이 데이지 체인을 할 수 있어요. 처음에는 올바른 팬을 구하지 못해서 분배기를 구해야 했어요. 사용하지 않는 팬 연결이 있다면 전기 테이프로 연결을 덮어두는 것이 좋을 수도 있어요. 이에 대해 전기 훈련을 받은 전문가와 상의하세요.\n\n다음 옵션을 구했어요. (2x1에서 5 분배기용으로 $15.99)\n\n또 다른 옵션입니다. (3x1에서 3 분배기용으로 $12.99)\n\n아마존 이외의 옵션입니다. (1에서 4 분배기용으로 $9.57)\n\n<div class=\"content-ad\"></div>\n\n## 하드웨어\n\n팬 그릴을 폼에 부착하고, 팬을 폼에 부착하기 위해 너트, 볼트,와 워셔가 필요합니다. 온라인으로 주문하는 것보다 직접 철물점을 방문하는 것이 더 나을 수 있습니다. 저는 결국 온라인에서 하드웨어를 사는 것을 포기하고 필요한 크기의 하드웨어를 현지 상점에서 모두 사버렸어요. 설치하는 각 팬은 네 군데에 부착되므로 사용하는 팬 수에 맞게 네 배의 하드웨어를 구해야 합니다. 캐나다인들에게는, 저는 하드웨어가 놀랍도록 비싼 것으로 발견했어요!\n\n원터: 옵션 1 또는 옵션 2\n\n너트\n\n<div class=\"content-ad\"></div>\n\n볼트: 옵션 1 또는 옵션 2\n\n# 가격\n\n일반 PC 팬(불빛 없음)으로 20x30 필터 크기의 타워를 만드는 비용을 각 장치 당 $228.90으로 계산했습니다. 세금 및 경우에 따라 운송 및 수입 수수료가 추가됩니다. 필터가 오래 걸려서 저스티의 의도했던 것이 맞습니다. 사진에 나온 것과는 다릅니다. 사진에 있는 것은 20x20 필터보다 작고 더 비쌌던 RGB 팬이 사용되었습니다.\n\n향후 제작 시 팬 그릴과 하드웨어를 더 싸게 구할 수 있어서 비용을 좀 더 낮출 수 있었습니다. 필터는 대량 주문으로 인한 절감도 있습니다. 친구와 대량 주문을 나누거나 많은 장치를 제작하는 것이 개별 장치 비용을 줄일 수 있습니다. 다만 대량 필터 주문을 할 수 있을 때까지 저축이 필요합니다. 만약 United Filter 옵션의 팬이 품질이 나쁘다면, 캐나다인들이 대량 MERV-13 필터를 어디서 구할 수 있는지 모르겠습니다. 사진에 나온 장치는 RGB 팬 비용 때문에 훨씬 더 비쌌습니다.\n\n<div class=\"content-ad\"></div>\n\nPC 팬 버전은 상자형 팬 CR 박스 버전에 비해 초기 비용이 비싸지만 둘 다 가격 대비 탁월한 가치를 제공합니다. PC 팬 자체는 6~8년 이상 또는 계속해서 작동해도 지속될 수 있습니다. 좋은 점은 부품이 매우 모듈식이라는 것입니다. 디바이스를 분해하고 다시 조립할 수 있습니다. 처음에 팬딜리어를 만들었지만 실패해서 전체 테이프를 제거하고 (테이프를 낭비했지만) 중력과 내 테이프가 잘 맞지 않아서 단순히 공중에 매달린 팬딜리어 대신 대지에 설치된 PC 팬 CR 박스로 재조립했습니다.\n\nPC 팬 버전은 등가 비용 상용 HEPA 필터에 비해 여전히 많은 여과 기능을 제공해야 합니다. Wissmann은 CADR을 500 근처로 측정했습니다 (20x30 3M 필트리트 필터와 9개의 140mm 팬 사용 시). 비교를 위해 2개의 허니웰 HEPA를 살펴보았습니다. Canadian Tire는 CADR이 48인 가장 작은 허니웰 HEPA에 $125를 청구합니다. 훨씬 큰 허니웰 HEPA는 $420이며 CADR이 338입니다. Wissmann의 Tower of Power 디자인은 이를 손쉽게 이기며, 더 조용하며 (1m 떨어진 거리에서 측정한 약 43 dB — 제 허니웰 HEPA는 최고 설정에서 56 dB로 측정되어 있으며 제가 사용 중인 방법입니다); 전력을 덜 소모합니다.\n\n전통적인 상자형 팬 CR 박스와 비교하면? 처음 CR 박스를 만들 때 비싼 필터를 사용했습니다. 20인치 상자형 팬은 일반적으로 약 $45이며 (NB에서 최근에 홈 하드웨어에서 $30에 Lasko 팬을 발견한 사람도 있지만 이 가격으로 정기적인 판매를 기대하지 마세요); 필트리트 대신 필터를 대량으로 주문해야 한다면 미국만 $88에 CR 박스를 만들 수 있습니다 (덕트 테이프 비용 제외). 특히 캐나다에서 3M 필트리트 필터를 사용하는 경우 가격이 더 비쌀 수 있습니다 — 판매 품목을 찾을 수 없다면 1개의 CR 박스를 만드는 데 최대 $170이 들 수도 있지만, 할인 품목을 구입할 수 있다면 $100-130 정도로 저렴할 수 있습니다. 작은 지역에서는 매장에서 MERV-13과 유사한 필터를 찾을 수 없을 수 있으며 온라인 주문을 해야 할 수도 있습니다.\n\n크기, 소음, 전력 소모의 교환을 고려할 때 이는 상당한 가격 차이입니다. 그러나 상자형 팬 CR 박스의 소음이 사용을 막아서거나 크기가 큐브 모양 때문에 불편하다면, 분명히 더 높은 비용을 지불해야 하는 경우에도 더 조용한 PC 팬 버전이 더 합리적일 것입니다.\n\n<div class=\"content-ad\"></div>\n\n나의 집에서 가장 작은 방에는 PC 팬 버전이 제공하는 유연성에 감사하다. 이 버전은 공간에서 덜 눈에 띄며 놀라울 만큼 조용하다. 침대에서 몇 피트밖에 떨어지지 않은 곳에서 밤낮으로 작동하는 PC 팬 DIY 공기 청정기에는 아무도 문제를 제기하지 않는다. 큐브 크기로 제한받지 않고 길고 납작한 DIY 공기 청정기를 만들 수 있다는 것은 정말 편리하다.\n\n만약 자선 단체, 마을, 교회, 기관 또는 학교를 위해 많은 DIY 공기 청정기를 대량 제작하려고 한다면, 비용과 시간 문제로 인해 전통적인 박스 선풍기 Corsi-Rosenthal 박스가 가장 현실적일 것이다. 캐나다인 경우 PC 팬 버전 한 대의 가격으로 약 2대의 전통적인 CR 박스를 만들 수 있다. 어떤 것이 가장 중요한지는 여러분이 결정해야 한다. 나의 경우, 집에서 PC 팬 버전으로 넘어간 것에 기뻐한다. 집 안 곳곳에 여러 박스 선풍기 CR 박스가 운전 중이었으면 좋겠다 생각하지 않지만, 알렉스의 \"와프 코어\" 디자인 3대 (끝 부분에 PC 팬이 쌓인 원형 HEPA 교체 필터)과 4개의 화로 필터 PC 팬 DIY 공기 청정기가 있으며, 추가로 더 만들 예정이다.\n\n시간적으로: 첫 번째 제작물은 4시간이 걸렸다. 두 번째 제작물은 3.5시간 소요되었는데 더 많은 팬과 RGB 배선이 있었다. 팬 원을 잘라내고 부품을 잘라내는 추가 노동을 고려하면 한 명이 제작 시간을 2시간 미만으로 줄이는 것이 어려울 수도 있겠지만, 나는 CR 박스를 30분 이내에 만들 수 있다. 그러나 만들어지면, PC 팬 버전을 우회할 이유가 없다. 어쨌든 실행하기 전면 PC 팬 버전이 저렴하며 (주거용) 상용 HEPA보다 거의 더 많은 공기를 정화하고 훨씬 조용하다.\n\n# 건설 프로세스\n\n<div class=\"content-ad\"></div>\n\n시작하기 전에, 필요한 모든 자료를 확인했어요. 다양한 곳에서 주문해서 도착하는 데 시간도 다르게 걸렸죠. 핫도그와 빵처럼, 부품들이 항상 같은 양으로 오지 않는 걸 보면서, 동시에 여러 가지를 만들고 있기 때문에 가지고 있는 부품의 수, 배송 중인 것, 그리고 \"한정 환원제\"가 무엇인지 계속 파악해야 했어요 — 필터가 먼저 다 떨어질까요, 아니면 선풍기가? 종종 볼트나 와셔였죠!\n\n먼저 모든 선풍기를 연결해서 작동하는지 확인하고, 작동 방법을 이해하는 것이 중요했어요.\n\n일부 이미지는 다른 제작물에서 가져왔어요. 초록색 DIY 공기 청정기를 제작할 때 적절한 이미지를 얻지 못한 게 이유에요.\n\n![image](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_4.png)\n\n<div class=\"content-ad\"></div>\n\n이번 빌드에서는 20x30 필터를 사용하려고 했지만 아직 도착하지 않아 20x20을 사용했어요. 8개의 팬을 사용했는데, 그 중 6개는 RGB 팬이었고 2개는 일반 팬이었어요. 20x30 폼 보드는 기기의 4면(위와 아래가 닫힌 패널 및 환풍구가 파여진 옆패널 2면)을 만드는 데 완벽한 크기였어요. 로브 위스만은 팬의 다양한 방향을 테스트했어요. 이 경우에는 팬을 반대편에(왼쪽과 오른쪽) 놓은 디자인을 선택했어요. 제가 사용한 이 120mm 팬은 제가 가지고 있는 것이기 때문에 선택했어요. 140mm는 장단점이 있지만 140mm 팬 가드를 얻기 어렵다는 것을 알았어요. 3D 프린터가 있었다면 제가 직접 만들었을 텐데요. 비-필터 측면(닫힌 패널 2면과 팬을 놓을 환풍구가 파인 2면)의 너비를 결정하기 위해 팬을 놓고 옆에 필터를 두고 사이에 1cm 간격을 둔 후 다른 쪽에 대해서도 반복했어요. 로브의 팬 성능을 비교한 쓰레드 중 하나인 링크를 첨부했어요. 그는 어떤 RGB 팬들은 사용 후 몇 달이 지나면 필터가 적용된 후 성능이 떨어진다는 것을 발견했어요.\n\n<div class=\"content-ad\"></div>\n\n간격을 두는 이유는 케이블에 공간을 제공하고 실수 여지를 남기기 위해서에요 😅\n\n![image](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_5.png)\n\n운 좋게도, 20x30 폼 보드를 이용해 4면을 잘라내어 딱 맞게 작업을 진행할 수 있었어요. 소량의 여분이 생겨나는 정도였죠. 이 장치를 만드는 데 사용된 폼 보드는 6달러 CAD 정도, 여러 색의 대량 폼 보드 주문 중에 사용한 가격이에요 (약 10개의 폼 코어 보드가 포함된 주문으로 60달러 정도).\n\n팬을 4개씩 각 면에 딱 맞게 배치해야 했기 때문에 여유 공간을 확보하기 위한 작업이 필요했어요. 모든 팬이 작동하는지 확인한 후, 다음 단계는 폼 보드를 잘라내어 어디에 자를지 결정하는 것이었죠. 팬을 서로 가깝게 배치하여 모두 맞출 수 있도록했어요. 20x30 필터를 사용하면 팬 사이의 공간을 조금 더 확보할 수 있어요. 컴퍼스 커터를 사용해 팬의 지름으로 설정하고 원형 구멍을 자르기 시작했어요.\n\n<div class=\"content-ad\"></div>\n\n팬이 12cm이므로 매 6cm마다 팬의 끝이거나 중심일 것입니다. 팬 센터가 나타내는 긴 선이 있는 6cm마다 선을 그어 나침반을 사용하여 원을 자릅니다.\n\n![이미지](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_6.png)\n\n4개의 원을 자름. 나머지 4개는 두 번째 보드에 자를 예정입니다. 이 부분이 가장 오랜 시간이 걸리는 부분입니다.\n\n혹시 장치에 다른 디자인을 원한다면, 폼 보드 위에 스티커를 붙이거나, 서랍 라이너나 다른 디자인을 넣을 수도 있습니다. 또는 종이를 붙여서 색칠하거나 그림을 그리거나 어린이 스티커를 붙일 수도 있습니다. 폼을 잘라내는 데 있어서 저는 가장 세게 자르지는 않으니까 보통 한 쪽을 자르고, 뒤집어서 다시 재서 반대쪽도 자르곤 해요. 그러면 쉽게 떨어져 나와요. 날이 달린 나침반 없이 이걸 하겠다고 상상할 수 없네요.\n\n<div class=\"content-ad\"></div>\n\n<table> 태그를 Markdown 형식으로 변경하세요.\n\n<div class=\"content-ad\"></div>\n\n팬 브랜드를 확인해서 공기가 어느 쪽으로 나가는지 확인하는 것이 좋아요. 지금까지 예쁜 로고 쪽이 공기를 빨아들이는 것 같아요. 하지만 모두가 해당하는 것은 아닐 수도 있어요.\n\n팬을 설치할 시간이에요!!\n\n![팬 이미지](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_8.png)\n\n팬 가드를 바깥쪽에 설치하고 팬을 안쪽에 설치했어요.\n\n<div class=\"content-ad\"></div>\n\n일부 사용된 하드웨어:\n\n![이미지](/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_9.png)\n\n이 특정 빌드에서는 RGB 팬 6개와 일반 팬 2개를 사용했습니다. 일반 팬을 덜 눈에 띄는 \"뒷면\"에 설치했습니다. 두 필터 측면을 바닥에 테이프로 고정하고 팬 패널 하나를 테이프로 고정했습니다. 상단과 한 면을 열어두면 손을 넣어 무언가를 연결하는 것이 가능합니다. 팬 패널이 수직으로 배치된 경우보다 반대편에 있는 팬 패널이 있는 경우가 더 쉬운 것으로 발견했습니다.\n\n아래는 배선 사진들입니다. 이 이미지들은 처음에 이 단계의 좋은 사진을 얻지 못하여 다른 빌드에서 가져왔습니다:\n\n<div class=\"content-ad\"></div>\n\n\n<img src=\"/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_10.png\" />\n\n이제 물건을 꽂고 케이블을 옆으로 테이핑하여 팬에 들어가지 않도록 해야 합니다.\n\n<img src=\"/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_11.png\" />\n\n공기 청정기에서 전원 케이블을 꺼내려면 발포 패널 하나에 구멍을 뚫어야 합니다. 그 후, 구멍 주위에 테이프를 붙여 기기를 밀봉할 수 있습니다.\n\n\n<div class=\"content-ad\"></div>\n\n마지막 단단한 패널을 누르기 전에 모든 것이 작동하는지 확인하기 위해 장치를 연결했습니다. 이전에 모든 선풍기를 테스트했기 때문에 모두 작동할 것이라고 확신했습니다. 성공!\n\n이 디자인은 완전히 Rob Wissmann의 것을 기반으로 합니다. 이 특정 모델은 CADR이 더 높지 않습니다. 내 필터는 20x20 크기이고, 선풍기는 8개이며 12cm가 아니라 14cm입니다. 내가 만든 것에 CADR을 측정할 수 있는 방법이 없습니다. (사진에 나와 있는 두 번째 제작물은 보다 작은 필터를 사용하며, 16x16 크기에 6개의 선풍기만 사용했습니다.)\n\n내가 아는 한 건설과 관련된 유일한 다른 차이점은 RGB 전원 추가입니다. 이것은 @CRBoxKits로부터 배운 것입니다.\n\n난 NIOSH 앱을 사용하여 데시벨을 측정했습니다. 선풍기 쪽으로부터 1m 떨어진 곳에서 45 dB이었지만 주변 가족 소음이 기여했습니다. 필터로부터 1m 떨어진 곳에서는 40 dB였습니다.\n\n<div class=\"content-ad\"></div>\n\n저에게는 PC 팬의 놀라운 조용함이 꽤 중독적인 것 같아요. PC 팬과 배선, 하드웨어를 구매할 자금과 구멍을 잘라서 조립할 시간이 있다면, 좋은 DIY 공기 청정기를 만들 수 있는 만족스러운 프로젝트가 될 거예요. 이 글이 여러분이 가지고 있는 옵션을 이해하고 PC 팬 Corsi-Rosenthal 박스를 만드는 데 도움이 되기를 바래요.\n\n# 결론\n\n개인적으로 나는 사람들에게 상자 선풍기와 PC 팬 CR 박스 두 가지를 보여주고 옹호할 거예요. 각각 독특한 장단점이 있어요. 많은 공간이 있는 대형 커뮤니티 홀이나 전반적으로 소음 수준이 높은 장소에는 전통적인 상자 선풍기 CR 박스가 여전히 합리적인 선택이라고 생각해요. 예를 들어, 댄스 파티나 커뮤니티 식사가 열리는 장소 같은 곳이죠. 100~150달러 캐나다(이하 CAD)에 전통적인 상자 선풍기 CR 박스가 높은 CADR을 제공해주니 가격 대비 좋은 선택이에요.\n\n어떤 기업들은 컴퓨터 팬 옵션을 선호할 수도 있어요. 이 옵션은 더 작고 조용하기 때문이죠. 다른 공간에서 전통적인 상자 선풍기 버전을 옹호하는 것이 간단해요. 상자 선풍기를 열거나 그 구성 요소를 수정할 필요가 없어서 팬과 그 부품의 무결성이 완전히 유지되고 위험이 없을 거예요. 이 글의 맨 아래에는 EPA 보고서와 환경 보건 국립 협력 센터(National Collaborating Centre for Environmental Health)의 CR 박스의 안전성과 유효성에 관한 보고서 링크를 걸어놨어요. PC 팬 버전의 경우 빌더가 전원 어댑터를 구해야 하기 때문에 DIY 공기 청정기의 PC 팬 버전을 받아들이는 데 좀 더 망설임이 있을 수 있다고 이해해요.\n\n<div class=\"content-ad\"></div>\n\n# 참고 자료\n\n## 도움이 된 사진 및 동영상 목록입니다\n\n매튜 올리버의 작품:\n\nRob Wissmann이 IKEA HEPA 필터로 하나를 만드는 YouTube 동영상\n\n<div class=\"content-ad\"></div>\n\n앤드루 도비\n\n알렉스 \"CR everywhere\"\n\n조이 폭스는 미디엄과 트위터에서 활동 중입니다.\n\n그의 웹사이트에 게시된 정보 중 HEPA 필터 소음 문제에 대한 글이 있습니다.\n\n<div class=\"content-ad\"></div>\n\n제 생방송 스레드에서 공유하는 중요한 링크:\n\n- [Ontario Society of Professional Engineers 실내공기질 보고서](링크)\n- [Canadian Aerosol Transmission Coalition](링크)\n\n<div class=\"content-ad\"></div>\n\nCorsi-Rosenthal Foundation\n\nClean Air Kits\n\nJoey Fox의 웹사이트\n\n캐나다 십대 Shiven Taneja의 웹사이트에는 CR 상자 지침서 및 아이들을 위한 활동북이 있습니다.\n\n<div class=\"content-ad\"></div>\n\n이 Old House가 CR 상자를 건설했어요. [링크](https://youtu.be/wh4AxNkZyrE)\n\nEngineers Canada 국가 입장문 — 대기 중 오염물질 감소를 위한 환기 시스템과 건물 관리\n\nCDC 건물 환기\n\nASHRAE 교육 시설을 위한 설계 지침: 고급 실내 공기 질에 대한 우선순위 설정\n\n<div class=\"content-ad\"></div>\n\n직업 건강 클리닉 (OHCOW) — COVID 19 자료\n\nClean Air Crew\n\n미국 백악관 — 공기 청정을 위해\n\nEPA DIY 공기 청정기 안전 및 효과성 연구\n\n<div class=\"content-ad\"></div>\n\nNational Collaborating Centre for Environmental Health Do-it-yourself (DIY) air cleaners: Evidence on effectiveness and considerations for safe operation\n\nNB Lung video on building a CR box","ogImage":{"url":"/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_0.png"},"coverImage":"/assets/img/2024-06-23-BusymombuildsaPCfanCorsi-Rosenthalbox_0.png","tag":["Tech"],"readingTime":17},{"title":"프로그래밍을 배울 때 매일 코딩해야 하는 이유","description":"","date":"2024-06-23 18:03","slug":"2024-06-23-WhyYouNeedToCodeEveryDayWhenYoureLearningToProgram","content":"\n\n![image](/assets/img/2024-06-23-WhyYouNeedToCodeEveryDayWhenYoureLearningToProgram_0.png)\n\n첫 번째로 컴퓨터 프로그래밍을 스스로 가르치고 있을 때, 주말에 큰 시간을 내어 자습서를 공부하곤 했어요. 몇 시간 뒤에는 항상 진짜로 진전을 이루었다는 느낌을 받곤 했어요.\n\n그러나 다음 주말이 돌아오기 전에 배운 것들이 많이 사라졌어요. \"음, 어떻게 하죠... 다시 2차원 배열에서 요소를 선택하는 거였죠? 이걸 배웠다고 생각했는데?\" 구웃. 도와주세요.\n\n그래서 저는 우울한 루프에 빠지기 시작했어요: 매주 첫 번째 절반 시간을 속도를 내기 위해 썼고, 일주일 전에 배운 내용을 다시 흡수하는 데에만 시간을 보내곤 했어요. 짜증이 났어요.\n\n<div class=\"content-ad\"></div>\n\n이제쯤이면 아시겠지만, 프로그래밍을 배우는 올바른 방법은 아니에요.\n\n소프트웨어 분야에서 친구들이 말한 대로, 매일 조금씩 코딩해보는 게 올바른 방법이에요. 매일 15분씩만 해도 일주일에 몇 시간을 정해놓는 것보다 효과가 더 좋아요.\n\n내가 그렇게 시작하면서 개념이 정말 머릿속에 박히기 시작했어요. 물론, 여전히 몇 가지를 잊어버리곤 했어요. 오늘도 가끔 그렇지만요. 심지어 오랜 기간 일해온 프로그래머들조차 자주 구글링을 하는 법이죠. 그런데 기본 코딩 개념과 주요 패턴은 내 머릿속에 남아 있었어요. 매일 조금이라도 하는 한요.\n\n결국 일일 루틴이 주간 루틴보다 우세한 이유를 설명하는 멋진 과학적 근거가 있다고 하더라구요.\n\n<div class=\"content-ad\"></div>\n\n이것을 \"망각의 에빙하우스 곡선\"이라고합니다.\n\n1880년대에 독일 심리학자 헤르만 에빙하우스는 기억의 본질 - 보다 구체적으로 망각의 본질에 관심을 갖게 되었습니다. 우리가 방금 배운 것을 얼마나 오래 잊어버릴까요?\n\n그래서 그는 자신에게 흥미로운 실험을 진행했습니다. 그는 2,300개의 세 글자 조합을 생성했습니다. (그것들은 의미가 없는, 즉 실제 단어가 아닌 것들이었습니다). 그런 다음 그는 그들을 외우기 위해 앉았습니다. 그는 자주 자신을 테스트하여 단어를 기억할 수 있는지 확인했고, 그게 불가능한 경우 얼마나 많은 날이 지났는지도 확인했습니다.\n\n에빙하우스는 우리가 것을 정말 빨리 잊는다는 것을 발견했습니다. 새로 외운 단어를 처음 암기한 지 20분 후에, 그는 그 중 약 40%를 잊어버렸습니다. 1시간 후에는 50% 이상을 잊어버렸습니다. 그리고 하루 뒤 자신을 테스트해보면, 그는 더 많은 것을 잊었습니다. 글자 조합의 약 3분의 2가 이제 그의 기억에서 사라져 있었습니다.\n\n<div class=\"content-ad\"></div>\n\n하지만, 그 이후로는 망각 속도가 느려졌습니다. 만약 6일 후에 시험을 보았다면, 그가 잊어버린 정도는 약 75%로 약간 더 상승했습니다. 한 달 후에는 약 80%로 증가했습니다.\n\n기본적으로, 그는 3글자 조합의 대부분을 빠르게 잊어버렸습니다. 그러나 기억해둔 것들? 이제 그것들은 그의 기억에 영원히 남아 있는 것처럼 보였습니다.\n\n이것이 망각의 에빙하우스 곡선으로 알려진 현상이며, 이것을 이렇게 시각화할 수 있습니다 ...\n\n![이미지](/assets/img/2024-06-23-WhyYouNeedToCodeEveryDayWhenYoureLearningToProgram_1.png)\n\n<div class=\"content-ad\"></div>\n\n지난 몇 년 동안 인지 심리학자들은 대체로 에빙하우스의 연구 결과가 유효하다고 발견했습니다.\n\n왜 이렇게 망각이 작용할까요? 이는 단기기억과 장기기억이 어떻게 상호작용하는지와 관련이 있습니다.\n\n새로운 정보를 처음 만났을 때, 우리의 단기기억이 그것을 잡아냅니다 — 우리가 생각할 때 그 데이터를 사용하는 데 도움을 줍니다. 그러나 단기기억은 그 이름에서 알 수 있듯이 그리 오래 지속되지 않습니다.\n\n그에 비해 장기기억은 정말 머릿 속에 오래 유지되는 지식을 포함하고 있습니다. 그러나 무언가를 장기기억에 넣으려면 그 새로운 정보를 자주 만나야 합니다. 이상적으로는 그 정보를 사용해야 합니다 — 생각 과제나 실제 활동에서 사용해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n저기요, 어떤 방향으로 향하는지 이미 감이 오시나요?\n\n에빙하우스와 그의 추종자들은 우리가 예측 가능한 방식으로 것을 잊어버리기 때문에, 이러한 과정을 역으로 조작할 수 있다고 이론을 세웠어요.\n\n우리가 몇 일마다 새로운 지식을 재방문하는 것을 적극적으로 계속해 나간다면, 그 지식이 우리 장기기억으로 넘어가고 우리 마음의 전반적인 지식 기반이 되는 가능성이 크게 높아질 거예요. 이것이 \"활용하거나 잃어버리기\"인 거죠.\n\n저는 매일 코딩을 시작했을 때 정확히 이런 일이 일어났어요. 매일 몇 분씩 프로그래밍 과제에 매달리면서 (예를 들면 Glitch나 Codepen에서 누군가의 프로젝트를 리믹싱하거나 새 라이브러리를 만져보는 등), 배운 코딩 개념들이 모두 손에 익게 유지되었어요. 게다가 새로운 것을 배우는 것이 더 빨라졌어요, 왜냐하면 단 몇 일 전에 배운 것 위에 새로운 레고 조각을 끼워 넣었기 때문이죠.\n\n<div class=\"content-ad\"></div>\n\n그리고 물론, 이것은 훌륭한 전진 동력을 만들어 냈습니다! 안장에 뛰어 들기가 더 쉬워지자, 거기에 머무르고 싶었어요. 짧은 코딩 폭발을 하려고 앉아 있는데 - 그러다가 그루브에 몰입하고 몇 시간을 툭 툭 거의 밤을 넘어갈 때쯤 눈을 떠보면서, 오메, 많은 시간을 보내고 있었다고 발견하게 되었어요 (이미 오래 전에 자러 가야했지만, ㅋㅋ).\n\n새로운 음악 기법을 배우는 데에도 같은 것을 느낄 때가 있어요. 저는 기타를 치고 Logic Pro를 이용해서 조금의 경쾌한 음악 제작을 해요. 한동안 연주(또는 제작)하지 않으면 녹슬어져요. 그런데 정기적으로 앉아서 연습을 하거나 트랙을 작업할 때, 배우는 모든 것이 되게 기억에 남아요.\n\n(매우 정교하게 하고 싶다면, 이밍하우스 이용 곡선을 역행하는 앱이 따로 디자인되어 있답니다. 이것을 \"간격 반복\" 앱이라고 합니다: 플래시 카드를 만들고, 그런 다음 앱을 사용해서 매일쯤 자가검사를 하세요. 소프트웨어는 당신이 배운 내용과 잊어버린 내용을 주의 깊게 살펴보고, 언제 그것을 배웠거나 잊어버렸는지를 고려해서 당신이 재퀴즈를 할 지적저쨌든 (이론적으로 말이죠) 그것을 장기기억에 새기기에 정확히 적절한 때에 다시 테스트합니다. 이런 것들이 얼마나 잘 작동하는지에 대한 논란은 있지만, 솔직히 저는 이것을 시도해본 적이 없어요. 그러나 새로운 언어를 배우기 위해 사용한 사람들과 이것을 이용하여 큰 도움을 받았다고 맹세하는 사람들과 이야기를 나눠 본 적이 있어요. 하지만 개인차가 있을 수 있겠어요.)\n\n그래서, 그렇죠: 활용하지 않으면 잊게 되죠. 프로그래밍을 배우고 싶다면, 매일 조금씩 시간을 내어 실습해 보세요. 다른 기술도 마찬가지예요.\n\n<div class=\"content-ad\"></div>\n\n아마도 이미 이 규칙을 알고 계셨을 거예요!\n\n하지만 이제 그 이유를 아시게 되셨네요.\n\n(이 글을 즐겼다면? 그렇다면 “clap” 버튼을 꼭 눌러주세요 (ㅋ) 아래에 있습니다. 한 독자 당 최대 50번의 박수를 버틸 수 있어요!)\n\n또한 저의 월간 뉴스레터 “The Linkfest”를 즐기실 수도 있을 거예요. 웹에서 찾은 최고의 콘텐츠들을 정리한 뉴스레터입니다. “파멸 스크롤링과는 정반대.”\n\n<div class=\"content-ad\"></div>\n\n저는 뉴욕 타임스 매거진에 기고하는 작가이자, Wired와 Smithsonian 매거진의 칼럼니스트이며, Mother Jones에 꾸준히 기고하는 작가입니다. 또한, \"Coders: The Making of a New Tribe and the Remaking of the World”와 “Smarter Than You Think: How Technology is Changing our Minds for the Better\"의 저자이기도 합니다. 트위터와 인스타그램에서 @pomeranian99를, Mastodon에서는 @clive@saturation.social을 사용하고 있어요.","ogImage":{"url":"/assets/img/2024-06-23-WhyYouNeedToCodeEveryDayWhenYoureLearningToProgram_0.png"},"coverImage":"/assets/img/2024-06-23-WhyYouNeedToCodeEveryDayWhenYoureLearningToProgram_0.png","tag":["Tech"],"readingTime":5},{"title":"주말 AI 프로젝트 라즈베리 파이에서 음성 인식과 LLaMA-2 GPT 실행하는 방법","description":"","date":"2024-06-23 18:01","slug":"2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi","content":"\n\n<img src=\"/assets/img/2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi_0.png\" />\n\n요즘에는 클라우드에서 딥 러닝 모델을 실행하는 것에는 누구도 놀라지 않을 것입니다. 그러나 엣지나 소비자 기기 세계에서는 상황이 훨씬 복잡해질 수 있습니다. 이에는 여러 가지 이유가 있습니다. 먼저, 클라우드 API를 사용하려면 기기가 항상 온라인 상태여야 합니다. 이는 웹 서비스에는 문제가 되지 않지만 인터넷 액세스 없이 기능을 유지해야 하는 기기에는 결정적인 문제가 될 수 있습니다. 둘째, 클라우드 API는 비용이 들며, 고객들은 또 다른 구독료를 지불하기를 좋아하지 않을 것입니다. 마지막으로 몇 년 후에 프로젝트가 완료되고 API 엔드포인트가 종료되면 비싼 하드웨어는 벽돌처럼 변할 수 있습니다. 이는 고객, 생태계 및 환경에게 친숙하지 않습니다. 그래서 사용자 하드웨어가 완전히 오프라인에서 작동해야 하고 추가 비용 없이 또는 온라인 API를 사용하지 않고 (옵션일 수 있지만 의무적이어서는 안 됨) 이 살기 좋은 상황이 되어야 한다고 확신합니다.\n\n이 기사에서는 Raspberry Pi에서 LLaMA GPT 모델과 자동 음성 인식 (ASR)을 실행하는 방법을 보여드리겠습니다. 이를 통해 Raspberry Pi에 질문을 하고 답변을 받을 수 있게 될 겁니다. 약속한 대로, 이 모든 것이 완전히 오프라인에서 작동할 것입니다.\n\n시작해 보겠습니다!\n\n<div class=\"content-ad\"></div>\n\n이 기사에 제시된 코드는 라즈베리 파이에서 작동되도록 의도되었습니다. 그러나 \"디스플레이\" 부분을 제외한 대부분의 메소드는 윈도우, OSX 또는 리눅스 노트북에서도 작동할 것입니다. 따라서 라즈베리 파이를 갖고 있지 않은 독자들도 어떠한 문제없이 코드를 쉽게 테스트할 수 있습니다.\n\n## 하드웨어\n\n이 프로젝트에서는 라즈베리 파이 4를 사용할 것입니다. Linux를 실행하는 싱글 보드 컴퓨터로, 작고 팬 및 액티브 쿨링 없이 5V DC 전원만 필요합니다:\n\n![라즈베리 파이](/assets/img/2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi_1.png)\n\n<div class=\"content-ad\"></div>\n\n2023년 신제품 라즈베리 파이 5는 더 좋을 것으로 예상됩니다. 벤치마크에 따르면 거의 2배 빨라졌다고 합니다. 하지만 거의 50% 더 비싸며, 저희 테스트에는 모델 4가 충분합니다.\n\nRAM 크기에 대해 두 가지 옵션이 있습니다:\n\n- 8GB RAM이 장착된 라즈베리 파이는 7B LLaMA-2 GPT 모델을 실행할 수 있게 해줍니다. 4비트 양자화 모드에서의 메모리 사용량은 약 5GB입니다.\n- 2 또는 4GB 장치는 TinyLlama-1B와 같은 더 작은 모델을 실행할 수 있습니다. 이 모델은 빠르지만, 나중에 살펴볼 것처럼 답변이 약간 덜 \"스마트\"할 수 있습니다.\n\n두 모델 모두 HuggingFace에서 다운로드할 수 있으며, 일반적으로 코드 변경이 거의 필요하지 않습니다.\n\n<div class=\"content-ad\"></div>\n\n라즈베리 파이는 완전한 리눅스 컴퓨터이며 SSH를 통해 터미널에서 쉽게 출력을 볼 수 있습니다. 하지만 이것은 로봇과 같은 모바일 장치에 적합하지 않아 재미있지 않을 수 있습니다. 라즈베리 파이에는 단색 128x64 I2C OLED 디스플레이를 사용할 것입니다. 이 디스플레이는 연결하기 위해 단지 4개의 전선이 필요합니다:\n\n![Image](/assets/img/2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi_2.png)\n\n디스플레이와 전선은 아마존에서 5달러에서 10달러에 구할 수 있으며, 납땜 기술이 필요하지 않습니다. 라즈베리 파이 설정에서 I2C 인터페이스를 활성화해야 합니다. 이에 대한 충분한 자습서가 있습니다. 간단함을 위해 하드웨어 부분은 생략하고 Python 코드에만 집중하겠습니다.\n\n## 디스플레이\n\n<div class=\"content-ad\"></div>\n\n화면 테스트 중에 무언가를 화면에서 확인하는 것이 좋습니다. Adafruit_CircuitPython_SSD1306 라이브러리를 사용하면 OLED 디스플레이에 어떤 이미지든 표시할 수 있습니다. 이 라이브러리는 Low-level 인터페이스를 가지고 있어서 픽셀을 그리거나 메모리 버퍼에서 모노크롬 비트맵만을 그릴 수 있습니다. 스크롤 가능한 텍스트를 사용하기 위해 텍스트 버퍼를 저장하는 배열과 텍스트를 그리는 `_display_update` 메서드를 작성했습니다:\n\n```js\nfrom PIL import Image, ImageDraw, ImageFont\ntry:\n    import board\n    import adafruit_ssd1306\n    i2c = board.I2C()\n    oled = adafruit_ssd1306.SSD1306_I2C(pixels_size[0], pixels_size[1], i2c)\nexcept ImportError:\n    oled = None\n\nchar_h = 11\nrpi_font_poath = \"DejaVuSans.ttf\"\nfont = ImageFont.truetype(rpi_font_poath, char_h)\npixels_size = (128, 64)\nmax_x, max_y = 22, 5\ndisplay_lines = [\"\"]\n\ndef _display_update():\n    \"\"\"화면에 텍스트를 표시합니다.\"\"\"\n    global oled\n    image = Image.new(\"1\", pixels_size)\n    draw = ImageDraw.Draw(image)\n    for y, line in enumerate(display_lines):\n        draw.text((0, y*char_h), line, font=font, fill=255, align=\"left\")\n\n    if oled:\n        oled.fill(0)\n        oled.image(image)\n        oled.show()\n```\n\n여기서 (22, 5) 변수는 표시할 수 있는 행과 열의 수를 나타냅니다. oled 변수는 ImportError가 발생하는 경우 None일 수도 있습니다. 예를 들어, 랩톱에서 라즈베리 파이 대신에 이 코드를 실행하는 경우입니다.\n\n또한 텍스트 스크롤링을 에뮬레이션하기 위해 두 개의 도우미 메서드도 작성했습니다.\n\n<div class=\"content-ad\"></div>\n\n```js\ndef add_display_line(text: str):\n    \"\"\" 새로운 줄을 추가하고 스크롤링합니다. \"\"\"\n    global display_lines\n    # 화면 너비에 따라 텍스트를 청크로 분할합니다.\n    text_chunks = [text[i: i+max_x] for i in range(0, len(text), max_x)]\n    for text in text_chunks:\n        for line in text.split(\"\\n\"):\n            display_lines.append(line)\n            display_lines = display_lines[-max_y:]\n    _display_update()\n\ndef add_display_tokens(text: str):\n    \"\"\" 새 토큰을 추가하고 줄바꿈 유무를 선택합니다. \"\"\"\n    global display_lines\n    last_line = display_lines.pop()\n    new_line = last_line + text\n    add_display_line(new_line)\n```\n\n첫 번째 메소드는 새로운 줄을 디스플레이에 추가합니다. 문자열이 너무 길면 자동으로 여러 줄로 나눠집니다. 두 번째 메소드는 \"개행 없이\" 텍스트 토큰을 추가합니다. 이것은 GPT 모델의 답변을 표시할 때 사용할 것입니다. add_display_line 메소드를 사용하여 위와 같은 코드를 작성할 수 있습니다:\n\n```js\nfor p in range(20):\n    add_display_line(f\"{datetime.now().strftime('%H:%M:%S')}: Line-{p}\")\n    time.sleep(0.2)\n```\n\n모든 것이 제대로 되었다면, 출력은 다음과 같아야 합니다:\n\n<div class=\"content-ad\"></div>\n\n\n![image](https://miro.medium.com/v2/resize:fit:1400/1*e9u31X5qtrbHccByJAA8pw.gif)\n\n외부 디스플레이용 Luma-oled와 같은 특별한 라이브러리도 있지만, 우리의 솔루션은 이 작업에 충분히 좋습니다.\n\n## 자동 음성 인식 (ASR)\n\nASR에 대해, 저희는 HuggingFace 🤗의 Transformers 라이브러리를 사용할 것입니다. 이를 통해 몇 줄의 Python 코드로 음성 인식을 구현할 수 있습니다:\n\n\n<div class=\"content-ad\"></div>\n\n```js\nfrom transformers import pipeline\nfrom transformers.pipelines.audio_utils import ffmpeg_microphone_live\n\nasr_model_id = \"openai/whisper-tiny.en\"\ntranscriber = pipeline(\"automatic-speech-recognition\",\n                       model=asr_model_id,\n                       device=\"cpu\")\n```\n\n여기서는 680K 시간의 음성 데이터로 학습된 Whisper-tiny-en 모델을 사용했어요. 이 모델은 가장 작은 Whisper 모델로, 파일 크기가 151MB에요. 모델을 로드하면 ffmpeg_microphone_live 메서드를 사용하여 마이크에서 데이터를 가져올 수 있어요:\n\n```js\ndef transcribe_mic(chunk_length_s: float) -> str:\n    \"\"\" 마이크에서 오디오를 인식합니다 \"\"\"\n    global transcriber\n    sampling_rate = transcriber.feature_extractor.sampling_rate\n    mic = ffmpeg_microphone_live(\n            sampling_rate=sampling_rate,\n            chunk_length_s=chunk_length_s,\n            stream_chunk_s=chunk_length_s,\n        )\n    \n    result = \"\"\n    for item in transcriber(mic):\n        result = item[\"text\"]\n        if not item[\"partial\"][0]:\n            break\n    return result.strip()\n```\n\n실제로 구문을 말하기에는 5-10초가 충분해요. 라즈베리 파이에는 마이크가 없지만 USB 마이크를 사용할 수 있어요. 이 코드는 노트북에서도 테스트할 수 있어요; 이 경우 내장 마이크가 사용될 거예요.\n\n<div class=\"content-ad\"></div>\n\n## 대형 언어 모델 (LLM)\n\n이제 대형 언어 모델을 추가해 봅시다. 먼저, 필요한 라이브러리를 설치해야 합니다:\n\n```js\npip3 install llama-cpp-python\npip3 install huggingface-hub sentence-transformers langchain\n```\n\nLLM을 사용하기 전에 해당 모델을 다운로드해야 합니다. 이전에 논의했던 것처럼, 두 가지 옵션이 있습니다. 8GB 라즈베리 파이의 경우 7B 모델을 사용할 수 있습니다. 2GB 장치의 경우 1B \"작은\" 모델이 유일한 선택지이며, 더 큰 모델은 RAM에 들어가지 않습니다. 모델을 다운로드하려면 huggingface-cli 도구를 사용할 수 있습니다:\n\n<div class=\"content-ad\"></div>\n\n```js\nhuggingface-cli 다운로드 TheBloke/Llama-2-7b-Chat-GGUF llama-2-7b-chat.Q4_K_M.gguf --local-dir . --local-dir-use-symlinks False\nOR\nhuggingface-cli 다운로드 TheBloke/TinyLlama-1.1B-Chat-v1.0-GGUF tinyllama-1.1b-chat-v1.0.Q4_K_M.gguf --local-dir . --local-dir-use-symlinks False\n```\n\n우리는 Llama-2-7b-Chat-GGUF와 TinyLlama-1.1B-Chat-v1.0-GGUF 모델을 사용하고 있습니다. 더 작은 모델은 빠르게 작동하지만, 더 큰 모델은 잠재적으로 더 나은 결과를 제공할 수 있습니다.\n\n모델을 다운로드하고 나면, 사용할 수 있습니다:\n\n```js\nfrom langchain.llms import LlamaCpp\nfrom langchain.callbacks.manager import CallbackManager\nfrom langchain.callbacks.streaming_stdout import StreamingStdOutCallbackHandler\nfrom langchain.prompts import PromptTemplate\nfrom langchain.schema.output_parser import StrOutputParser\n\nllm: Optional[LlamaCpp] = None\ncallback_manager: Any = None\n\nmodel_file = \"tinyllama-1.1b-chat-v1.0.Q4_K_M.gguf\"  # OR \"llama-2-7b-chat.Q4_K_M.gguf\"\ntemplate_tiny = \"\"\"<|system|>\n                   You are a smart mini computer named Raspberry Pi. \n                   Write a short but funny answer.</s>\n                   <|user|>\n                   {question}</s>\n                   <|assistant|>\"\"\"\ntemplate_llama = \"\"\"<s>[INST] <<SYS>>\n                    You are a smart mini computer named Raspberry Pi.\n                    Write a short but funny answer.</SYS>>\n                    {question} [/INST]\"\"\"\ntemplate = template_tiny\n\n\ndef llm_init():\n    \"\"\" 큰 언어 모델 로드 \"\"\"\n    global llm, callback_manager\n\n    callback_manager = CallbackManager([StreamingCustomCallbackHandler()])\n    llm = LlamaCpp(\n        model_path=model_file,\n        temperature=0.1,\n        n_gpu_layers=0,\n        n_batch=256,\n        callback_manager=callback_manager,\n        verbose=True,\n    )\n\n\ndef llm_start(question: str):\n    \"\"\" LLM에게 질문하기 \"\"\"\n    global llm, template\n\n    prompt = PromptTemplate(template=template, input_variables=[\"question\"])\n    chain = prompt | llm | StrOutputParser()\n    chain.invoke({\"question\": question}, config={})\r\n```\n\n<div class=\"content-ad\"></div>\n\n흥미로운 점은 두 모델이 동일한 LLaMA 이름을 갖고 있지만, 다른 프롬프트 형식을 사용하여 훈련되었다는 것입니다.\n\n모델 사용은 간단하지만 여기가 까다로운 부분입니다: OLED 화면에 대답 토큰을 한 번에 하나씩 표시해야 합니다. 이를 위해 사용자 정의 콜백을 사용할 것인데, 이 콜백은 LLM이 새로운 토큰을 생성할 때마다 실행됩니다:\n\n```js\nclass StreamingCustomCallbackHandler(StreamingStdOutCallbackHandler):\n    \"\"\" LLM 스트리밍을 위한 콜백 핸들러 \"\"\"\n\n    def on_llm_start(\n        self, serialized: Dict[str, Any], prompts: List[str], **kwargs: Any\n    ) -> None:\n        \"\"\" LLM이 실행을 시작할 때 실행됩니다 \"\"\"\n        print(\"<LLM 시작>\")\n        \n    def on_llm_end(self, response: Any, **kwargs: Any) -> None:\n        \"\"\" LLM이 실행을 끝낼 때 실행됩니다 \"\"\"\n        print(\"<LLM 종료>\")\n        \n    def on_llm_new_token(self, token: str, **kwargs: Any) -> None:\n        \"\"\" 새로운 LLM 토큰이 있을 때 실행됩니다. 스트리밍이 활성화된 경우에만 사용 가능합니다 \"\"\"\n        print(f\"{token}\", end=\"\")\n        add_display_tokens(token)\r\n```\n\n여기서는 이전에 만들었던 add_display_tokens 메서드를 사용했습니다. 출력 메서드도 사용되었기 때문에 똑같은 코드가 라즈베리 파이 없이 일반 PC에서도 실행될 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 테스트\n\n마침내, 모든 부분을 결합할 때입니다. 코드는 간단합니다:\n\n```js\nif __name__ == \"__main__\":\n    add_display_line(\"Init automatic speech recogntion...\")\n    asr_init()\n\n    add_display_line(\"Init LLaMA GPT...\")\n    llm_init()\n\n    while True:\n        # Q-A loop:\n        add_display_line(\"Start speaking\")\n        add_display_line(\"\")\n        question = transcribe_mic(chunk_length_s=5.0)\n        if len(question) > 0:\n            add_display_tokens(f\"> {question}\")\n            add_display_line(\"\")\n\n            llm_start(question)\r\n```\n\n여기서 Raspberry Pi는 오디오를 5초 동안 기록한 후, 음성 인식 모델이 오디오를 텍스트로 변환하고, 마지막으로 인식된 텍스트를 LLM으로 보냅니다. 끝나면 프로세스가 반복됩니다. 이 접근 방식은 예를 들어 자동 오디오 수준 임계값을 사용함으로써 개선할 수 있지만, \"주말 프로젝트\" 목적으로 충분히 좋습니다.\n\n<div class=\"content-ad\"></div>\n\n실제로는 다음과 같은 출력이 나타납니다:\n\n![image](https://miro.medium.com/v2/resize:fit:1400/1*78EMd_4kEMduoLN8z_pwdA.gif)\n\n여기에서 라즈베리 파이 4에서의 1B LLM 추론 속도를 확인할 수 있습니다. 이전에 언급한 바와 같이, 라즈베리 파이 5는 30~40% 더 빠를 것으로 예상됩니다.\n\n\"BLEU\"나 \"ROUGE\"와 같은 \"공식적인\" 벤치마크를 사용하여 1B와 7B 모델의 품질을 비교하지는 않았습니다. 주관적으로 7B 모델은 더 정확하고 정보를 많이 제공하는 답변을 제공하지만, 더 많은 RAM이 필요하며, 로딩하는 데 더 많은 시간이 걸립니다(파일 크기는 각각 4.6GB와 0.7GB입니다) 그리고 3~5배 더 느리게 작동합니다. 전력 소비에 관해서는, 라즈베리 파이 4는 평균 3~5W를 소비하며, 실행 중인 모델, 연결된 OLED 스크린, USB 마이크로폰이 있는 상태에서 필요합니다.\n\n<div class=\"content-ad\"></div>\n\n## 결론\n\n이 글에서는 라즈베리 파이(Raspberry Pi)에서 자동 음성 인식 및 대형 언어 모델을 실행할 수 있었습니다. 라즈베리 파이는 완전히 자율적으로 실행할 수 있는 휴대용 리눅스 컴퓨터입니다. 클라우드에서 다른 모델을 사용할 수도 있지만, 실제로 만질 수 있고 작동 방식을 볼 수 있는 것이 더 재미있는 것 같아요.\n\n이러한 프로토타입은 GPT 모델 사용에 있어 흥미로운 이정표가 됩니다. 1~2년 전에는 저렴한 소비자용 하드웨어에서 대형 언어 모델을 실행하는 것이 상상도 할 수 없었죠. 우리는 인간의 음성을 이해하고 텍스트 명령에 응답하거나 다양한 작업을 수행할 수 있는 스마트 기기 시대로 진입하고 있습니다. 아마도 향후 TV나 전자레인지 같은 기기에는 아예 버튼이 없을 것이고 우리는 그냥 말로 소통할 것입니다. 영상에서 보듯이 LLM은 아직 조금 느리게 작동하지만, 우리는 모든 사람이 알고 있는 무어의 법칙을 알고 있습니다. 분명히, 5~10년 뒤에는 동일한 모델이 현재 1달러 칩에서 쉽게 실행될 것이며, 현재 우리가 5달러의 ESP32 보드에서 완전한 PDP-11 에뮬레이터(80년대 10만달러 대의 컴퓨터였던 PDP)를 실행할 수 있는 것처럼요.\n\n다음 파트에서는 음성 인식을 위해 푸시 투 토크(Push-to-Talk) 버튼을 사용하는 방법 및 \"Rabbit\" 스타일의 데이터 처리 인공지능 파이프라인을 구현하는 방법을 소개할 예정이에요. 기대해주세요.\n\n<div class=\"content-ad\"></div>\n\n이야기를 즐겼다면 Medium에 구독해보세요. 나의 새로운 기사가 발행되면 알림을 받을 수 있을 뿐만 아니라, 다른 작가들의 수천 개의 이야기에도 전체 액세스할 수 있습니다. 또한 LinkedIn을 통해 연락할 수도 있습니다. 이 및 다른 게시물의 전체 소스 코드를 얻고 싶다면 Patreon 페이지를 방문해주세요.\n\n언어 모델과 자연어 처리에 관심이 있는 분들은 다른 기사를 읽어보시기를 환영합니다:\n\n- 모두를 위한 LLMs: LangChain 및 MistralAI 7B 모델을 Google Colab에서 실행하기\n- 모두를 위한 LLMs: LLaMA-13B 모델과 LangChain을 Google Colab에서 실행하기\n- 모두를 위한 LLMs: HuggingFace 텍스트 생성 추론을 Google Colab에서 실행하기\n- 완전 초보자를 위한 자연어 처리\n- 16, 8 및 4비트 부동 소수점 형식 - 어떻게 작동하는 것인가?\n\n읽어 주셔서 감사합니다.","ogImage":{"url":"/assets/img/2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi_0.png"},"coverImage":"/assets/img/2024-06-23-AWeekendAIProjectRunningSpeechRecognitionandaLLaMA-2GPTonaRaspberryPi_0.png","tag":["Tech"],"readingTime":12},{"title":"내 DIY 여정 전자기기부터 가구까지 따라 하기 쉬운 10단계 방법","description":"","date":"2024-06-23 18:00","slug":"2024-06-23-MyDIYJourney","content":"\n\n\n![My DIY Journey](/assets/img/2024-06-23-MyDIYJourney_0.png)\n\nDIY Diaries라는 출판물을 위해 쓰기 시작한 이후, 여러 해 동안 한 DIY를 돌이켜보며 내 여정에 대해 생각하게 되었어요. 제 여정은 약 10살 때 시작됐죠.\n\n첫 번째 프로젝트는 이웃이 선물해준 조각 남은 천을 이용해 패턴 없이 인형 옷을 만드는 거였어요. 손으로 재단하고 바느질을 해서 먼저 인형에게 옷을 입혔다가 이후에는 좀 더 정교한 스타일의 바비 옷을 만들게 되었어요.\n\n그 후에 자수를 배워 Hope Chest를 위해 베개커버, 손님용 수건, 테이블보 등을 만들기 시작했어요. 그때 집안 사람들을 위해 스카프를 짜기도 배웠고, 고등학교에서 배운 패턴과 재단 기술을 이용해 옷을 만들기 시작했어요. 심지어 프롬 드레스도 만들었죠!\n\n\n<div class=\"content-ad\"></div>\n\n나는 대학에 소잉 기계를 가져가서 인도에서 구한 멋진 침대 스프레드로 \"히피\" 옷장을 만들었는데 동시에 기숙사 방 장식물도 만들었어. (작은 사이드 노트로, 그 옷들을 입고 지미 헨드릭스와 자니스 조플린을 보러 간 적이 있었는데, 평생의 즐거운 경험이었어!)\n\n시멘트 블록으로 만들어진 기숙사 방은 많은 장식이 필요했어. 그래서 나는 디코파쥬와 콜라주 만드는 법을 배우게 되었고 벽에 걸어보관하기도 했지.\n\n또한 나는 첫 번째 수채화 그림을 시도하기도 했어. 여기 사진에 나와 있는 작품은 지금은 내 누나 집에 걸려 있어. 작년에 그림을 다시 그려보기도 했어. 안타깝게도 그 후로는 그림을 그리지 않았지만, 곧 다시 시작하고 싶어.\n\n![2024-06-23-MyDIYJourney_1](/assets/img/2024-06-23-MyDIYJourney_1.png)\n\n<div class=\"content-ad\"></div>\n\n대학교 때 스카프와 매칭 되는 모자를 짜던 기억이 나요. 스카프는 지금도 코트 랙에 걸려 있어서 색감도 아직 생생하네요. 정말 멋진 양모였는데, 1968년에 만들었답니다!\n\n잠시 후에는 마크라메를 배워서 벽걸이, 화분 걸이, 분리형 탁자, 선물로 주었던 등 여러 작품을 만들었어요. 최근에는 그 때 사용한 안내 책 자료를 발견해서 다시 시도해보고 싶을 때를 대비해 구입했어요.\n\n첫 아파트로 이사 올 때, 친구들과 함께 전기 케이블과 전선 제품을 감았던 큰 나무 통을 활용해서 가구를 만들었어요. 탁자, 좌석, 도색, 천 커버 등 우리가 생각할 수 있는 모든 방법으로 장식을 해봤어요. 우리 중 아무도 돈이 부족해서 가구를 살 수 없었기 때문에 이 방법이 완벽한 장식 방법이었죠.\n\n다음으로 개인적으로 흥미를 느낀 것은 사진촬영이었어요. SLR 카메라 사용법을 스스로 익혀보았죠. 제 카메라는 Pentax K1000였는데 그 카메라를 정말 좋아했어요. 어디를 가든 사진을 찍어 기록했고, 사진을 확대해 프레임에 포장하여 방에서 쓰는 곳에 걸어둔 게 몇 장 있어요.\n\n<div class=\"content-ad\"></div>\n\n내 부모님께서 정년퇴직 후 롱 비치 아일랜드로 이주하시면서 선물로 받으신 사진들이었어요. 그런데 부모님께서 별세하신 후에 집을 비워야 했을 때, 아들이 그 사진을 가져다가 집으로 가져왔답니다. 지금은 조금 바래지긴 했지만, 아들은 소중히 간직하고 있답니다. 저도 그 사진들을 소중히 생각해요.\n\n![이미지](/assets/img/2024-06-23-MyDIYJourney_2.png)\n\n아들이 태어난 후에 정원 가꾸기에 흥미를 가지게 되어 우리 렌탈주택 옆 빈 필지에 거대한 야채 정원을 조성했어요. (거기에는 내가 아이들을 돌보는 동안 사용했던 우리 아이들을 위한 울타리로 둘러싸인 놀이터도 있었습니다.) 내 야채들은 잘 자라서 여름 내내 그 정원에서 먹었어요.\n\n아무도 몰랐던 한 가지는, 남편이 정원 가운데 마리화나를 심어 큰 식물이 자라났다는 것이었어요. 토마토 식물들에 가려져 잘 감춰져 있었죠. (물론, 건조시켜 미래를 위해 저장해 두었죠.)\n\n<div class=\"content-ad\"></div>\n\n몇 년 후에 톨 페인팅 수업을 듣게 되었고, 그것을 매우 즐겼습니다. 스크롤 톱을 구매해서 스스로 나무 조각물을 잘라 눈사람과 같은 작품을 만들고, 그것들을 공예 전시회에서 판매하기도 했습니다. 이러한 그림 그리기 방법을 좋아하는 이유는 아름다운 작품을 만들기 위해 그림을 그릴 필요가 없다는 점이에요. 모두 브러시 기술로 이루어지기 때문이죠.\n\n마지막으로 언급할 DIY는 보석 만들기인데, 이것도 또 다른 분야에서 스스로 배워나간 것이에요. 세 명이 함께 일하며 웹사이트를 시작하고, 공예 전시회에서 판매도 했습니다. 특히 나는 바다 유리를 수집하고, 그것으로 보석을 만들 때 이 DIY를 정말 좋아했어요. 아직도 만들어본 작품 몇 개와 포테스큐의 델라웨어 강변에서 수집한 바다유리 몇 병을 가지고 있어요.\n\n이것이 저의 DIY 여정을 통해 해 온 대부분의 활동이에요. 요즘은 크게 활동하지 않았지만요. 아마 발행 버튼을 누른 뒤 떠올린 것을 추가해야할지도 모르겠네요. 하지만 저의 삶 속에서 즐겨온 대부분의 작품들에 대해서 말씀드린 거예요.\n\n<div class=\"content-ad\"></div>\n\n(고등학교 때 목공예 수업을 듣게 된다면 좋았을 텐데요. 나무로 작업하는 것을 즐기기 때문에 가구를 만들고 싶었을 거예요.)\n\n더 이상 무언가를 창조하는 데 흥미를 느끼지 못 해 조금 슬퍼요. 그러나 아마도 새롭게 흥미로운 것을 발견하고 다시 시작할지도 모르죠. 배운 모든 것과 만들어낸 모든 것을 즐겼으며, 이것이 내 역사의 일부임을 행복하게 생각해요.\n\n내 이야기들을 모두 읽어주시고(Medium의 수천 명의 다른 작가들 또한), 혹은 Medium 멤버십에 가입하여 직접 Medium 작가가 되어보세요. 월 5달러 또는 연간 50달러만 지불하면 됩니다. (저에게 멤버십 비용의 일부가 지급됩니다.)\n\n당신의 멤버십 비용은 직접적으로 저, Michele Baumgardner,와 다른 여러 작가들에게 지원이 됩니다. 또한 Medium의 모든 이야기에 완전한 엑세스를 제공받을 수 있습니다.","ogImage":{"url":"/assets/img/2024-06-23-MyDIYJourney_0.png"},"coverImage":"/assets/img/2024-06-23-MyDIYJourney_0.png","tag":["Tech"],"readingTime":4},{"title":"2024년 DIY Microsoft Teams Room Console 구축 방법","description":"","date":"2024-06-23 17:58","slug":"2024-06-23-DIYMicrosoftTeamsRoomConsole","content":"\n\n옛날 얘기지만... 약 2년 전, 저는 Crestron Teams Room 장치를 만져봤어요. 그리고 그것이 '그냥' 일부 주변 기기가 붙은 Intel NUC라는 사실에 놀랐죠. 그래서 우리가 실제로 인텔 NUC를 손에 쥐고 난 후(사실 유행병 기간중에 우리의 모든 NUC를 노트북으로 교체했죠), '나는 그 Microsoft Teams Room 콘솔을 처음부터 다시 만들 수 있을까?' 라는 생각이 들었어요.\n\n스포일러 주의: 예, 만들었습니다. 그래서 이 블로그 포스트를 작성하게 되었습니다.\n\n## 필요한 것:\n\n- Teams Room 콘솔을 설치하기 위한 최소 8GB USB 스틱\n- 나중에 필요한 구성 XML을 저장할 다른 크기의 USB 스틱\n- Microsoft의 이 문서 요건\n\n<div class=\"content-ad\"></div>\n\n## 일부 하드웨어:\n\n- 최대 3개의 디스플레이를 제공하고 실시간 비디오를 인코딩 및 디코딩할 수 있는 충분한 컴퓨팅 파워와 메모리를 갖춘 Intel NUC. 저는 8GB RAM을 가진 NUC7i5BNK를 사용 중이며 이 일에 완전히 적합하다고 생각합니다.\n- 터치 디스플레이, Viewsonic TD1655를 사용 중입니다.\n- 충분한 USB-A / USB-C 포트와 두 개의 4k 디스플레이를 연결할 수 있는 기능을 갖춘 USB 도킹 스테이션, Raidsonic ICY BOX IB-DK2245AC를 사용 중입니다.\n- USB 스피커폰, Teams 인증된 Jabra Speak 시리즈를 추천드립니다. 예를 들어 Jabra Speak 750 MS-Teams를 사용할 수 있습니다.\n- USB HD 웹캠, 저는 간단한 Logitech C920 HD Pro를 사용했습니다.\n- 노트북에서 비디오 공유를 가능하게 하는 USB HDMI 그랩버, 저는 아마존에서 Pengu 1080p USB HDMI 그랩버를 구입했습니다.\n\n## 그리고 Microsoft 365 테넌트를 위한 일부 라이선스:\n\n- Windows 10 엔터프라이즈\n- Teams Room Standard\n\n<div class=\"content-ad\"></div>\n\n## 이제 모든 것을 준비했네요: 행운을 빕니다!\n\n무슨 뜻이죠? '어떻게 해서 그걸 해냈니?'라고요. 알았어 알았어... 설명할게요.\n\n- 컴퓨터에 모든 작업을 할 폴더를 만들어주세요. 저는 이 d:\\teams-room\\ 폴더를 만들어서 사용했어요.\n- Windows 10 Enterprise 1909 원본 릴리스 ISO를 다운로드해주세요 (2020년 3월에 모든 업데이트가 포함된 것이 아니라, 2019년 10월에 발매된 것을 다운로드해야 해요). 전체 공개: 이 단계에서 1909의 로컬화된 버전을 시도해보지 않았어요. 항상 영어 버전을 선택했죠. 만약 이걸 시도해보게 된다면, 이 게시물을 업데이트할 거예요. 시도해보시면, 댓글을 남겨 다른 이들에게 알려주세요.\n- ISO 파일을 작업 디렉토리에 폴더를 만들어 압축 풀어주세요. 저는 d:\\teams-room\\win10-Enterprise-1909-iso\\라고 창의적으로 이름 짓고 사용했어요.\n- CreateSrsMedia.ps1 스크립트를 다운로드하여 d:\\teams-room\\ 등의 해당 폴더로 이동시켜주세요.\n- 관리자 권한으로 PowerShell을 열고 d:\\teams-room\\ 폴더로 이동해주세요.\n- 스크립트를 실행해주세요:\na. 첫 번째 질문에 답해주실 때... OEM 사용자면, 어째서 이 블로그를 읽고 계신 거죠? 'Enterprise'라는 대답을 선택해주세요. 그것이 당신의 특성입니다. 그런데 말이지: 이는 설치 프로세스에 필요한 Windows 10 버전에 영향을 줍니다. OEM 사용자들은 계속 진행하기 위해 Windows 10 IoT Enterprise ISO를 사용해야 하지만, 평범한 기업 사용자는 액세스할 수 없어요.\nb. 스크립트가 어떤 드라이버를 설치할지 물으면, 'none'을 선택해주세요.\nc. 스크립트가 완료되기까지 기다려주세요 (약 20분 정도 소요될 거예요).\n- 스크립트가 설치 미디어를 생성하는 동안, Microsoft 365 관리 센터로 가셔서 'Resources - Rooms & Equipment(자원 - 방 및 장비)'에서 '룸'을 만든 뒤, 'Teams Room Standard' 라이선스를 해당 룸에 할당해주세요.\n여기 작은 조언 하나: 룸의 주소를 표준 @[회사명].onmicrosoft.com 주소 이외의 다른 도메인 주소로 변경했다면, Teams 룸 콘솔을 인증할 때 이후에 작업을 해야 할 수 있어요. 대부분의 경우 로그인은 onmicrosoft로 할 거에요. 의문이 생기면, Azure AD에서 사용자 주체 이름을 확인해주세요.\n- 설정 루틴은 몇몇 장치에서 조금 까다로울 수 있어요 (설치 프로세스의 끝에 Teams Room 콘솔을 도킹 스테이션에 놓으라고 권고하는데, 그때 실패할 수도 있어요). 우리는 여기서 설명된 것처럼 Teams Room Console 구성을 위한 구성 XML을 준비하고 있어요.\n제가 작업한 것은 아래와 같아요:\n\n```js\n<SkypeSettings>\n...생략...\n</SkypeSettings>\n```\n\n<div class=\"content-ad\"></div>\n\n- 설치 절차를 시작하기 전에 NUC를 네트워크에서 분리하세요. 왜 그런지는 모르겠는데, 설치는 처음 몇 단계에서 네트워크가 없는 것이 신뢰할만 하다고 합니다. Microsoft도 장치를 분리하라고 권장하네요. 그냥 따르고 연결을 끊어보세요.\n- USB 스틱을 사용하여 기계에 설치하세요. 정말 할 일은 없어요. 그냥 구경하고 마음을 편히 하세요. 아직 7번에서 계정을 만들지 않았다면, 지금 만들어 보세요. 지금 할 일이 없을 테니까요.\n- Windows가 설치되면 USB 스틱을 뽑고, Windows가 준비되는 동안 우리 행성에서 지각 변동을 관찰하세요. 어느 순간 기계가 자동으로 꺼집니다.\n- 네트워크에 연결하고 다시 켜면, 모든 것을 준비하고 이번에는 스스로 다시 시작할 거에요.\n- 갑자기 야생의 Out-Of-Box-Experience가 나타나 지역 및 키보드 설정을 요청합니다. 완료되면 Teams 룸 어플리케이션이 첫 번째로 시작됩니다. 천천히. 아주 천천히. 그런 다음 기계가 다시 재부팅되면서 여러분의 희망을 모두 무너뜁니다.\n- Teams 룸 설정 화면이 나타날 텐데 무시하고 준비된 XML 파일을 예상 위치인 C:\\Users\\Skype\\AppData\\Local\\Packages\\Microsoft.SkypeRoomSystem_8wekyb3d8bbwe\\LocalState에 넣어주세요.\n  a. \"종료\"를 누르면 Windows 로그인 화면이 표시됩니다.\n  b. 관리자 계정을 선택하고 \"sfb\"라는 비밀번호를 입력하세요 (Skype For Business의 약자)\n  c. Explorer에서 해당 경로를 열면 C:\\Users\\Skype\\에 대한 액세스 권한을 부여하라는 메시지가 표시됩니다. 당연히 동의해야겠죠.\n  d. 준비된 파일을 복사해서 기계를 다시 시작하세요.\n- 다시 시작되면 필요한 매개변수를 수정하고 완성했어요: 기본 Teams 룸 콘솔이 준비되었습니다.\n\n그리고: 기본 관리자 비밀번호를 변경하는 것을 잊지 마세요.\n\n\"어떤 말씀? 과정을 보여주는 비디오가 도움이 될까요?\"라고요? 그럼 제가 준비해둔 영상이 도움이 될 거에요. 한 번 확인해보세요:\n\n기본 콘솔이 준비되면 나머지 장비와 함께 설정을 시작할 수 있습니다. 작은 허들 룸과 중간 규모의 회의실의 배선을 설명한 간단한 다이어그램을 함께 제공했습니다.\n\n<div class=\"content-ad\"></div>\n\n\n![DIY Microsoft Teams Room Console 0](/assets/img/2024-06-23-DIYMicrosoftTeamsRoomConsole_0.png)\n\n가격은 다를 수 있고, 소형 컴퓨터와 여분의 TV를 이미 보유하고 있는지에 따라 다르지만, 간단한 허들 룸을 위한 추가 하드웨어 비용은 1000달러 미만이어야 합니다.\n\n![DIY Microsoft Teams Room Console 1](/assets/img/2024-06-23-DIYMicrosoftTeamsRoomConsole_1.png)\n\n더 큰 회의실용으로는 추가로 유선 마이크로폰이 있는 AVer 비디오-사운드바를 선택했습니다. 하지만 Logitech Rally나 Poly Studio와 같은 제품들도 잘 작동합니다. 원하는 대로 Jabra 750을 Jabra Speak 810 MS 솔루션으로 업그레이드할 수도 있습니다. 당신의 방, 당신의 선택입니다!\n\n\n<div class=\"content-ad\"></div>\n\n그리고 큰 USB-C 독 덕분에 이중 디스플레이 솔루션으로 갈아탈 수도 있어요. 이렇게 하면 모든 참가자를 한 화면에 넣고 다른 화면에 프레젠테이션을 볼 수 있어요.\n\n이 DIY 매뉴얼이 도움이 되었기를 바라며, 피드백을 기다리고 있겠어요!","ogImage":{"url":"/assets/img/2024-06-23-DIYMicrosoftTeamsRoomConsole_0.png"},"coverImage":"/assets/img/2024-06-23-DIYMicrosoftTeamsRoomConsole_0.png","tag":["Tech"],"readingTime":5},{"title":"2024 트렌드 우정팔찌 재유행의 이유","description":"","date":"2024-06-23 17:57","slug":"2024-06-23-FriendshipBraceletsAreBackWithaVengeance","content":"\n\n## 친구 브레이슬릿 | 공예 | 월간 도전\n\n![image](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_0.png)\n\n요즘 주목하고 있는 트렌드 중 하나가 친구 브레이슬릿이 되었어요. 정식으로 다시 인기를 끌고 있는 것 같아요. 정확히 언제 시작됐는지는 모르겠지만, 테일러 스위프트가 최근 미국 투어 중에 쇼에서 친구 브레이슬릿 교환을 촉구했던 건 알고 있어요. 그것과 관련이 있을지도 몰라요.\n\n나는 약 12살 때 처음으로 친구 브레이슬릿을 만드는 법을 알게 됐어요. 그때 우리 여자애들은 계속 매듭을 묶고 있었죠. 현재 진행 중인 프로젝트를 바지에 고정시키고 쉬는 시간이나 점심시간, 그리고 하루 어느 순간이나 열심히 브레이슬릿에 작업을 하곤 했어요. 서로 교환해서 착용하고, 항상 팔목에 뭉텅이로 다발을 달고 다녔지요.\n\n<div class=\"content-ad\"></div>\n\n우리는 함께 천 마트에 가 고, 땡큐 베이비시팅 머니를 주머니에 넣었습니다. 우리는 자수 실을 보며 시간이 느는 것처럼 서 있고, 전시된 다양한 색상 중 몇 가지만 고르려 애썼습니다. 생각해보면 어려운 나이에 우정 팔찌를 만드는 것이 색 이론에 대해 배운 것 같았어요. 어떤 색상이 잘 어울리는지, 어떤 것이 어울리지 않는지를 알게 되었죠.\n\nBC주 패울 리버에 있는 화랑을 운영할 때, 2017년 유목 생활을 시작하기 전 마지막 정적인 장소에서 다시 보석을 만들었습니다. 이번에도 매듭으로 만들었지만 다르더라고요. 공식적으로는 마이크로 마크라메라고 불리는데, 더 우아하고 이 팔찌만큼 화려하지는 않았어요. 사실, 나는 우간다 아프리카에 있을 때까지 이런 종류의 팔찌를 만들 생각을 거의 안 했어요.\n\n6개월 동안 작은 마을에 머물르는 동안, 한 공예그룹을 가진 여성들과 친구가 되었습니다. 물론, 그들은 내가 사랑했고 존경했던 아름다운 아프리카 상품을 다양하게 만들었어요. 그들은 우정 팔찌를 들어본 적이 없었어요.\n\n어느 날 시장에서 쇼핑을 하다가 몇 개의 컬러풀한 줄을 발견했습니다. 그것은 자수 실은 아니었지만, 충분히 작아서 팔찌를 매는 데 사용할 수 있을 것이라고 생각했어요. 결과적으로 그것은 보통 어망을 매는 데 사용하는 줄이었어요.\n\n<div class=\"content-ad\"></div>\n\n저는 아이콘화된 팔찌를 만드는 방법을 여성분들께 가르쳐주고 싶었어요. 그들이 선물 가게에서 판매할 수 있는 좋은 상품이 될 것 같아서요. 그리고 아이들이 해볼 수 있는 쉬운 작업을 찾고 있었는데, 상품에 대해 배우기 시작할 수 있게 해주고 싶었죠.\n\n처음에는 어떻게 해야 할지 기억이 나지 않을까 걱정되기도 했지만, 빠르게 다시 기억이 되어 속도를 내기 시작했어요. 떠나기 전에 구입한 재료들은 현지 여성분들에게 남겨두었지만, 그 팔찌를 만드는 흥미는 계속 이어져서 멈출 줄 모르더라고요.\n\n2022년 8월, 우리는 다시 터키로 올라갔는데 저는 곧바로 진짜 자수 실을 구입해서 더 만드는 것으로 돌아갔어요. 기차와 버스에서 시간을 보내는 좋은 방법이었고, 손에 쏙 들어가는 창의적이고 가벼운 일을 즐기며 즐겁게 시간을 보냈어요.\n\n<div class=\"content-ad\"></div>\n\n내가 가지고 다니던 팔찌들이 어느 날 불가리아에서 사람들과 만날 때까지 크게 신경 쓰지 않았어요. 그날 나는 내 비밀 창고를 꺼내어 놀랍게도 사람들의 관심을 받았어요. 사람들이 내 팔찌들을 가질 수 있냐고 물어오자, 나는 기꺼이 \"물론이죠!\"라고 대답했어요. 제가 만든 대부분의 팔찌들은 그 저녁 우연히 만난 낯선 사람들에게 선물했답니다.\n\n지난 달에도 여전히 연락 중인 한 남자가 날 위해 이 사진을 보내주고 여전히 그의 팔찌가 얼마나 멋지다고 말했어요. 그는 우리가 만난 불가리아 사람들 중 한 명이었고, 우리는 서로 좋은 대화를 나눴죠. 그가 그의 팔찌를 보면서 우리를 기억해주고 있다는 사실이 나를 따뜻하게 만들었어요. 정말 그가 그것을 얼마나 좋아하는지 전혀 몰랐던 것 같아요.\n\n이것이 내 최근의 열정을 일으킨 것이며, 지난 몇 주 동안 나는 팔찌를 만드는 기계가 됐어요.\n\n<div class=\"content-ad\"></div>\n\n간단한 패턴을 만들기 시작했어요. 언제나 만들었던 것과 똑같은 패턴이죠 (사진에 있는 것처럼요) 하지만 금방 다른 것도 해보아야겠다는 생각이 들더라구요. 다이아몬드 패턴이나 다른 디자인으로 만드는 법을 알았지만, 물론 그런 방법을 모르더라구요.\n\n그런데 유튜브가 생겨나고 나니, 거기에서 어떻게 만드는지에 대한 동영상을 찾을 수 있을 것 같아요. '친구새'라고 검색창에 입력하니 얼마나 멋진 것들을 발견할 수 있을지 몰랐어요.\n\n아래 공유한 채널은 팔찌 만드는 동영상이 280개나 있어요. 대부분이 독특한 패턴을 가지고 있는데요. 쉽게 배울 수 있는 천천히 설명도 해주거든요.\n\n당시에 크리스의 엄마 집에 머물렀었는데, 엄마는 수놓기를 많이 해서 자수 실이 있다고 했어요. 그러나 처음에는 찾아야 한다고 했어요. 까먹어버렸는데 며칠 후에 엄마의 계정 상에 자수 실 묶음이 나타났어요. 제가 곧바로 바쁘게 시작했죠.\n\n<div class=\"content-ad\"></div>\n\n물론, 나는 빨간색 선택에 신속히 지루해지고, 갑자기 팔찌를 만들 필요가 있어 다양한 색상을 얻어야 한다는 것을 알았어요. 며칠 후, 우리는 월마트에 처음 갔을 때 거대한 색상 선택을 발견하여 너무 행복했어요. 약 12가지 새로운 색상을 구입해서 다시 뛰어드는 것을 시작했어요.\n\n새로운 색상을 손에 넣으면서, 새로운 패턴을 배우기 위해 몇 가지 교육 동영상을 보고 있어야 한다는 것을 깨달았어요. 어느 날 밤 한 가지를 시도했을 때 복잡한 패턴을 만드는 것이 얼마나 쉬운지 놀랐어요. 그때부터 계속해서 발전해 왔죠.\n\n어느 날, 크리스의 엄마와 함께 할 일이 있어 돌라라마에 갔어요. 미국에 이 체인이 있는지 확실하지 않지만, 중국에서 수입한 쓰레기로 가득찬 저렴한 가게라고 할 수 있어요. 예전에는 가벼운 미술용품을 살 때 가끔씩 가곤 했죠. 통로를 거닐다가 끈적거리는 가장 사랑스러운 비닐싸개를 발견했어요.\n\n<div class=\"content-ad\"></div>\n\n\n![Friendship Bracelets Are Back With a Vengeance](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_4.png)\n\n나는 그들이 작은 면구슬이라는 것을 빨리 깨달았고, 팔찌 만드는 데 좋을 것 같다는 느낌도 들었다. 각 패키지는 $4에 9가지 색상을 담고 있다. 진짜 싸다니까요! 내가 원하는 색상을 골라내기 위해 고민 끝에 3개의 패키지를 골라 샀다.\n\n이렇게 많은 재료를 갖게 되었다는 것은 단 하나의 의미를 갖는다! 바로 바쁘게 움직여야 한다는 것!\n\n이 소재를 사용하니 팔찌 만들기가 훨씬 쉬워졌다. 자수 실은 좋지만 약간 미끄러운 편이라 매듭이 때때로 풀릴 때가 있었다. 그러나 이 면은 약간 마찰력이 있어 매듭 묶기가 훨씬 쉬워졌다.\n\n\n<div class=\"content-ad\"></div>\n\n절로 손목에 더 복잡한 패턴의 팔찌를 저장하기 시작했어요. 우리가 여행할 때 가져가면 선물로 쓸 수 있어 좋다고 생각했거든요.\n\n그 다음으로, 이번 달 '창조력 공유'를 위한 흑백 챌린지에 대해 생각해보면서, 나는 흑백 팔찌들의 그룹을 만들기로 결심했어요.\n\n하지만 물론, 나는 빠르게 흑백에 지루해지고 다시 색감에게로 돌아가야 했지요! 같은 색상 방식으로 팔찌 묶음을 만드는 것을 좋아했고, 다양한 패턴으로 시작했어요.\n\n![Friendship Bracelets](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_5.png)\n\n<div class=\"content-ad\"></div>\n\n아래의 Markdown 형식으로 변경해 주세요.\n\n\n![Friendship Bracelets 6](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_6.png)\n\nAnd then this.\n\n![Friendship Bracelets 7](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_7.png)\n\nI guess next I should work on a fall color scheme seeing as fall has arrived!\n\n\n<div class=\"content-ad\"></div>\n\n저는 정말 이 최신 집착이 언제 끝날지, 혹은 아예 끝나지 않을지 전혀 알 수가 없어요. 작고 가벼운 점이 여행 취미로 딱인 것 같아요. 또한, 팔찌들은 좋은 선물이 되니까요.\n\n온라인에서 판매를 시작해서 진지하게 다뤄볼까도 생각중이에요. 누가 알겠어요!\n\n제가 알고 있는 것은 그저 이것을 만드는 걸 즐기고 있다는 거예요. 결국 그것이 가장 중요한 거니까요!\n\n![image](/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_8.png)\n\n<div class=\"content-ad\"></div>\n\n만약 \"Share Your Creativity\"에 처음이시라면, 저희와 함께 참여하고 현재 작업 중인 것을 보여주세요.\n\n작가가 되기 위해서는 여기를 읽어보세요:\n  \n또한, 회원 여러분들께는 \"아티스트 이야기\"를 작성할 것을 장려합니다. 제 이야기는 다음과 같습니다:\n\n창작의 즐거움이 함께 하길 바래요!\n\n<div class=\"content-ad\"></div>\n\n안녕하세요 Jill님\n\n만약 제 글을 좋아하고 더 많이 읽고 싶다면, 저를 팔로우하고 여기에서 이메일로 제 글을 받을 수 있도록 가입해주세요. 또한 Patreon 또는 Ko-Fi 링크를 사용하여 팁을 남겨주시면 저희가 매우 기쁠 것입니다:)\n\n2017년부터 유랑하고 있어요! 아래 링크들을 클릭하여 우리의 여정에 함께해주세요:\n\n웹사이트 | 인스타그램 | 페이스북 | 링크드인 | Patreon | 유튜브 | 미디엄 | 트위터 | Ko-Fi | Unsplash","ogImage":{"url":"/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_0.png"},"coverImage":"/assets/img/2024-06-23-FriendshipBraceletsAreBackWithaVengeance_0.png","tag":["Tech"],"readingTime":5},{"title":"마음을 전할 수 있는 20개 이상의 저렴한 DIY 선물 아이디어","description":"","date":"2024-06-23 17:55","slug":"2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank","content":"\n\n\n![Image](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_0.png)\n\nGiving thoughtful gifts doesn’t have to mean emptying your wallet. With a little creativity and effort, you can craft personalized presents that are sure to be cherished.\n\nHere are over 20 DIY gift ideas for your boyfriend, girlfriend, father, mother, or teacher:\n\nFor Your Boyfriend or Girlfriend:\n\n\n<div class=\"content-ad\"></div>\n\n- **개인화된 사진 앨범:** 즐겨 찍은 사진을 모아 맞춤형 사진 앨범을 만들어보세요. 손글씨 캡션이나 농담을 적어 완성도를 높일 수도 있어요.\n\n![Personalized Photo Album](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_1.png)\n\n- **수제 캔들:** 향기는 추억을 불러일으키죠. 그래서 그들이 좋아하는 향기를 선택하여 대두 왁스와 에센셜 오일로 캔들을 직접 만들어보세요.\n\n![Handmade Candles](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_2.png)\n\n<div class=\"content-ad\"></div>\n\n- 커스텀 플레이리스트: 당신의 관계에 특별한 의미를 갖거나 공유 경험을 상기시키는 노래로 플레이리스트를 만들어보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_3.png)\n\n- 손 그림 머그: 평범한 머그컵에 재미있는 디자인이나 명언을 그려서, 아침 커피를 좀 더 특별하게 만들어보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_4.png)\n\n<div class=\"content-ad\"></div>\n\n- 홈메이드 발터프: 에센셜 오일과 천연 재료를 사용하여 홈메이드 발터프를 만들어 편안한 목욕 경험을 선사해보세요.\n\n![Image](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_5.png)\n\n부모님을 위해:\n\n- 가족 사진 콜라주: 가족 사진, 옛 표 스텁 또는 다른 의미 있는 항목을 사용하여 함께 보낸 시간을 보여주는 콜라주를 만들어보세요.\n\n<div class=\"content-ad\"></div>\n\n\n![Scrapbook of Memories](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_6.png)\n\n- 추억의 스크랩북: 어린 시절의 소중한 추억이나 재미있는 이야기를 모아서 회상적인 스크랩북을 만들어보세요.\n\n![Personalized Photo Frame](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_7.png)\n\n- 개인 맞춤형 사진액자: 특별한 사진을 함께 액자에 넣고, 액자를 페인트, 데쿠파지, 또는 다른 장식품으로 꾸며보세요.\n\n\n<div class=\"content-ad\"></div>\n\n\n![Image 1](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_8.png)\n\n- 홈메이드 쿠키 또는 빵: 그들이 좋아하는 간식을 구워서 감사함을 표현하고 그들의 집 안에 편안한 향기를 만들어 줍니다.\n\n![Image 2](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_9.png)\n\n- 작은 허브 정원 심기: 만약 부모님이 가드닝을 즐기시면, 내내 키워나갈 수 있는 작은 허브 정원을 선물해 보세요.\n\n\n<div class=\"content-ad\"></div>\n\n\n![Image 1](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_10.png)\n\nFor Your Teacher:\n\n- Handmade Bookmarks: Create personalized bookmarks using fabric scraps, ribbon, or beads. You can even write a heartfelt thank you message on the back.\n\n![Image 2](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_11.png)\n\n\n<div class=\"content-ad\"></div>\n\n- 꾸미기 펜 홀더: 페인트, 천, 또는 데쿠파지로 평범한 펜 홀더를 장식하여 독특하고 실용적인 선물로 만들어보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_12.png)\n\n- 집에서 만든 커피 스크럽: 직접 만든 커피 스크럽으로 선생님을 상쾌하고 활기차게 도와보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_13.png)\n\n<div class=\"content-ad\"></div>\n\n- 개인화된 교사용 플래너: 스티커, 와시 테이프 및 격려 인용구로 맞춤 플래너를 만들어보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_14.png)\n\n- 수제 감사 카드: 예술적 재능을 발휘하여 진심 어린 감사 메시지로 개인화된 카드를 만들어보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_15.png)\n\n<div class=\"content-ad\"></div>\n\n모두를 위해:\n\n- 격려의 병: 밝은 날을 더욱 빛나게 해줄 격려의 인용구나 작은 메모를 담은 병을 채워 보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_16.png)\n\n- 손으로 쓴 편지: 진심을 다해 감사와 사랑을 표현하는 따뜻한 편지를 쓰는 시간을 가져보세요.\n\n<div class=\"content-ad\"></div>\n\n\n![DIY Spa Kit](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_17.png)\n\n- DIY Spa Kit: Gather aromatherapy oils, bath salts, and other pampering products in a basket for a relaxing spa experience.\n\n![Embroidered Throw Pillow](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_18.png)\n\n- Embroidered Throw Pillow: Design and sew a custom throw pillow with their initials or a meaningful quote.\n\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_19.png)\n\n- 그림 그린 토트 백: 손으로 그려진 독특한 디자인이 있는 재사용 가능한 토트 백을 선물해보세요.\n\n![이미지](/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_20.png)\n\n성공을 위한 팁:\n\n\n<div class=\"content-ad\"></div>\n\n- 그들의 관심사와 성격을 반영하는 선물을 선택하세요.\n- 독특한 감성을 넣어도 괜찮아요.\n- 포장은 중요해요 — 예쁘고 신중하게 포장해주세요.\n- 가장 중요한 것은 마음으로 만드는 거예요.\n\n가장 값진 선물은 개인적이고 진심을 보여주는 선물이에요.\n\n그래서 창의력을 발휘해서 특별하고 따뜻한 DIY 선물을 만들어보세요!","ogImage":{"url":"/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_0.png"},"coverImage":"/assets/img/2024-06-23-20DIYGiftIdeastoShowYouCareWithoutBreakingtheBank_0.png","tag":["Tech"],"readingTime":5},{"title":"집에서 양자 컴퓨터 만드는 방법","description":"","date":"2024-06-23 17:52","slug":"2024-06-23-HowDoIBuildaQuantumComputerinMyHouse","content":"\n\n<img src=\"/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_0.png\" />\n\nRyan F. Mandelbaum라는 Qiskit의 고급 기술 작가의 글입니다.\n\nQiskit과 같은 개방 접근 프레임워크를 사용하면 클라우드를 통해 양자 컴퓨터를 프로그래밍할 수 있습니다. 여러분은 양자 컴퓨터에 익숙한 진취적인 사람입니다. 따라서 할 일이 필요하다면, 직접 만든 양자 컴퓨터를 프로그래밍해보는 것은 어떨까요?\n\n시작하기 전에 언급해야 할 점은 기술적으로, 집에서 양자 알고리즘을 실행하는 완전히 기능하는 양자 컴퓨터를 만들 수는 없다는 것입니다(수백만 달러, 제조 및 연구 시설 접근 권한, 그리고 많은 투자된 시간이 필요합니다. 이런 경우, 여러분이 도와주시는 것이 필요할 것입니다. 그렇지 않다면 반대로 도움을 받아야 할 상황이겠죠). 그러나 큰 예산, 여유 시간 및 DIY 광학 및 전자 기술에 대한 강의를 듣는다면, 간단한 양자 시스템을 만들고 몇 가지 양자 게이트를 실행할 수 있습니다. 심지어 Qiskit을 사용하여 장치를 제어할 수도 있습니다. 그러니 시작해봅시다.\n\n<div class=\"content-ad\"></div>\n\n# 양자 컴퓨터란 무엇인가요?\n\n![양자컴퓨터](/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_1.png)\n\n물론, 양자 컴퓨터를 만들기 전에 양자 컴퓨터가 무엇인지 알면 도움이 됩니다. 양자 컴퓨터는 양자 시스템의 고유한 특성으로 데이터를 표현하고 조작하는 시스템입니다. 기본적으로, 고전 컴퓨터는 전자가 0 또는 1 상태로 표현되는 비트로 계산하는 반면, 양자 컴퓨터는 양자 비트 또는 큐비트로 계산하며 0과 1 상태가 양자 시스템의 두 가지 상태로 표현됩니다. 예를들어 전자는 두 가지의 원자 에너지 레벨 중 하나를 채우게 됩니다.\n\n양자 컴퓨터의 능력은 계산 도중, 큐비트가 전자나 광자와 같은 아주 작은 입자들이 행동하는 수학적 원리를 이용하여 상호 작용하기 때문입니다. 이 제약된 형태의 선형 대수학과 확률은 큐비트가 \"중첩\"되어 동시에 여러 상태를 가지는 효과, \"얽힘\"으로 두 큐비트의 양자 상태가 빔뭉치 동전 한 짝보다 강하게 상관되어 있는 효과, 그리고 \"간섭\"으로 특정 큐비트 상태 조합이 측정 시 더 가능성이 높거나 반드시 금지될 수 있는 효과를 설명합니다. 양자 계산의 결과는 항상 0과 1일 것입니다.\n\n<div class=\"content-ad\"></div>\n\n양자 시스템을 조종하는 것은 말하기가 하는 것보다 훨씬 쉽지 않아요. 물리학자 David DiVincenzo는 유명하게 \"양자 컴퓨터\"라는 이름을 정말로 얻기 위해 장치가 충족해야 하는 다섯 가지 기준을 제안했어요. 진정으로 양자 컴퓨터라는 별칭을 받기 위해 그들이 제어할 수 있는 큐비트를 구성할 수 있어야 하며, 확장할 수 있고, 실제로 계산을 수행할 정도로 그들의 양자성을 오랜 시간 유지할 수 있어야 하며, 유니버설한 연산(게이트) 집합을 수행할 수 있어야 하며, 각각을 측정할 수 있어야 해요. 수십 년의 연구와 많은 자금 투입 끝에, 연구자들은 이러한 기준을 충족할 수 있는 장치를 드디어 최근에 생산하기 시작했어요.\n\n양자 컴퓨터가 연구자들에게 제기한 과제를 고려하면, DiVincenzo의 기준을 준수하는 가정 자작 양자 장치를 손쉽게 만들긴 어렵다고 말할 수 있겠어요. 그래서 우리의 목표를 조금 낮춰 보겠습니다. 우리는 단지 우리 자신이 구매할 수 있는 부품이나 자원을 사용해서 제어하고 조작하며 측정할 수 있는 양자 시스템을 고안해보려고 해요.\n\n**광자와 광학 구성요소로부터 큐비트 구축하기**\n\n<div class=\"content-ad\"></div>\n\n오늘, 학술 기관, 국립 연구소, 그리고 기업의 물리학자들은 빛 입자인 광자의 특성에 데이터를 저장하는 광자 양자 컴퓨팅이라는 양자 컴퓨팅 구조를 연구하고 있습니다. 광학 구성품이 비교적 쉽게 구할 수 있는 것을 감안하면, 광자 양자 컴퓨터는 직접 만들어 볼만한 좋은 양자 시스템입니다.\n\n해당 양자 컴퓨터를 구축하기 위해서는 일관된, 제어 가능한 광자를 생성하는 광원이 필요합니다. 레이저로 작은 펄스를 내거나, 돈이 있다면 단일 광자 발생기를 사용할 수 있습니다. 광자의 진동 상태에 따라 양자 정보를 저장하거나, 광자가 두 개의 광섬유 중 어떤 것을 통과했는지 묻는 방식으로도 가능합니다. 또한, 광자를 섭종체로 넣고 게이트를 적용할 수 있는 광학 구성품이 필요합니다. 이때 광자를 두 개의 경로 중 하나로 나누는 빔 분할기나, 광자가 각각의 경로에서 상태를 취할 때 광자의 위상을 바꿀 수 있는 장치 등이 필요합니다. 마지막으로, 광자의 최종 상태를 판단하기 위한 카메라나 검출기가 필요합니다. 이러한 광자 기반 양자 컴퓨터는 이미 KLM 프로토콜이라는 이름을 가지고 있습니다. 이 프로토콜은 2001년 물리학자 에무얼 니슬, 레이몬드 라플람, 제러드 제임스 밀번의 이름에서 따왔습니다. 현재 다양한 광자 양자 컴퓨팅 구조 중 하나로 개발 중에 있습니다.\n\n이 장치를 실제로 구축하는 방법은 양자 비트에 대한 제어 정도에 따라 다릅니다. 광학 테이블, 전문적인 광학 구성 요소(예: 미리 만들어진 맥-젠더 간섭계, 단일 광자 발생기, 민감한 검출기)를 구입할 수도 있고, 상대적으로 DIY(Do It Yourself) 방식으로 진행할 수도 있습니다. 양자 컴퓨팅 스타트업 Spooky Manufacturing의 창립자인 노아 우드는 저렴한 KLM 유형의 양자 컴퓨터를 만드는 방법에 대해 설명하며 펄스 레이저 다이오드, 광자의 진동에 따라 광자를 분리하는 빔 분할기, 포토레지스터 등을 사용했다고 합니다.\n\n단지 광자를 섭종체로 넣는 것은 어렵지 않습니다. 진정한 어려움은 광자가 상호 작용하지 않기 때문에 얽힘을 생성하는 것입니다. 레일버레인(Riverlane) 회사의 연구 소프트웨어 개발자 알렉스 모일렛은 광자를 광섬유의 연속체를 통해 이동시킨 후 상태 변화를 적용하여 얽힘을 생성합니다. 그 이후에는 관측자가 사후 선택 기구를 적용해야 합니다. 기본적으로, 어떤 얽힘이 발생했는지를 증명하지 않는 계산 결과는 폐기됩니다. 다른 적응형 체계는 계산 초기에 일부 광자를 측정하고, 얽힘이 성공할 때까지 게이트를 반복적으로 적용합니다.\n\n<div class=\"content-ad\"></div>\n\n하지만 광학 구성 요소보다 조금 덜 익숙한 것을 원했다면, 어쩌면 다른 입자의 양자 특성, 즉 전자의 스핀을 제어하고 조작해 볼 수 있을 겁니다.\n\n# 오래된 방식으로 큐빗 구성하기: 핵 자기 공명 사용하기\n\n![Nuclear Magnetic Resonance](/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_3.png)\n\n양자 컴퓨팅 아키텍처에서 초기 주자로 손꼽혀온 것은 핵 자기 공명(NMR)이었습니다 — 바로 MRI 장치 뒤에 있는 개념입니다. NMR 장치는 오늘날의 초전도 및 포획 이온 양자 컴퓨터만큼은 강력하지 않지만, 과학자들은 여전히 NMR 양자 컴퓨팅에서 가져온 기술을 현대 장치에서 사용하고 있습니다.\n\n<div class=\"content-ad\"></div>\n\nNMR 양자 컴퓨터는 주로 액체로 이루어진 매체를 사용하며, 강력하고 꾸준한 자기장 안에서 특별히 튜닝된 무선 주파수 펄스를 이용하여 교란합니다. 이 컴퓨터는 원자 핵의 고유한 양자 속성인 스핀 상태에 정보를 부호화하는데, 이는 물질의 자기성의 기본 단위로 생각할 수 있습니다. 물자의 자기성 정보의 기본 단위로 볼 수 있습니다. 물과 탄소-13 속의 수소 원자와 같이 일부 원자 동위원소는 일반적으로 위와 아래로 불리는 두 가지 스핀 상태를 가진 개별 큐빗 역할을 할 수 있습니다. 무선 주파수 펄스는 이러한 큐빗의 상태를 변경하거나 핵 간에 엉킨 상태를 일으킬 수 있습니다.\n\n그러나 다른 양자 컴퓨팅 아키텍처와 달리 NMR은 개별 큐빗을 제어하는 대신 동시에 많은 분자 집단에 작용해야 합니다. 이는 개별 큐빗 측정을 얻는 대신 계산이 매체 안의 모든 분자의 행동 평균을 반환하므로, 각각이 작게 양자 프로세서 역할을 하는 NMR 양자 컴퓨터는 noisy하며 확장하기 어렵습니다. IBM 양자 연구원인 Sarah Sheldon은 \"그래 그리고 자연이 제공하는 분자의 특성을 고정시켜야 해\"라고 말합니다. 또한 초전도 양자 컴퓨터와는 달리 모든 큐빗을 기본 상태로 시작하지 않고 NMR 컴퓨터는 기본 상태의 큐빗을 흉내 내기 위해 추가 후처리가 필요합니다.\n\n하지만 우리는 좋은 양자 컴퓨터를 만드려고 하는 것이 아니라 집 안에서 양자 상태를 제어하고 측정하려는 것입니다.\n\n명백히 NMR 양자 컴퓨터를 구축하는 데에는 가능한 가장 강력한 전자자석이 필요하며, 분자로부터 얻는 신호를 극대화하기 위해서입니다. 그 자석 속에서는 비교적 간단한 설정을 만들 수 있습니다 - 다른 솔레노이드로 전기선이 연결되어 LC 회로에 연결되어 그 장치를 알맞은 주파수로 조정하고 펄스에 대한 분자의 반응을 읽어낼 수 있습니다. RF 신호 발생기와 펄스를 사용자 정의하기 위한 FPGA도 필요합니다.\n\n<div class=\"content-ad\"></div>\n\n매체를 자유롭게 실험해보세요. 에탄올, 아세톤, 글리세린, 탄소-13이 풍부한 염화클로로폼 또는 물 속을 떠다니는 수소 원자 등 다양한 가능성이 있어요 (해당 경우에는 큐빗이 하나밖에 없을 거에요). 디바이스를 만드는 데 투자하는 금액은 사용할 자석 및 전자 기기에 달렸지만, 기본 사항을 함께 구성하는 데 도움이 되는 다양한 튜토리얼이 있어요. 궁금한 경우 펄스 NMR 장치를 사서 분해하는 방법도 있어요.\n\n# 이온 함정을 활용하여 큐빗 구성하기\n\n![이미지](/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_4.png)\n\n그렇다면 어떻게 하면 뉴스 매체에서 가장 주목받는 고급 양자 컴퓨터를, 기업이 서로 경쟁하면서 만드는 컴퓨터를 만들 수 있을까요? 가능할까요?\n\n<div class=\"content-ad\"></div>\n\n지금 가장 진보된 양자 아키텍처는 아마도 초전도 및 갇힌 이온 양자 컴퓨터일 것입니다. 초전도 퀀비트는 많은 특수 제작 구성 요소와 희석 냉장고가 필요하기 때문에 취미로서는 너무 벗어난 분야일지 모릅니다. 그러나 적어도 한 명의 창의적인 해커인 앙 알렝(Yann Allain)은 \"99% 할인\"가격으로 갇힌 이온 양자 컴퓨터를 만들려고 노력하고 있습니다.\n\n이온은 상당히 직관적인 양자 시스템입니다. 전자 상태, 즉 기반 상태나 격려 상태의 원자 등이 퀀비트 상태로 작용할 수 있습니다. AC 및 DC 전극 시스템은 이온을 유지할 수 있는 폴 트랩이라 불리는 라디오 주파수 필드를 만들어냅니다. 레이저는 이온을 냉각하고, 소스 입자를 이온화하며, 이온의 상태를 읽어내는 역할을 담당하며, 마이크로파 소스(또는 레이저)는 초기화 및 게이트를 보내 이온을 제어하기 위해 펄스를 보냅니다. 여기에 노이즈를 줄이기 위해 전체 시스템은 진공 챔버 안에 들어가야 합니다. 그것에는 진공 펌프도 필요합니다.\n\n가장 큰 도전은 아마도 충분히 강한 진공을 달성하는 것, 마이크로파 또는 레이저 제어 시스템을 만드는 것, 그리고 이온을 갇는 폴 트랩을 만드는 것이 될 것입니다. 아마 먼지 입자를 갇고서부터 시작하여 나아가보는 것도 좋은 방법일 수 있습니다. 알렌은 Kickad 디자인을 사용하여 자신의 폴 트랩을 만들고, 2D 트랩을 세라믹 칩에 새겨주는 컴퓨터 수치 제어(CNC) 가공기를 사용했습니다. 그는 발표에서 레이저 제어 시스템을 구축하는 데 고생했다고 말했는데(그는 2,000 유로 정도의 비용으로 레이저 시스템을 처음부터 구축하려고 하고, 25,000 유로에 사전 제작된 시스템을 구입하지 않을 예정입니다). 상용부품만을 사용하여 자체 이온 트랩 양자 컴퓨터를 떠올리는 과정에서 캘리포니아 대학 포스트닥 사라 무라디안은 수백만 달러 미만의 예산으로 몇 개의 게이트를 수행할 수 있는 단순한 장치를 만들 수 있음을 추정했습니다.\n\n더 놀라운 것을 만들려면 대학원에 다시 진학하여 물리학 학위를 얻는 것은 좋은 변명이 될 수 있습니다. 아마 IBM의 양자 컴퓨터에 참여할 수도 있겠네요!\n\n<div class=\"content-ad\"></div>\n\n# 이 장치를 어떻게 제어할까요?\n\n![이미지](/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_5.png)\n\n귀하의 새로 개조한 장치는 작업대에 놓여 있을 때, 아마도 제어 전자 기기의 패널에서 버튼을 누르고 조절 다이얼을 돌려 프로그래밍하는 경우, 컴퓨터 같지 않을 것입니다. 하지만 그것이 회사들이 귀하의 양자 장치를 제어할 수 있는 소프트웨어를 개발하고 있는 이유입니다. IBM의 양자 컴퓨팅 하드웨어가 초전도 큐비트로 이루어져 있더라도, Qiskit은 하드웨어에 독립적으로 설계되었습니다.\n\nIBM 양자 소프트웨어 전담 담당자인 Paul Nation은 \"어떤 큐비트를 얘기하는지와 상관없이, 게이트 기반 계산을 수행하고 Qiskit이 게이트를 이해한다면 작동해야 합니다.\"라고 말했습니다. 그러나 귀하에게는 많은 작업이 요구될 것입니다. IBM의 장치를 위해, Qiskit 코드를 초전도 큐비트에 펄스를 생성하는 웨이브폼으로 변환하는 여러 백엔드 단계가 있습니다. 귀하의 기기에서는 X-게이트(두 큐비트 상태 사이를 뒤집는 게이트)나 Hadamard 게이트(두 상태의 큐비트를 동등한 최면 상태로 넣는 게이트)와 같은 간단한 양자 게이트를 적용하는 것이 정확히 무엇을 의미하는지 결정하고, Qiskit 및 귀하의 장치가 서로 대화할 수 있도록 인터페이스를 생성해야 합니다. Qiskit Pulse 기능을 사용하여 큐비트의 공명 시간을 보정하고 계산하고, 펄스 모양, 주파수 및 지속 시간을 제어할 수 있는 사용자 정의 펄스를 보낼 수 있습니다. 양자 장치와 Qiskit 간의 인터페이스 및 OpenPulse 언어에 대해 자세히 알아보세요.\n\n<div class=\"content-ad\"></div>\n\n—\n\n양자 컴퓨터를 구축하는 데는 많은 시간, 노력 및 인력이 필요합니다. 이것이 회사와 연구 기관이 전용 팀을 구성하여 이러한 장치를 구축하고 이해하려고 노력하는 이유입니다. 하지만 이러한 과제가 DIY 조작의 범주를 벗어난 것은 아닙니다. 상용 부품을 사용하여 양자 시스템을 구축할 수 있으며, Qiskit과 같은 오픈 소스 소프트웨어를 사용하여 장치를 제어하고 프로그래밍할 수도 있습니다. 그렇다면, 왜 시도해보지 않을까요?\n\n여러분은 직접 양자 장치를 만들고 Qiskit을 사용하여 프로그래밍하는 데 성공했나요? 저희에게 알려주세요! ryanfmandelbaum@ibm.com으로 이메일을 보내주시면 Qiskit 블로그에서 여러분의 창작물을 자랑스러워 할 수 있을 것입니다!","ogImage":{"url":"/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_0.png"},"coverImage":"/assets/img/2024-06-23-HowDoIBuildaQuantumComputerinMyHouse_0.png","tag":["Tech"],"readingTime":8},{"title":"유튜브 영상 하나로 자전거 타이어 갈아끼우기 초간단 공략","description":"","date":"2024-06-23 17:51","slug":"2024-06-23-HowIChangeaBicycleTireAfterWatchingOneYouTubeVideo","content":"\n\n## 풍자\n\n![이미지](/assets/img/2024-06-23-HowIChangeaBicycleTireAfterWatchingOneYouTubeVideo_0.png)\n\n긴팔 플란넬 셔츠, 청바지, 그리고 편안한 부츠를 신고 깔끔한 내 작업실로 들어갔어요. 이 작업실은 자전거 수리를 위한 이상적인 환경과 레이아웃을 갖추고 있어요.\n\n영상의 지시대로, 진지한 분위기의 작업대 주변에 흩뿌려진 도구들 중에서 무작위로 도구를 선택해요. 바로 작업에 필요한 도구를 찾았어요. 제가 토끼 풀에서 뿔난 토끼들의 거미집에 덮인 차고 바닥에 있는 도구 가방 속에서 반 시간을 낭비했다 하는 소리를 들을 일은 절대 없어요. 도구를 찾자마자, 예상치 못하게 가지고 있는 자전거 스탠드에 걸린 엎드린 자전거를 칭찬해요. 이런 자세로 자전거를 올리는 건 쉽고 직관적이에요. 바퀴를 손으로 돌려보면서 테스트도 하는데요. 딴 생각에 빠져 바퀴가 잘 도는 것을 살펴보다가, 파트너가 따뜻한 컵에 검은 커피를 가져다 주죠. 제가 커피를 즐기려면 크리머가 필요하지 않아요. 왜냐하면 나는 존재의 더 높은 차원으로 상승했어요.\n\n<div class=\"content-ad\"></div>\n\n제가 개발자 입니다. 위의 텍스트를 친근한 톤으로 한국어로 번역해 드리겠습니다.\n\n여기서 타이어 교체 프로세스는 자연스럽게 흘러가는데, 마치 그림 같은 폭포를 따라 물이 흘러내리는 것처럼요. 손에 꼭 맞는 렌치로 휠을 고정하는 너트를 쉽게 풀어내고, 손가락을 누르거나 손톱을 부딪치거나 치와와를 깜짝 놀라게 해 크게 맹세하지 않아도 되니까요. 휠을 떼어내면 자전거가 넘어지지 않아요. 산타 할아버지가 벽난로를 내려올 때보다 시끄러운 임팩트도 없어 공통 달리는 것도 없고 벽과 가구에 부딪히는 것도 없죠. 이 모든 과정이 얼마나 편안한지에 미소가 번지네요. 자전거 가게를 열어보려고 생각해봐도 좋을 것 같아요. 돈을 버는 것이 아니라 단지 지역사회에 봉사하기 위해서요.\n\n이제 소형 상자에 뭉쳐서 배달된 새 타이어를 휠의 테이블에 맞게 만들어 넣는 과정은 어렵게 느껴질 수 있지만, 실제로는 너무 쉬워서 거의 이 단계를 건너뛰는 것 같아요. 새로운 내부튜브에 약간 공기를 불어넣기만 하면 되는데, 자전거 타이어가 일반적으로 별도로 판매되는 두 가지 구성 요소로 이루어져 있다는 직감으로 당연히 구입했기 때문에 쉽게 타이어 안으로 들어가서 마치 버터를 바른 장어처럼 숨쉴 정도로 아주 자연스럽게 들어가요. 새 타이어는 즉시 원근법적인 원의 이상적인 형태로 변하며 4세 아이가 만든 하트 모양의 발렌타인 카드와는 아무런 관련이 없어요. 타이어를 휠에 올리는 것은 아주 간단해서 별도로 설명할 필요 없을 정도에요. 휠에 고무를 조심스럽게 설치하면서 쥐가 도망치려는 것처럼 조심스럽게 도와주는 것도, 거의 완료된 상태인데 마지막 순간에 떨어지면서 실망스럽게 바닥에 떨어지는 일도 없어요. 저는 2~3시간을 반복하는 일도 없고 비디오에서 즐겁게 보이는 사람을 죽이라고 협박하는 일도 하지 않아요.\n\n새로운 타이어를 완벽하게 휠에 맞춰놓은 후에 나는 플란넬 셔츠에서 벗어나서, 사랑하는 배우자가 계속 공급해주는 무한 커피로 인해 더워서가 아니라 말씀드린대로, 새로 다릴정도로 다릴까지 압권한 흰색 버튼다운 셔츠를 입기로 결심해요. 소매를 올려 턱 전부를 드러내고, 인상 좋은 이두근을 들어내며 기분 좋아요. 프린팅 프레스가 흉내낸 것처럼 셔츠가 흘러내리는 일은 없을 거에요. 휠을 제자리에 놓는 것은 렌치를 몇 번 돌리는 것뿐이고 끝났어요.\n\n물론, 처음부터 비프라손으로 강제로 분해하지는 않은 후식 브레이크를 다시 달아야 하지만 후식 브레이크를 재조립하려면 엄지손가락이 있어서는 거의 필요하지 않아요. 몇 초만에 부품을 클립하고 브레이크는 새 것처럼 정상적으로 작동해요. 손가락을 잃는 데 위험을 감수하지 않아도 되고, 긴급한 금속 와이어에 찔리지 않아요. 작업실 바닥에 젖은 나무에 천천히 스며들어있는 혈액으로 자연스레 잭슨 폴락의 그림처럼 보이는 것도 없어요. 무엇보다, 내가 개조한 브레이크는 확실히 작동하기 때문에 \"조심해! 브레이크 없어!\"라고 외치지 않아도 되고, 초등학교 구역을 통과하는 픽업트럭에 들이받히지 않도록 발바닥으로 브레이크를 하는 일도 없죠.\n\n<div class=\"content-ad\"></div>\n\n자전거 수리를 너무 빨리 끝내서 집 주변의 다른 이상한 작업들을 마무리할 시간이 아직 많아요. 혹은 다녀온 후에 아이들을 데리러 가기 전에 집에서 직접 만든 과일 잼 몇 병을 만들 수도 있겠죠. 마무리할 시간이 있다 보니 서둘러야 하는 줄 알았는데 얼른 야구 모자를 쓰고, 그리고 부정말로 더럽힌 손을 비비는 수고도 하지 않아도 되요. 자전거를 타고 학교로 달려가는 중에, 바쁜 길을 건널 때 새 타이어가 거의 떨어질 뻔한 일도 없구요. 그리고 자전거에서 내려와서 앞바퀴만 갖고 걸어가며 주위에서 멈춘 차들을 탄 운전자들이 불쌍한 눈초리로 나를 쳐다보는 일도 없겠지요.\n\n집에 돌아와서 아이들에게 숙제를 다하라고 잔소리하는 것조차 필요 없어요. 그들은 자기 방으로 피하고 혼자 조용히 작업을 모두 마쳐요. 모든 문제를 맞히고서 저녁 전에 나는 자전거 타이어를 교체하는 법을 가르쳐줘요. 다음에 진정한 행복과 자기 실현을 경험하는 것이 무엇인지 배울 수 있도록 도와줘요.\n\n앤드루는 에세이와 유머 작가이자 [Frazzled]의 편집자입니다. 그의 뉴스레터를 구독하면 업데이트를 받을 수 있어요.","ogImage":{"url":"/assets/img/2024-06-23-HowIChangeaBicycleTireAfterWatchingOneYouTubeVideo_0.png"},"coverImage":"/assets/img/2024-06-23-HowIChangeaBicycleTireAfterWatchingOneYouTubeVideo_0.png","tag":["Tech"],"readingTime":3},{"title":"테니스 공의 15가지 다양한 활용법","description":"","date":"2024-06-23 17:50","slug":"2024-06-23-15DifferentUsesforTennisBalls","content":"\n\n![비디오 미리보기](/assets/img/2024-06-23-15DifferentUsesforTennisBalls_0.png)\n\n- 소중품 보관하기. 테니스공을 하나 곁봉에 2인치 정도의 슬릿을 낸 후 속에 소중품을 넣어보세요. 변조된 테니스공을 다른 스포츠 장비 중에 숨기면서 사용하지 않는 것이 중요합니다.\n- 다운 자켓을 건조기에서 부풀리고 정전기 방지하기. 다운 자켓을 건조기에서 돌릴 때 테니스공을 손에 가득 넣어 부풀려보세요.\n- 가구 날카로운 코너를 아이친화 처리하기. 이전 테니스공을 반으로 잘라서 날카로운 가구 모퉁이에 Scotch 포장 테이프를 사용해 붙이세요.\n- 차고에서 차 주차하기 쉽게 만들기. 차고 천장으로부터 줄에 걸린 테니스공을 달아두면 자동차를 정차해야 할 곳에서 창문에 맞을 것입니다.\n- 크롬 트레일러 히치 스크래치 방지하기. 테니스공을 쪼개어 트레일러 히치 위로 덮개로 사용하세요.\n- 보행 보조기 이동이 쉬워지기. 두 개의 테니스공에 구멍을 내어 보행 보조기의 뒷다리에 끼워보세요.\n- 발을 마사지하기. 발을 테니스공 위로 굴려보세요.\n- 등 마사지기 만들기. 양말에 여러 개의 테니스공을 넣고 끈을 묶어 마사지하기. 이는 분만과 자연분만 시 등을 마사지하는 데 많이 사용됩니다.\n- 닿지 않는 곳에 거미줄 제거하기. 거리가 먼 거미줄에 테니스공을 둘러 싸고 몇 개의 고무줄로 고정한 후 던져보세요.\n- \"바구니 테니스\"하기. 빈 커피통의 바닥을 제거하고, 차고 문 위에 달아볼록한 상태로 테니스공을 이용해 농구하기.\n- 그립을 강화하기. 각 손에 테니스공을 쥐어보세요.\n- 코골이 방지하기. 자신의 잠옷 위에 주머니에 테니스공을 소다발하여 등탁에 누이지 않도록 해보세요.\n- 데크 의자가 도크 틈새를 슬립하지 않게 해보세요. 네 개의 테니스공을 슬릿하여 데크 의자의 다리에 맞춰 사용하세요.\n- 등 마사지기 만들기. 양말에 여러 개의 테니스공을 넣고 끈으로 매시되. 이러한 마사지기는 분만준비를 하는 노동 코치에 의해 자연분만 중 등을 마사지하는 데 자주 사용됩니다.\n- 배터리를 낭비하지 않고 차 문을 열어 놓는 방법. 차 문중간에 테니스공을 넣어 내부 램프 스위치를 눌러 놓아보세요.","ogImage":{"url":"/assets/img/2024-06-23-15DifferentUsesforTennisBalls_0.png"},"coverImage":"/assets/img/2024-06-23-15DifferentUsesforTennisBalls_0.png","tag":["Tech"],"readingTime":2}],"page":"14","totalPageCount":113,"totalPageGroupCount":6,"lastPageGroup":20,"currentPageGroup":0},"__N_SSG":true}