{"pageProps":{"posts":[{"title":"Matter v13에서 무엇이 새로워졌을까요","description":"","date":"2024-06-20 16:18","slug":"2024-06-20-WhatsNewwithMatterv13","content":"\n\n2024년 6월 10일\n\n<img src=\"/assets/img/2024-06-20-WhatsNewwithMatterv13_0.png\" />\n\n약 1년 반 전에 Matter에 대해 구체적으로 보고했습니다. 그당시 첫 번째 Matter 장치가 나타나고 있었습니다. Matter 인증 랩은 가동 중이었고, SDK도 완료되었으며, 기업들이 자사 장치를 제조, 업그레이드하고 공식 Matter 승인을 받는 과정을 시작했습니다. 그런데 Matter는 스마트 홈 장치를 간단하게 만들기 위해 설계된 것임에도 불구하고 조금은 느리게 진행 중입니다. 당신의 도어락과 전구에 WiFi나 쓰레드(Thread)라는 새로운 프로토콜을 통해 직접 소통할 수 있는 방법을 제공하여 스마트 홈을 빠르고 응답성 있는 곳으로 만드는 것이 Matter의 목표입니다. Matter는 스마트 홈을 더 빠르고 반응성 있는 것으로 만들어줄 것입니다. 또한 호환되는 장치가 스마트폰에 자동으로 표시되어 연결할 수 있도록 해줌으로써 더 간편한 설정 프로세스를 가능하게 합니다.\n\nMatter는 이 모든 것을 오픈 소스 기반의 IP 프로토콜을 통해 가능케 하고 있으며, 이 프로토콜은 신뢰할 수 있고 안전한 스마트 홈 생태계를 만드는 데 도움이 되는 통합 표준으로 만들어졌습니다. 또한 Matter는 스마트 홈 장치 제조업체들이 Apple HomeKit, Amazon Alexa, Google Home, Samsung SmartThings 등 각 기업의 스마트 홈 생태계별 제품을 만드는 대신 단일 프로토콜에 기반한 제품을 제작할 수 있도록 도와주는 것으로 설계되었습니다.\n\n<div class=\"content-ad\"></div>\n\n지난 보고서 이후에 Matter에 중요한 업그레이드 사항이 있었습니다. Connectivity Standards Alliance (CSA)는 Matter 프로토콜 사양의 버전 1.3을 발표했습니다. CSA에 따르면, 이번 새 릴리스에서는 다음을 지원합니다:\n\n에너지 관리\n\n사용자들이 에너지 사용을 이해하고 관리하며 비용을 절약하고 탄소 발자국을 줄이는 데 도움을 주기 위해, Matter 1.3은 새로운 에너지 보고 기능을 도입했습니다. 이를 통해 어떤 장치 유형도 실시간으로 즉석 전력, 전압, 전류 등을 포함한 실제 및 예상 측정값을 보고하고, 시간에 따른 에너지 소비 또는 발전을 보고할 수 있습니다.\n\n전기 자동차 충전\n\n<div class=\"content-ad\"></div>\n\nMatter 1.3의 에너지 기능은 새로운 에너지 중심 기기를 가능하게 합니다. 그 중 첫 번째로 Electric Vehicle Supply Equipment (EVSE)가 있습니다. 이를 통해 전기 자동차 충전 장비 제조업체들은 소비자가 언제 어떻게 충전할지를 제어할 수 있도록 사용하기 편리한 방법을 제시할 수 있습니다. 이는 수동으로 충전을 시작하거나 중지할 수 있는 능력, 충전 속도를 조절할 수 있는 능력, 또는 출발 시간까지 추가할 마일 수를 지정할 수 있는 능력을 특징으로 하며, 충전 스테이션을 통해 가장 저렴하고 탄소 배출이 적은 시간에 충전하도록 자동으로 최적화할 수 있습니다.\n\n물 관리\n\n누수 및 동결 탐지기, 비 감지기, 그리고 제어 가능한 수도 밸브에 대한 지원을 통해 주택 소유주들은 집 안과 주위의 물에 대한 모니터링, 관리, 그리고 보호를 개선할 수 있습니다.\n\n새로운 장치 유형 지원\n\n<div class=\"content-ad\"></div>\n\nMatter 1.3는 전자레인지, 오븐, 가스레인지, 배현기, 그리고 세탁기 건조기에 대한 지원을 추가했어요.\n\n미디어 플레이어와 TV에 대한 더 나은 지원\n\n마지막으로, 1.3 버전은 하나의 명령으로 여러 장치에 대한 명령을 트리거하는 미디어 플레이어와 TV 장면, 그리고 여러 명령이 하나의 메시지로 결합되는 명령 일괄 처리를 지원하도록 추가되었어요.\n\n다양한 스마트 홈 기기 제조업체들이 Matter를 구현하는 또 다른 흥미로운 측면은 Matter 프로토콜을 직접 제품에 내장하는 기업이 있다는 것이에요. 한편, 다른 기기 제조업체들은 Matter 브릿지 제품을 제품 라인업에 추가하여 Matter 프로토콜과 회사의 기존 API 간에 통신하기 위한 브릿지 역할을 한다는 점이에요.\n\n<div class=\"content-ad\"></div>\n\n처음에는 Matter 브리지가 기업이 기존 제품에 빠르게 Matter 지원을 추가할 수 있는 방법으로 보였습니다. 시간이 지남에 따라 브리지는 각 제품에 Matter 지원이 추가되면 자연스럽게 없어질 것으로 생각되었습니다. 하지만 이러한 경우가 아닐 수도 있습니다.\n\n기존 제품에 Matter 프로토콜 지원을 추가하는 과정은 기기 제조업체에게 상당한 비용이 드는 것으로 밝혀졌습니다. 제품에 지속적으로 혁신을 도입하고 새로운 기능을 추가하는 기업에게는 인증 과정을 각 제품 업데이트마다 반복해야 하므로 비용이 증가합니다.\n\n또한 현재의 Matter 프로토콜은 회사가 제품을 경쟁사와 차별화하기 위해 구현한 특별한 기능을 지원하지 않아 제품을 단순화하는 경향이 있습니다.\n\nMatter 브리지는 이러한 문제들을 해결합니다. Matter 브리지는 다른 업데이트를 거치는 회사의 다른 제품이 있더라도 한 번만 인증되면 됩니다. 이는 Matter를 구현하는 비용을 줄일 수 있습니다. 또한 회사는 Matter 브리지를 통해 기본 제어 기능만 사용 가능하더라도 해당 제품의 기존 API를 통해서만 제공되는 고유하고 혁신적인 기능을 제공할 수 있습니다. 이를 통해 회사는 제품을 경쟁사와 차별화하는 고유한 기능을 계속해서 제공할 수 있습니다. 따라서 Matter 프로토콜 지원을 직접 제품에 통합하기보다 Matter 브리지를 제공하는 기업의 선택에 놀라지 마세요.\n\n<div class=\"content-ad\"></div>\n\n어쨌든, Matter 프로토콜은 계속해서 발전하고 있습니다. 버전 1.3에는 에너지 관리와 새로운 기기 지원을 포함한 여러 가지 새로운 기능이 포함되어 있습니다. 장치 제조업체가 프로토콜을 어떻게 구현하는지도 계속 발전하고 있습니다. Matter 브리지는 제조업체가 프로토콜을 비용 효율적으로 구현하는 데 중요한 도구가 되고 있습니다.\n\n의견이 있으시면 댓글이나 DM, 이메일로 Debbie와 나에게 알려주세요. 여러분의 의견을 듣는 것을 정말로 즐깁니다. Debbie와 제가 집을 짓는 여정을 따라와 주시는 모든 분들께 다시 한 번 감사드립니다. 여러분의 성공 스토리와 제안을 듣는 것이 정말로 기쁩니다. 그리고 매주 올리는 내용을 좋아하신다면 '좋아요'와 '팔로우'도 잊지 마세요.\n\nSmartHomeOnTheRange.com\n\n![이미지](/assets/img/2024-06-20-WhatsNewwithMatterv13_1.png)\n\n<div class=\"content-ad\"></div>\n\n이 기능을 사용자가 편리하게 사용할 수 있도록 제공하는 것이 목적입니다. 각 링크를 클릭하고 제품을 구매한 경우에도 이로부터 수익을 창출하지 않습니다. 이 사실을 명심하시고 쾌적한 쇼핑 경험을 즐기세요.","ogImage":{"url":"/assets/img/2024-06-20-WhatsNewwithMatterv13_0.png"},"coverImage":"/assets/img/2024-06-20-WhatsNewwithMatterv13_0.png","tag":["Tech"],"readingTime":4},{"title":"라즈베리 파이 4에서 SSD로 홈 어시스턴트 부팅하는 방법","description":"","date":"2024-06-20 16:16","slug":"2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4","content":"\n\n<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_0.png\" />\n\n이전 글(\"From MicroSD to SSD: Ended up with a New Raspberry Pi 4 Case\")에서는 마이크로SD 카드 대신 SSD로 전환하고 싶어서 새로운 Raspberry Pi 4 케이스를 구한 경험에 대해 이야기했어. 하지만, 실제로 운영 체제와 데이터를 어떻게 옮겼는지는 언급하지 않았지. 나의 경우엔 Home Assistant OS가 관련되어 있었고, 내 데이터와 설정을 모두 보존하는 것이 중요했어. 처음부터 스마트 홈 시스템의 설정 작업을 피하기 위해 말이야.\n\n이제 이 글에서 GeeekPi Mini Tower NAS Kit의 도움을 받아 이를 성취하는 과정과 내가 취한 단계를 안내해볼게.\n\n# 백업 만들기\n\n<div class=\"content-ad\"></div>\n\n라즈베리 파이 4에 어떠한 변경을 가하기 전에, 현재 홈 어시스턴트 설정의 백업을 만드는 것이 중요합니다. 아래 단계를 따라주세요:\n\n- 홈 어시스턴트 대시보드에서 설정 ` 시스템 ` 백업으로 이동합니다.\n- 시스템의 완전한 백업을 생성하기 위해 \"전체 백업\"을 선택합니다.\n\n![이미지](/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_1.png)\n\n백업 프로세스가 완료되면 백업 파일을 컴퓨터로 다운로드하여 안전하게 보관하세요.\n\n<div class=\"content-ad\"></div>\n\n알림: 홈 어시스턴트에서는 \"설정 ` 시스템 ` 저장소\" 메뉴와 \"데이터 디스크 이동\" 버튼을 사용하여 데이터를 다른 저장 위치로 이동할 수 있는 옵션이 있습니다. 그러나 이 방법은 데이터만 전송되고 부팅 및 운영 체제는 마이크로SD 카드에 남아 있게 됩니다. 원하는 결과가 아닌 경우 이 옵션을 피하는 것이 좋습니다.\n\n본 게시물에는 제휴 링크가 포함되어 있어 링크를 통해 구매를 하신다면 추가 비용 없이 작은 커미션이 전달될 수 있음을 알려드립니다.\n\n# 홈 어시스턴트를 SSD로 이전하기\n\n백업을 만든 후에는 문제가 발생할 경우 대비하여 홈 어시스턴트 마이크로SD 카드를 따로 보관해 두세요. SSD에 홈 어시스턴트를 설치하려면 SSD M.2 SATA 어댑터가 필요합니다. 저는 ORICO M.2 NVMe SATA SSD 엔클로저 어댑터를 선택했습니다. 선택한 어댑터가 M.2 NGFF SATA B+M 키를 지원하는지 확인하세요. 아래는 진행 방법입니다:\n\n<div class=\"content-ad\"></div>\n\n- GeeekPi Mini Tower NAS Kit 케이스의 하단 부분을 분해하여 SSD에 접근하고 분리합니다.\n- SSD를 어댑터에 설치합니다.\n- 어댑터를 사용하여 SSD를 컴퓨터에 연결합니다.\n\n# SSD에 Home Assistant OS 설치하는 방법:\n\nHome Assistant OS를 SSD에 설치하려면 Raspberry Pi Imager를 사용해야 합니다:\n\n- SATA 어댑터를 사용하여 SSD를 컴퓨터에 연결합니다.\n- Raspberry Pi Imager를 엽니다.\n\n<div class=\"content-ad\"></div>\n\n\\<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_2.png\" />\n\n3. 대상 장치로 \"Raspberry Pi 4\"를 선택하세요.\n\n\\<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_3.png\" />\n\n4. \"운영체제 선택\"에서 \"기타 특정용도 OS\" ` \"홈 어시스턴트 및 홈 자동화\" ` \"Home Assistant\"를 선택하세요.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_4.png\" />\n\n5. 저장 장치로 SSD를 선택합니다.\n\n6. '다음'을 클릭하고 화면 안내에 따라 설치를 완료하세요.\n\n7. SSD를 컴퓨터와 SATA 어댑터에서 분리하고 GeeekPi 미니 타워 NAS 킷 케이스에 다시 넣어주세요.\n\n<div class=\"content-ad\"></div>\n\n# 라즈베리 파이 4 부팅 순서 변경\n\n다음으로 진행한 단계는 부팅 순서를 변경하는 것이었습니다. 초기에 라즈베리 파이는 마이크로SD 카드에서 부팅하고, 그 후에만 카드가 없는 경우 USB 장치에서 부팅하는 방식이었습니다. 그러나 이 순서를 변경하고 싶었습니다. 이를 달성하는 여러 가지 방법이 있지만, 라즈베리 파이 4를 모니터에 연결할 수 있는 마이크로HDMI 케이블이 없어 살짝 어려움을 겪었습니다.\n\n그러나 백업용 마이크로SD 카드에 부트로더를 설치하는 우회 방법을 찾았습니다. Home Assistant 설정에 처음 사용한 것과는 다른 마이크로SD 카드가 필요했습니다. 다행히도, Smart Camera에서 더 작은 것을 찾을 수 있었고, 다시 한 번 도움이 필요할 때 라즈베리 파이 이미저를 활용했습니다.\n\n- 컴퓨터에 Anker SD 카드 리더와 같은 장치를 사용하여 마이크로SD 카드를 연결합니다.\n- 라즈베리 파이 이미저를 엽니다.\n- 장치로 \"Raspberry Pi 4\"를 선택합니다.\n- 'OS 선택' 버튼을 클릭한 후 \"Misc utility images\" → \"Bootloader (Pi 4 family)\" → \"USB Boot\"으로 이동합니다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_5.png\" />\n\n5. 저장 장치로 microSD 카드를 선택합니다.\n\n6. \"다음\"을 클릭한 후 지시 사항을 따릅니다.\n\n부트로더를 microSD 카드에 설치한 후에 라즈베리 파이에 삽입하고 전원을 연결하고 30초를 기다린 다음에 장치의 전원을 끕니다.\n\n<div class=\"content-ad\"></div>\n\n참고: 안타깝게도 저는 microHDMI 케이블이 없어서 연결된 모니터에 그린 스크린이 있는지 확인할 수 없었습니다. 그러나 몇 가지 온라인 가이드에서 언급한 LED가 고정 녹색으로 변해야 한다는 것을 관찰했고, 이 행동을 보이지 않았습니다. 그럼에도 불구하고 프로세스가 완료된 것으로 가정했습니다. 마이크로SD 카드의 부트로더가 마법을 부리기에 충분한 30초가 일반적으로 적당하다고 생각했기 때문이죠.\n\nRaspberry Pi 4를 다시 시작하고 Home Assistant의 로컬 IP 주소와 포트에 연결하니, 알짜배기! Home Assistant가 SSD에서 성공적으로 부팅되어 초기 설정 과정을 시작했습니다.\n\n# 백업에서 복원하기\n\n설치 후 두 가지 옵션인 새로운 스마트 홈 설정을 만들어야 할지, 아니면 백업에서 복원할지 선택하게 됩니다. 저는 백업에서 복원하기를 선택했습니다. 인터페이스는 다음과 같이 보였습니다:\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_6.png\" />\n\n'백업 복원' 버튼을 클릭한 후에는 컴퓨터에서 백업 파일을 선택하고 백업 복원 프로세스를 진행해야 합니다.\n\n잠시 기다린 후, 모든 작업이 완료되었습니다. 저는 SSD로 Raspberry Pi 4 및 Home Assistant를 부팅하는 것을 성공했습니다.\n\n# 결론\n\n<div class=\"content-ad\"></div>\n\n좋은 소식은 모든 것이 잘 진행되어 원래의 홈 어시스턴트 설정에서 데이터 손실이나 구성 문제가 없었습니다.이 같은 방법론을 라즈베리 파이의 다른 운영 체제에도 적용할 수 있습니다.\n\n홈 어시스턴트를 마이크로SD에서 SSD로 이전하는 과정에 대한 제 경험이 유익하고 즐거웠기를 바랍니다. 아래 댓글 섹션에서 여러분의 생각, 질문 또는 과정에 대한 독특한 경험을 자유롭게 공유해 주세요.","ogImage":{"url":"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_0.png"},"coverImage":"/assets/img/2024-06-20-HowtoBootHomeAssistantfromSSDonRaspberryPi4_0.png","tag":["Tech"],"readingTime":5},{"title":"애플이 발표한 새로운 AI 기능 중 일부는 무엇인가요","description":"","date":"2024-06-20 16:15","slug":"2024-06-20-WhatAreSomeoftheNewAIFeaturesAppleAnnounced","content":"\n\n<img src=\"/assets/img/2024-06-20-WhatAreSomeoftheNewAIFeaturesAppleAnnounced_0.png\" />\n\n오늘은 Apple에서 최신 AI 기능을 소개하고 있어요. 우리가 기기를 사용하는 방법을 혁신할 것으로 예상되는 새로운 AI 기능에 대해 알아봅시다!\n\nApple과 기술 세계를 주의 깊게 따라온 분으로서, 이번 업데이트를 여러분과 공유하는 것이 기쁩니다.\n\n이 기사를 읽음으로써 Apple의 AI 기능이 여러분에게 어떻게 도움이 될 수 있는지와 미래가 어떻게 전개될 수 있는지에 대한 통찰력을 얻었을거에요. 이런 혁신들이 어떻게 펼쳐지고 여러분의 기술 경험을 더욱 개선할 수 있는지 기대해 주세요.\n\n<div class=\"content-ad\"></div>\n\n# 애플의 AI 진화 이해\n\n새로운 기능을 살펴보기 전에, 애플이 여러 해 동안 제품에 AI를 통합해왔다는 사실을 이해하는 것이 중요합니다. 가상 비서인 Siri는 그중 가장 잘 알려진 예시 중 하나입니다.\n\n그러나 최근 발표된 소식들은 애플이 AI를 완전히 새로운 수준으로 끌어올리며, 그들의 기기를 이전보다 더 똑똑하고 직관적으로 만들고 있다는 것을 보여줍니다.\n\n# 주요 질문에 대한 답변\n\n<div class=\"content-ad\"></div>\n\n- 애플이 발표한 새로운 AI 기능은 무엇인가요?\n- 이러한 기능이 사용자들에게 어떤 혜택을 주는가요?\n- 앞으로 애플이 AI 관련해서 어떤 것을 기대해볼 수 있을까요?\n\n# 애플의 새로운 AI 기능\n\n![이미지](/assets/img/2024-06-20-WhatAreSomeoftheNewAIFeaturesAppleAnnounced_1.png)\n\n## 1. 개인화된 Siri 제안\n\n<div class=\"content-ad\"></div>\n\n애플은 Siri를 더 적극적이고 개인화된 기능으로 업그레이드했어요. 이제 Siri는 당신의 일상 생활과 사용 패턴을 기반으로 제안을 해줄 수 있어요.\n\n예를 들어, 아침에 특정 카페에서 커피를 주문하는 습관이 있다면 Siri가 당신이 하루를 시작할 때 주문을 할 것을 상기시켜 줄 수도 있어요. 이렇게 하면 Siri는 반응만 하는 것이 아니라 선제적인 도우미가 되어요.\n\n## 2. 향상된 사진 및 기억 기능\n\n애플의 사진 앱은 새로운 AI 기능으로 똑똑해졌어요. 이제 이 앱은 얼굴, 장소, 심지어 특정 이벤트까지 인식하는 고급 기계 학습을 사용해요. 이를 통해 사진을 조직화하고 찾기 쉬워졌어요.\n\n<div class=\"content-ad\"></div>\n\n또한, 추억 기능은 보다 의미 있는 그리고 개인화된 사진 컬렉션을 만들기 위해 개선되었습니다. 특별한 순간들을 회상하기에 완벽합니다.\n\n## 3. 지능형 텍스트 인식\n\n라이브 텍스트의 도입으로, Apple의 장치들은 이제 사진과 이미지 내의 텍스트를 인식할 수 있습니다. 이는 표지판, 필기노트, 또는 어떤 텍스트의 사진을 찍을 수 있고, 당신의 장치가 해당 텍스트와 상호작용할 수 있도록 해준다는 것을 의미합니다 — 복사, 붙여넣기, 검색 또는 번역하기.\n\n이 기능은 학생, 전문가 그리고 텍스트를 자주 다루는 사람들에게 굉장히 유용합니다.\n\n<div class=\"content-ad\"></div>\n\n## 4. 똑똑해진 홈 자동화\n\n애플의 HomeKit 플랫폼은 AI 기술을 통해 상당한 향상을 이루었습니다. HomeKit에 연결된 장치는 이제 여러분의 행동을 학습하고 설정을 자동으로 조정할 수 있습니다.\n\n예를 들어, 스마트 온도 조절기는 하루 내내 선호하는 온도를 학습하고 손을 대지 않고도 자동으로 조절할 수 있습니다.\n\n## 5. 향상된 건강 및 피트니스 추적\n\n<div class=\"content-ad\"></div>\n\nApple은 새로운 AI 기능을 통해 건강과 피트니스에 대한 약속을 보여주고 있습니다. Health 앱과 Apple Watch에서 더 정확한 활동 추적과 맞춤형 피트니스 권장 사항을 제공합니다.\n\nAI 알고리즘은 운동 패턴을 분석하고 새로운 운동을 제안하며 수면 품질에 대한 통찰을 제공하여 건강한 생활을 이끌 수 있도록 도와줍니다.\n\n## 6. 개선된 개인 정보 보호 기능\n\n개인 정보 보호는 디지털 시대에서 중요한 문제이며, Apple은 높은 수준의 보안 조치를 취했습니다. 새로운 AI 기능은 많은 작업에 대해 장치 내 처리를 포함하여 데이터를 안전하게 보호합니다.\n\n<div class=\"content-ad\"></div>\n\n예를 들어, Siri의 요청은 Apple의 서버로 전송되는 것이 아니라 기기에서 처리되어 데이터 유출 위험을 최소화하고 개인 정보 보호를 강화합니다.\n\n# 이러한 기능이 사용자에게 어떻게 도움이 되나요?\n\n이러한 인공 지능 기능의 장점은 많고 효과적입니다. 이러한 기능으로 여러분의 삶이 더 편리하고 효율적해집니다:\n\n- 생산성 향상: 맞춤형 제안과 지능적인 텍스트 인식을 통해 더 적은 시간에 더 많은 일을 할 수 있습니다.\n- 편의성 향상: 가정 자동화 및 맞춤형 지원으로 기기 관리하는 시간을 줄이고 더 많은 시간을 즐기는 데 사용할 수 있습니다.\n- 조직 능력 강화: 고급 사진 인식과 스마트 앨범을 통해 기억을 조직화하고 손쉽게 접근할 수 있습니다.\n- 건강 향상: 맞춤형 피트니스 추천과 정확한 건강 추적을 통해 웰빙 목표를 달성하는 데 도움을 받을 수 있습니다.\n- 개인 정보 보호 강화: 기기 내에서 처리되므로 데이터가 안전하고 개인 정보 보호됨을 보장합니다.\n\n<div class=\"content-ad\"></div>\n\n# 앞으로 애플에서 기대할 수 있는 것들\n\n애플은 항상 혁신을 선도해 왔으며, 그들의 인공 지능에 대한 집중력은 그 증거입니다. 앞으로는 그들의 생태계에 더 많은 AI의 원활한 통합을 기대할 수 있습니다.\n\n이는 증강 현실 기술의 발전, 더 강력한 건강 모니터링 기능, 그리고 개인 비서 기능의 추가 향상 등을 포함할 수 있습니다.\n\n애플의 개인정보 보호에 대한 약속은 사용자 데이터가 안전하게 보호되도록 할 것으로 예상됩니다.\n\n<div class=\"content-ad\"></div>\n\n# 결론\n\n애플의 새로운 AI 기능은 디바이스를 더 똑똑하고 개인화되고 사용자 친화적으로 만들 계획입니다. 더 스마트한 홈 자동화, 향상된 사진 정리, 또는 개선된 건강 추적을 통해, 이러한 기능들은 여러분의 삶을 간단하고 풍요롭게 만들기 위해 설계되었습니다.\n\n기술 트렌드를 주시하는 사람으로서, 애플의 AI 발전은 화려한 새로운 도구를 추가하는 것뿐만 아니라 사용자들을 위한 의미 있는 실질적인 개선을 만들기 위한 것이라고 자신있게 말할 수 있습니다.\n\n만약 이 기사가 도움이 되었다면, 동료 애플 팬들과 공유해도 괜찮습니다!","ogImage":{"url":"/assets/img/2024-06-20-WhatAreSomeoftheNewAIFeaturesAppleAnnounced_0.png"},"coverImage":"/assets/img/2024-06-20-WhatAreSomeoftheNewAIFeaturesAppleAnnounced_0.png","tag":["Tech"],"readingTime":4},{"title":"ESP32의 UART 통신","description":"","date":"2024-06-20 16:13","slug":"2024-06-20-UARTCommunicationonESP32","content":"\n\n![UART 통신](/assets/img/2024-06-20-UARTCommunicationonESP32_0.png)\n\nESP32는 Espressif Systems에서 디자인한 인기 있는 보드입니다. 이 보드는 클럭 속도, PWM, I2C, SPI, UART와 같은 훌륭한 기능을 갖춘 일반 개발 보드입니다. 하지만 그 주요 강점은 IoT 기능인 내장 WIFI와 블루투스가 보드에 포함되어 있어 별도의 WIFI 및 블루투스 모듈을 구매할 필요가 없다는 점입니다. ESP32 및 Arduino IDE를 사용한 프로그래밍에 대한 자세한 정보는 여기와 여기의 문서를 참조하십시오.\n\n도구\n\n- 두 개의 ESP32 DEVKIT V1\n- 점퍼 와이어\n- Arduino IDE\n\n<div class=\"content-ad\"></div>\n\nUART\n\nUART은 Universal Asynchronous Receiver Transmitter의 줄임말입니다. 최대 세 개의 연결을 이용한 통신 메커니즘입니다. 이 연결에서 한 모듈의 Rx가 다른 모듈의 Tx에 연결되고 그 반대도 성립되며 두 모듈에 공통적인 그라운드가 제공됩니다. UART는 단방향 통신인 simplex, 양방향 통신이 가능하지만 동시에 통신은 불가능한 half-duplex, 양쪽이 동시에 통신할 수 있는 full duplex와 같이 세 가지 유형의 통신을 지원할 수 있습니다.\n\nESP32의 UART\n\nESP32에는 외부 두 개와 내부 한 개의 UART 채널이 있습니다. UART 핀은 UART0가 Rx 및 TX로 핀 3, 1이며 UART2는 Rx 및 Tx로 핀 16, 17으로 구성됩니다. 한편 UART1은 외부 GPIO가 할당되어 있지 않고 외부 핀을 할당하여 접근할 수 있습니다. 이에 대한 자세한 내용은 나중에 논의될 예정입니다. 저희 프로젝트에서는 두 개의 ESP32 보드를 사용하고 UART 통신을 이용하여 한 보드에서 다른 보드로 데이터를 전송하여, 결과적으로 이벤트를 트리거하도록 할 것입니다. 또한 ESP32 보드의 블루투스 기능을 활용하여, 다른 보드에 블루투스 기능을 제공할 때 ESP32를 HC-05 모듈의 대체품으로 사용할 수 있는지 확인할 것입니다. ESP32의 블루투스 기능을 설정하고 사용하는 방법에 대한 정보는 해당 기사를 참조해 주세요.\n\n<div class=\"content-ad\"></div>\n\n코드 마스터 모듈\n\n마스터 모듈용 아두이노 IDE 코드는 다음과 같습니다.\n\n```js\n#include <BluetoothSerial.h>\n#include <HardwareSerial.h>\nHardwareSerial SerialPort(2);\nBluetoothSerial SerialBT;\nbyte BTd;\n/* SDK에서 Bluetooth 구성이 활성화되어 있는지 확인 */\n#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)\n#error Bluetooth가 활성화되어 있지 않습니다! `make menuconfig`를 실행하여 활성화하십시오\n#endif\nvoid setup() {\n  Serial.begin(115200);\n  SerialPort.begin(15200,SERIAL_8N1,16,17);\n  SerialBT.begin(\"ESP32\");\n}\nvoid loop() {\n  if(SerialBT.available())\n  {\n    BTd=SerialBT.read();\n    Serial.write(BTd);\n  }\n  if(BTd=='1')\n  {\n    SerialPort.print(1);\n  }\n  if(BTd=='0')\n  {\n    SerialPort.print(0);\n  }\ndelay(100);\n}\n```\n\n줄 별 설명에 대해요\n\n<div class=\"content-ad\"></div>\n\n먼저 시리얼 통신 및 블루투스 연결에 필요한 라이브러리를 포함합니다.\n\n```js\n#include <BluetoothSerial.h>\n#include <HardwareSerial.h>\n```\n\n그 다음에는 사용할 UART 포트를 선택합니다.\n\n```js\nHardwareSerial SerialPort(2);\n```\n\n<div class=\"content-ad\"></div>\n\n그럼 SerialBT 인스턴스를 만들고 Bluetooth 연결 오류 감지 코드를 포함시킵니다.\n\n```js\nBluetoothSerial SerialBT;\nbyte BTd;\n/* Bluetooth 설정이 SDK에서 활성화되어 있는지 확인합니다 */\n#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)\n#error Bluetooth가 활성화되어 있지 않습니다! `make menuconfig`를 실행하여 활성화하세요\n#endif\n```\n\nvoid setup 블록에서는 시리얼 통신을 초기화하여 보레이트와 핀을 설정하고, Bluetooth 연결을 설정합니다.\n\n```js\nSerial.begin(115200);\nSerialPort.begin(15200, SERIAL_8N1, 16, 17);\nSerialBT.begin(\"ESP32\");\n```\n\n<div class=\"content-ad\"></div>\n\n마침내 루프 블록에서는 Bluetooth 시리얼 포트 데이터 감지 코드를 포함하고, 그 후 Bluetooth 연결을 통해 받은 데이터에 따라 UART로 데이터를 전송하기 위한 조건문을 작성합니다. 시리얼 포트를 통해 데이터를 전송하기 위해 SerialPort.print(data); 함수를 사용합니다.\n\n```js\n  if(SerialBT.available())\n  {\n    BTd=SerialBT.read();\n    Serial.write(BTd);\n  }\n  if(BTd=='1')\n  {\n    SerialPort.print(1);\n  }\n  if(BTd=='0')\n  {\n    SerialPort.print(0);\n  }\n```\n\n코드-슬레이브 모듈\n\n스레이브 ESP32의 코드는 다음과 같습니다.\n\n<div class=\"content-ad\"></div>\n\n```js\r\n#include <HardwareSerial.h>\r\n```\r\n\r\n먼저 라이브러리를 포함합니다.\r\n\r\n그런 다음 사용할 포트를 선택하고 들어오는 데이터를 저장할 문자 변수를 정의합니다.\n\n<div class=\"content-ad\"></div>\n\n```js\nHardwareSerial SerialPort(0); // UART0을 사용합니다\nchar number  = ' ';\n```\n\nvoid setup 블록에서는 UART 통신을 시작하기 위해 보레이트와 포트 핀을 설정합니다.\n\n```js\n  Serial.begin(115200);\n  SerialPort.begin(15200, SERIAL_8N1, 3, 1);\n```\n\nvoid loop 블록에서는 마스터로부터 데이터를 수신하고 시리얼 모니터에 표시합니다. SerialPort.available() 함수를 사용하여 시리얼 포트에서 데이터를 수신할 준비가 되어 있는지 확인한 후, SerialPort.read() 함수를 사용하여 데이터를 char 변수에 저장합니다.\n\n<div class=\"content-ad\"></div>\n\n```js\n if (SerialPort.available())\n {\n    char number = SerialPort.read();\n    Serial.write(number);\n\n }\n```\n\n결과\n\nESP32 모듈에 두 코드를 업로드한 후, 슬레이브 모듈의 시리얼 모니터를 열고 블루투스 통신을 통해 마스터 모듈로 '1' 또는 '0'을 전송합니다. 수신된 데이터는 시리얼 모니터에 표시됩니다. 또한 동일한 표시된 데이터를 사용하여 LED 제어와 같은 조건문을 사용하여 이벤트를 트리거할 수도 있습니다. 블루투스를 통해 수신한 데이터를 직접 전송할 수는 없으므로 조건문을 사용해야 하며 특정 데이터만 전송할 수 있습니다.\n\n참고로, 유료 콘텐츠 작성 및/또는 기사 작성 작업을 위해 ESP32 보드에 대한 무료 안내가 필요할 경우 khantalha7367@gmail.com로 연락하시거나 Fiverr 기가를 방문해주십시오. https://www.fiverr.com/s/rL3mWN, https://www.fiverr.com/s/7rj8Xy\n\n","ogImage":{"url":"/assets/img/2024-06-20-UARTCommunicationonESP32_0.png"},"coverImage":"/assets/img/2024-06-20-UARTCommunicationonESP32_0.png","tag":["Tech"],"readingTime":5},{"title":"로이그는 유튜브에서 딱 1000 벌었다고 말하네요","description":"","date":"2024-06-20 16:12","slug":"2024-06-20-ThisVloggerSaysHeJustMade1000onYoutube","content":"\n\n유튜버들이 얼마나 돈을 벌까요?\n\n<img src=\"/assets/img/2024-06-20-ThisVloggerSaysHeJustMade1000onYoutube_0.png\" />\n\n인터넷을 잘 다루고 즐기는 분이라면 온라인에서 돈을 벌 수도 있을 거예요. 하지만 이 부가 수입을 얻기 위해서는 시간, 에너지, 그리고 헌신적인 노력이 필요할 수도 있습니다. 유튜버들이 돈을 얼마나 벌까요?\n\n제 조사 결과에 따르면, 유튜브는 부가 수입을 얻기 위한 좋은 장소가 될 수 있어요. 하지만 수익은 상당히 다양할 수 있다고 합니다. 어떤 블로거들은 50달러부터 시작하여 만족스러운 수입을 올릴 수도 있어요.\n\n<div class=\"content-ad\"></div>\n\n유튜브에서 Kurt of Trades라는 이름으로 활동하는 한 Vlogger를 살펴봐요. 그는 시청수를 늘리는 데 약 네 년이 걸렸다고 말했습니다. 레딧 게시물을 통해 자동차 분야에 집중하고 매달 약 115,000회의 조회수를 기록한다고 공개했습니다.\n\n그렇지만 유튜브에서 조회수를 얻기 위한 경쟁은 치열할 것입니다, 특히 플랫폼이 변화하고 있는 상황에서 말이에요. 지금은 유튜브에서 많은 풀버전 영화에 무료로 액세스할 수 있다는 사실을 알고 계셨나요?\n\n모두가 많은 조회수를 얻지는 않는다는 것을 알아야 해요. 일부 사용자들은 $100의 임금을 받기 위해 헤쳐나가는 것이 어렵다고 솔직하게 인정합니다.\n\n유튜브에서 부가 수익을 창출하고 싶은 사람들을 위해서는 사이트를 확인하고 사이트의 인기 있는 채널들을 연구하는 것이 중요합니다. 특정 분야를 선택하는 것도 중요하며, 그것을 매력적으로 만들어 시청자들이 계속해서 끌려들게 하는 것이 중요합니다.\n\n<div class=\"content-ad\"></div>\n\n안녕하세요! 혹시 한 편의 영상이 계속 기억에 남는다면, 매달 수입을 올릴 수도 있답니다.\n\n사용자 Little -Airport-8673가 말하길, 그는 규칙적인 게시자는 아니지만 300만 뷰를 달성한 한 편의 동영상으로 매달 약 60유로의 수입을 올린다고 합니다.\n\n몇 년 전, 영화 수업을 듣던 때 한 학생이 수경재배에 관한 비디오가 화제가 되어 매우 유명해졌다는 이야기를 들었습니다. 비밀을 물어보니, \"나는 TV를 보지 않아\"라고 대답했습니다. 이는 창작자가 되기로 결심할 때, 주의를 집중시키는 것이 중요함을 시사하는 것 같습니다.\n\n유튜브에서는 이제 무료 영화들로 인해 쉽게 산만해질 수 있어요. 이 사이트는 무료 영화를 제공하며, 이는 넷플릭스와의 경쟁이 된다고 할 수 있을까요?\n\n<div class=\"content-ad\"></div>\n\n충분한 조회수가 있고 돈을 벌 준비가 되셨나요?\n\n첫 번째로 해야 할 일은 YouTube 파트너 프로그램에 가입하는 것입니다. 크리에이터들은 숏 비디오, 라이브 스트리밍 또는 장편 비디오 등을 업로드하는 것을 권장받습니다.\n\n기타 요구 사항은 다음과 같습니다:\n\n- 지난 90일간에 공개된 업로드가 3개인 구독자가 500명이어야 하며, 과거 12개월 동안 3천 시간의 시청 기록이 있거나 지난 90일 동안 3백만 Public Shorts 조회수가 있어야 합니다.\n\n<div class=\"content-ad\"></div>\n\n만약 영상을 만드는 것에 대해 전혀 모르거나 대본을 작성해 본 적이 없다면 어떻게 해야 할까요?\n\n여기 한 가지 생각해 볼 만한 이야기가 있어요: 몇 달 전, 스웨덴의 한 구매자가 나를 고용해서 그녀의 만화 비디오 채널을 위해 몇 개의 대본을 쓰고 만들도록 고용했어요. 이 구매자는 좋은 기업가이자 특정 시장을 발견했어요. 그녀는 글쓰는 사람도 아니고 영상을 만드는 법도 모르는 사람이었어요. 그녀는 Fiverr을 통해 그들을 고용했어요!\n\n<div class=\"content-ad\"></div>\n\n그러니까, 당신이 유튜브에서 돈을 벌기 위해서 반드시 크리에이터일 필요는 없어요. 비전과 계획이 멀리 가는 데 도움이 돼요.\n\n조사하기:\n\n잠재적인 크리에이터들은 가장 많은 구독자를 보유한 유튜브 채널을 확인하는 걸 장려받아야 해요.\n\n일부는 다음과 같아요:\n\n<div class=\"content-ad\"></div>\n\nMr. Beast는 최소 2억 7500만 구독자를 보유하고 있어요.\n\n인도의 T-Series는 2억 6700만 구독자를 보유하고 있어요.\n\n저는 영감을 얻는 곳으로 5분 취미 생활 채널을 자주 이용하고 있어요. 해당 채널은 약 8,000만 구독자를 보유하고 있어요.\n\n20번째로 많은 구독자를 보유한 가수, Justin Bieber 채널은 대단한 7300만 구독자를 보유하고 있어요.\n\n<div class=\"content-ad\"></div>\n\n테이블 태그를 마크다운 형식으로 바꿔보세요.\n\n<div class=\"content-ad\"></div>\n\n\"Medium Partner Program\" 주제를 검색하면 어떤 일이 벌어질까요? 제가 검색했을 때는 Hudson Rennie 같은 몇몇 크리에이터들이 나타나더라구요. 그 중에서 하나의 비디오가 현재 39,000회 조회수를 기록 중이었습니다.\n\n흥미로운 점은 AI 아바타를 사용한 Medium 관련 비디오를 많이 보지 못한다는 것인데요. 개인적으로 아바타는 가짜와 비인간적으로 느껴집니다. 저는 바로 실제 사람에게 끌리는 경향이 있어요.\n\nYouTube에서 인기 있는 다른 카테고리 중 하나는 \"돈 벌기\" 비디오입니다. 제 개인적인 즐겨찾는 채널은 Wholesale Ted인데, 그 크리에이터가 자신의 전략을 공개합니다.\n\n이전에는 최고의 카테고리 비밀을 \"밝혀주는\" 비디오를 수십 시간을 보았습니다. 그 결과, 앱이나 아이디어를 시도해봤지만 결과가 일치하지 않았어요!\"\n\n<div class=\"content-ad\"></div>\n\n한 가지는 확실해요: 이들 창작자들은 자신들의 채널을 판매하는 법을 알고 있습니다. 수많은 제목들이 너무 좋아 보이기도 해요 - 마치 매달 10,000달러를 벌어들이는 것처럼 말이죠. 그럼에도 불구하고, 이는 흥미를 끄는 좋은 수단이 되곤 해요. 이 비디오들이 종종 자신들의 약속에 부응하지 못할 때가 있으며, 특히 돈 버는 균에서 그렇게 말이에요. 하지만 여러분들의 견해가 다르다면, 의견을 알고 싶어요.\n\n요약하자면, 창작자들이 충실한 구독자를 원한다면, 그들의 비디오가 매료적이고 진실해야 한다고 생각해요. 허풍과 약속을 걷어내세요. 진실을 말하는 것으로, 분명히 여러분의 팬베이스를 유지할 수 있을 거예요.\n\n개인적으로, 저는 애완 동물 비디오를 좋아해요. 고양이나 개를 키우고 계시거나, 다른 특이한 애완 동물을 키우고 계신다면, 올려주세요! 언젠가는 바이럴이 될지도 몰라요!\n\n## 퀴즈 정보: 저스틴 비버가 어떻게 시작했는지 추측해보세요. 아주 어릴 때 유튜브에서 노래를 부르기 시작했고, 빠르게 팬덤을 모았어요. 엄마가 비디오를 올려준 덕분에, 비버는 어린이들의 맘을 사로잡았고, 얼마 지나지 않아 새로운 스타가 탄생했어요.\n\n<div class=\"content-ad\"></div>\n\n오늘은 여기까지 입니다. 제 최신 글을 받으시려면 여기서 이메일로 구독해주세요. 삶의 큰 신비를 곰곰이 생각해보게 하는 이야기를 전해드리기 위해 열심히 일하고 있습니다. 읽어보시고 논의를 일으키는 이야기를 전달하기 위해 구독해주세요.\n\n이전 글은 여기에서 확인해주세요:","ogImage":{"url":"/assets/img/2024-06-20-ThisVloggerSaysHeJustMade1000onYoutube_0.png"},"coverImage":"/assets/img/2024-06-20-ThisVloggerSaysHeJustMade1000onYoutube_0.png","tag":["Tech"],"readingTime":4},{"title":"클라우드 컴퓨팅과 사물인터넷 통합으로 발생하는 도전과제","description":"","date":"2024-06-20 16:10","slug":"2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT","content":"\n\n![image](/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_0.png)\n\n사물 인터넷(IoT)은 물리 자산, 센서 장치, 기계 게이트웨이, 그리고 연결된 네트워크를 디지털화합니다. 이는 사람들과 사물을 실시간으로 연결하여 일반적인 사물 인터넷 네트워크는 폭발할 수 있으며 데이터의 종류, 속도 및 총 양이 기하 급수적으로 증가할 수 있습니다. 클라우드 컴퓨팅은 적합하고 확장 가능한 네트워크 액세스를 제공하여 다양한 이기종 컴퓨팅 장치로부터 데이터를 쉽게 통합하는 데 도움이 됩니다. 그러나 IoT 장치와 클라우드의 통합 플랫폼에는 다양한 도전 과제가 있습니다. 본 논문에서는 클라우드와 IoT를 통합함에 따라 직면한 주요 보안 도전 과제 몇 가지를 제시합니다.\n\n# 소개\n\nIoT와 클라우드 컴퓨팅은 제4차 산업혁명의 일환으로 나란히 등장한 기술로, 둘을 탐구하는 것이 중요하다. 이 두 새로운 기술의 공통점은 많은 연구원들이 두 기술을 통합하여 개선하고 향상시키려는 이유가 됩니다. 많은 사람들은 클라우드 컴퓨팅을 새로운 기술로 생각하지만, 이는 그리드, 유틸리티 컴퓨팅, 가상화, 네트워킹 및 소프트웨어 서비스와 같은 다양한 기술과 결합된 것입니다. 클라우드 기술의 기원이 그리드, 유틸리티 컴퓨팅, 가상화, 네트워킹, 소프트웨어 서비스, 분산 컴퓨팅 및 병렬 컴퓨팅에 있다는 것은 놀랍지 않습니다. IoT는 자기 구성 요소를 매우 지능적으로 관리하는 동적이고 전역적인 네트워크 인프라로 볼 수 있습니다. IoT는 우리 주변 모든 항목이 인터넷에 연결되고 최소한의 인간 노력으로 상호 작용할 수 있게 하려고 합니다. IoT에는 일반적으로 저장 용량과 컴퓨팅 능력이 제한된 여러 개체가 포함됩니다. 클라우드 컴퓨팅과 IoT는 의심의 여지없이 인터넷과 차세대 기술의 미래입니다. 그러나 클라우드 서비스는 상호 운용성이 있는 서비스 제공업체에 의존하고, IoT 기술은 상호 운영성보다 다양성에 기반을 둡니다.\n\n<div class=\"content-ad\"></div>\n\n# 기본 개념\n\n이 섹션에서는 클라우드 컴퓨팅, 사물 인터넷(IoT) 및 클라우드 기반 IoT의 기본 개념을 검토합니다. \n\n## 사물 인터넷\n\n사물 인터넷 또는 IoT는 우리의 일상 생활에 영향을 미치고 있습니다. 스마트폰으로 제어할 수 있는 에어컨, 가장 짧은 경로를 제공하는 스마트카, 일상 활동을 추적하는 스마트워치까지 우리가 반응하는 방식부터 행동하는 방식까지 영향을 미칩니다. IoT의 모든 것(스마트 기기, 센서 등)은 자체적인 식별 정보를 가지고 있습니다. 이들은 통신 네트워크를 형성하기 위해 결합되어 활발하게 참여하는 객체로 변신할 것입니다. IoT는 연결된 장치로 이루어진 거대한 네트워크입니다. 이들 장치는 자신들이 사용되는 방법과 운영 환경에 대한 데이터를 수집하고 공유합니다. 이 모든 것은 센서를 사용하여 이루어집니다; 센서는 모든 물리적 장치에 내장되어 있습니다. 이는 휴대 전화, 가전 제품, 바코드 센서, 신호등 등 일상 생활에서 마주치는 거의 모든 것이 될 수 있습니다. 이러한 센서는 장치의 작동 상태에 대한 데이터를 지속적으로 방출하지만 중요한 질문은 이 방대한 양의 데이터를 어떻게 공유하며, 이 데이터를 어떻게 우리의 이익에 활용할 것인가입니다. IoT는 모든 이들 장치가 자신들의 데이터를 버릴 수 있는 공통 플랫폼을 제공합니다. 또한 이들 객체는 요청을 생성하고 상태를 변경할 수 있습니다. 따라서 모든 IoT 장치는 모니터링, 추적 및 계산할 수 있어서 낭비, 손실 및 비용을 크게 줄입니다. 또한 서로 통신할 수 있는 모든 장치를 위한 공통 언어도 제공합니다. 다양한 센서에서 데이터가 방출되고 IoT 플랫폼 보안으로 데이터가 전송됩니다. IoT 플랫폼은 다양한 소스에서 수집된 데이터를 통합하고 이를 바탕으로 추가 분석이 수행되며 요구사항에 따라 가치 있는 정보가 추출됩니다. 결과는 다른 장치와 공유되어 사용자 경험과 효율성 향상을 위한 자동화가 이루어집니다. 우리는 스마트 가전제품, 스마트카, 스마트 홈, 사물 인터넷이 우리의 생활 방식을 재정의하고 기술과 상호 작용하는 방식을 변화시키는 스마트 시티를 갖고 있습니다. 사물 인터넷 산업의 미래는 거대합니다. Business Insider Intelligence는 2020년까지 설치된 사물 인터넷 장치가 240억개에 달할 것으로 추정하고 ITC는 2019년에 사물 인터넷 수익이 약 3,570억달러에 이를 것으로 예측하여 많은 일자리 기회가 제공될 것입니다. 다양한 기관과 연구자들이 많은 IoT의 정의를 제시해왔습니다. ITU(2012)에 따르면 IoT는 \"기존 및 진화 중인 상호 운용 가능한 정보와 통신 기술을 기반으로 사물(물리적 및 가상)을 연결하여 고급 서비스를 가능하게 하는 정보 사회를 위한 글로벌 인프라\"라고 합니다. IoT는 다양한 기회와 응용 프로그램을 도입합니다. 그러나 데이터 저장, 이질적 자원 제한, 확장 가능성, 해당 지형에 따른 배치 및 에너지 효율성과 같은 다양한 문제에 직면하고 있어 그 성공적인 구현을 방해할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_1.png)\n\n## 클라우드 컴퓨팅\n\n클라우드 컴퓨팅에 대한 몇 가지 제안된 정의들이 존재하지만, 대부분의 사람들이 동의하는 가장 널리 알려진 정의는 미국 국립기술표준연구소 (NIST)가 제시한 것으로 보입니다. 실제로 NIST는 클라우드 컴퓨팅을 \"네트워크 접근의 범용성, 편리성, 온디맨드 접근을 가능하게 하는 모델(구성 가능한 컴퓨팅 네트워크, 서버, 저장 공간, 응용 프로그램 및 서비스의 공유 풀에 신속하게 구성 및 해제되며 최소한의 관리 노력 또는 서비스 제공자 상호작용으로)\"라고 정의했습니다. 클라우드 배포 모델은 공개, 비공개 및 하이브리드 세 가지 유형으로 나뉩니다. 공개 클라우드는 서버를 여러 사람과 공유하는 것입니다. 클라우드 컴퓨팅 배포 모델은 대부분 인터넷을 통해 소비자에게 리소스를 제공하는 공개 클라우드로 분류됩니다. 비공개 클라우드는 개인 서버를 제공합니다. 이는 고객의 서버이고 해당 운영 체제가 배포되며 데이터를 안전하게 사용할 수 있습니다. 하이브리드 클라우드는 공개 클라우드와 비공개 클라우드의 혼합입니다.\n\n## 클라우드 기반 사물 인터넷\n\n\n<div class=\"content-ad\"></div>\n\n사물 인터넷은 이제 모든 것이 인터넷으로 연결되는 것을 의미합니다. 센서와 클라우드가 있어 다른 종류의 센서도 인터넷에 연결할 수 있게 되었죠. 모든 것이 인터넷에 연결되고 이러한 메커니즘으로 가능한 다양한 종류의 서비스가 존재하며 엄청난 양의 데이터가 생성됩니다. 우리는 이러한 IoT 클라우드가 클라우드 기술 또는 클라우드 철학과 결합된 것이 어떻게 인터넷의 서비스 또는 클라우드 서비스의 전반적인 성능에 도움이 될 수 있는지 살펴보고 싶습니다. 클라우드 컴퓨팅은 대부분의 IoT 문제를 일부 해결했습니다. 사실, IoT와 클라우드는 두 가지 비교적 어려운 기술이지만 현재와 미래의 인터네트워킹 서비스 환경을 변화시키기 위해 결합되고 있습니다.\n\n클라우드와 IoT의 상보적 특성은 표 1에서 보여집니다. 이러한 상보성이 많은 연구자들이 이 둘을 통합 제안한 주요 이유입니다.\n\n![Challenges generated by the Integration of Cloud computing and IoT](/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_2.png)\n\n# 클라우드 기반 IoT 통합에서 직면한 도전과제\n\n<div class=\"content-ad\"></div>\n\n클라우드와 사물 인터넷 통합에 직면한 다양한 문제가 있습니다. 일부를 아래에 열거해 봤습니다:\n\n## 장치 및 그 처리 능력\n\n보안 접근은 일반적으로 암호화에 의존하며 대부분의 보안 접근 방법은 암호화에 의존합니다. 그러나 사물 인터넷에 대해 이야기할 때, 전체 환경은 제약된 환경이며 기기도 제약된 기기로 이루어져 있습니다. 이는 리소스 사용 가능성, 메모리, 프로세서 속도 등에 있어서 럭셔리한 것을 가지고 있지 않다는 것을 의미합니다. 또한 암호화는 제약된 환경 및 제약된 기기에 적합하지 않을 수 있으며 이 복잡한 암호화 및 복호화는 제약된 기기에서 시간이 오래 걸릴 수 있어 잘 작동하지 않을 수 있습니다. 이러한 제약된 리소스를 가진 제품들은 측면 공격 및 알고리즘의 역공학에 대해 가장 취약할 수 있으며 민감한 정보 유출이 다중 테넌시로 인해 발생할 수도 있습니다. 게다가 IoT 기기가 부과한 처리 능력 제약 때문에 모든 레이어에 공개 키 암호화를 적용할 수는 없습니다. 신규 도전 과제는 특별한 주의를 필요로 합니다. 예를 들어 분산 시스템은 SQL 인젝션, 세션 탈취, 크로스 사이트 스크립팅, 측면 공격 등의 여러 공격에 노출될 수 있습니다. 또한 세션 탈취 및 가상 머신 탈출과 같은 중요한 취약점이 있는 문제는 더욱 심각합니다.\n\n## 권한 및 인증\n\n<div class=\"content-ad\"></div>\n\n비록 보안과 개인정보 보호는 매우 중요한 연구 문제이며 큰 관심을 받고 있지만, 여전히 논란이 많고 추가 노력이 필요한 문제들입니다. 해커들로부터의 다양한 위협에 대응하는 것은 아직도 문제입니다. 기기 승인은 별도의 작업이 아닙니다. 인증과 함께 이루어져야 하며, IoT 제품에서는 매우 중요합니다. 사용자가 인증되어야 하며, 액세스하려는 사람은 게이트웨이 액세스 및 기타 클라우드 자원을 이용하기 전에 자신의 신원을 확립해야 합니다. 따라서 저는 두 단계 인증 및 강력한 비밀번호 사용을 권장합니다. 이 측면에 대해 생각해야 할 필요성이 있습니다. 보안 인증과 승인 모두 매우 중요하며, 기억해야 할 점이 있습니다.\n\n## 업데이트\n\n세 번째 측면은 기기 업데이트입니다. 기기가 있으면 업데이트가 이루어집니다. 회원 업데이트나 보안 패치, 펌웨어 또는 소프트웨어 업데이트는 여러 어려움을 겪을 수 있습니다. 매일, 매초 새로운 보안 위협이 발생하고 있습니다. 이런 문제는 주로 보안 패치 및 펌웨어 업데이트를 통해 해결합니다. 이러한 업데이트는 매우 중요하며, 모든 IoT 장치에 적용할 수 있는 것은 아닐 수 있습니다. 어떻게 해결할 수 있을까요? 모든 IoT 장치의 펌웨어를 업데이트할 기회가 있는가? 상황에 따라 다르겠지만, 일부 제약된 환경으로 인해 펌웨어 업데이트를 진행할 수 없을 수도 있습니다. 많은 경우, 기기 이용자가 업데이트에 관심을 보이지 않는 경우도 있습니다. 보안 업데이트의 중요성을 잊어버리고 보안 업데이트를 미루는 것이 큰 문제입니다. 이것이 우리가 직면한 주요 문제이며, 가장 큰 도전 중 하나입니다.\n\n## 통신 채널\n\n<div class=\"content-ad\"></div>\n\n통신 채널은 메시지를 전송하기 전에 암호화하는 것이 좋지만 더 나은 방법은 전송 암호화를 사용하고 TLS(전송 계층 보안)과 같은 표준을 준수하는 것입니다. 통신 채널에서 메시지를 전송할 때 암호화하고 표준화하는 점을 주목해주세요. 우리가 말한 첫 번째 점은 디바이스에서 발생하는 암호화입니다. 그러나 지금은 두 번째 점에 대해 이야기하고 있습니다. 이 두 점 사이에는 많은 차이가 있으므로 그 차이를 이해해주세요. 취약점에 대해 이야기할 때, 비용 제약, 전문 지식 제약, 고객이 소프트웨어 운영을 인지하지 못하는 제한, 시장이 능률적인 배포를 위한 필요를 만들 때 발생할 수 있는 제약 등을 생각해볼 수 있습니다. 시스템이 안전하고 동작 가능하다는 것을 확인하기 위해 여러 번의 확인이 필요할 수 있지만 빠른 전개가 필요한 경우 여러 번의 확인을 할 수 없습니다. 이것은 IoT 장치를 배포할 때 직면하는 주요 보안 취약점입니다. 또한, 중요한 IoT 응용 프로그램이 클라우드로 이동하면 서비스 제공업체에 대한 신뢰 부족, 서비스 수준 협약(SLA)에 대한 정보, 그리고 데이터의 물리적 위치로 인한 문제가 발생할 수 있습니다.\n\n## 수집된 데이터 유지\n\n센서 데이터는 안전하게 저장되고 처리되어야 합니다. 센서 데이터는 다양한 센서에서 가져올 수 있으며 다양한 장비에 연결될 수 있습니다. 이 모든 다른 장비들이 다른 장소에 위치할 수 있기 때문에 데이터 무결성이 유지되어야 하는 도전이 있습니다. 체크섬 또는 서명을 포함하여 오리지널 원시 데이터가 전송 중 수정되지 않도록 해야 합니다. 즉, 목적지로 전송되어야 하는 데이터를 생성했고, 그 데이터 사이에 변경이 없어야 합니다. 이를 위해 체크섬 및 다른 방법을 통해 데이터의 순서 변경되지 않음을 확인하고, 이러한 모든 사항을 실천해야 합니다. 그리고 가장 중요한 점은 더 이상 필요하지 않은 데이터는 삭제해야 합니다. 해당 데이터를 보유함으로써 복잡성이 증가하고 유지 보수 비용이 더 많이 발생할 수 있습니다.\n\n## 성능\n\n<div class=\"content-ad\"></div>\n\n여기서의 성능은 IoT 센서의 종류 및 사용되는 응용 프로그램에 따라 달라지는 네트워크 대역폭과 관련이 있습니다. 응용 프로그램이 산업 수준이 아니라면 대역폭이 크게 필요하지 않습니다. 그러나 센서에서 클라우드로 많은 양의 데이터 전송이 필요한 경우 대역폭이 많이 필요합니다. 예상치 못한 문제로 시간성이 영향을 받을 수 있으므로 실시간 응용 프로그램은 성능 효율성에 매우 민감합니다. 클라우드 환경은 넓었으며, 이는 넓었지만 저장 및 계산 발전과 조화되지 않는 네트워크 성장 때문입니다.\n\n# 클라우드 기반 IoT 응용 프로그램\n\n클라우드와 IoT의 통합은 전 세계의 사람들의 삶을 간단히 하는 효율적인 다양한 응용 프로그램을 도입했습니다. 이 중 일부는 아래의 표 2에 나열되어 있습니다.\n\n![Challenges generated by the Integration of Cloud computing and IoT](/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_3.png)\n\n<div class=\"content-ad\"></div>\n\n# 결론\n\n사물 인터넷(IoT)은 현재 진화하고 있는 기술로, 대용량 데이터 저장 플랫폼 및 고속 처리 시스템이 필요합니다. 저장 및 처리 능력의 한계는 보안, 인증, 권한 부여, 성능, 통신 채널, 업데이트 및 장치 용량과 같은 문제로 이어지는 주요 고민 중 하나입니다. 이러한 과제를 극복하기 위해 클라우드의 통합이 필요합니다. 본 논문에서는 클라우드 기반의 IoT 접근 방법이 필요함을 제시했습니다.","ogImage":{"url":"/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_0.png"},"coverImage":"/assets/img/2024-06-20-ChallengesgeneratedbytheIntegrationofCloudcomputingandIoT_0.png","tag":["Tech"],"readingTime":8},{"title":"인터넷 새 시대가 세상을 어떻게 바꿀 것인가","description":"","date":"2024-06-20 16:09","slug":"2024-06-20-HowThisNewEraoftheInternetWillChangetheWorld","content":"\n\n## 웹 3.0:\n\n![이미지](/assets/img/2024-06-20-HowThisNewEraoftheInternetWillChangetheWorld_0.png)\n\n많은 분석가와 기술 비전가들이 이 변화가 초기의 World Wide Web 자체만큼 중대할 것으로 믿고 있습니다. 이 새로운 반복은 웹 3.0이라고 불리며, 데이터 및 자산을 다루는 방식부터 온라인 세계의 권력 구조에 이르기까지 모든 것을 다시 조직할 수 있는 잠재력을 지니고 있습니다.\n\n그 핵심은 블록체인 기술에 기반을 둔 탈중앙화된 인터넷 생태계를 만드는 데 있습니다. Google, Amazon, Facebook 등 대형 기술 기업들에 의해 데이터와 디지털 흔적이 소위 봉쇄되고 통제되는 것이 아니라, 웹 3.0은 그 소유권과 통제력을 개별 사용자들에게 부여하려고 합니다.\n\n<div class=\"content-ad\"></div>\n\n# 탈중앙화 웹의 부상\n\n이 탈중앙화된 비전을 가능케 하는 주요 혁신은 블록체인입니다. 이 기술은 비트코인과 같은 암호화폐의 기초인 분산 원장 기술입니다. 그러나 블록체인의 잠재력은 디지턈 화폐에만 국한되지 않습니다.\n\n핵심적으로, 블록체인은 중앙화된 권한 없이 개별 노드 네트워크 전체에 걸쳐 데이터를 기록하는 방법입니다. 모든 거래는 암호화되어 복잡한 암호학을 통해 검증되며 불변한 공개 원장에 투명하게 기록됩니다.\n\n이러한 구조는 블록체인을 해킹, 사기, 나쁜 행위자로부터의 조작에 극도로 저항력 있는 것으로 만듭니다. 그리고 이는 재정뿐만 아니라 기록 보관, 스마트 계약, 디지턈 자산 소유 등 다양한 분야에 새로운 가능성을 엽니다. 이러한 기초 위에 온라인 플랫폼과 앱을 구축하면 어느 단일 기관도 액세스 제한, 콘텐츠 검열, 또는 이를 통해 이윤을 창출하는 사용자 데이터 제한을 할 수 없는 인터넷이 형성됩니다.\n\n<div class=\"content-ad\"></div>\n\n## 웹 3.0의 핵심 원칙과 예측된 영향 중 일부는 다음과 같습니다:\n\n분산형 애플리케이션 (DApps): 이러한 앱은 소유 서버가 아닌 분산된 블록체인 네트워크에서 실행됩니다. 어떤 회사도 규칙을 변경하거나 액세스를 거부할 수 없습니다.\n\n데이터와 자산의 실제 소유권: 사용자는 데이터, 디지털 자산, 콘텐츠, 신원 및 자산을 대여하는 것이 아니라 증명 가능하게 소유할 수 있게 될 것입니다. 지속적인 지갑과 히스토리가 함께 이동합니다.\n\n신뢰없는, 허가되지 않은 시스템: 참여하려면 중앙 집중식 승인이나 신원 확인이 필요하지 않습니다. 모든 사람이 상호 작용할 수 있는 코따이된 규칙을 갖는 공개 프로토콜입니다.\n\n<div class=\"content-ad\"></div>\n\n토큰 기반의 경제학: 광고 수익이나 VC 자금보다 이러한 플랫폼의 인센티브와 경제는 네이티브 암호화폐 토큰에 기반을 두고 있습니다. 사용자는 단순히 참여함으로써 수익을 올릴 수 있습니다.\n\n아직 초기 개발 단계이지만, 금융(DeFi 플랫폼), 디지털 컬렉터블 및 아트(NFT), 탈중앙화된 소셜 미디어 및 블로깅(mirror.xyz) 등 다양한 Web 3.0 애플리케이션의 초기 예시가 이미 나타나고 있습니다.\n\n그러나 진정으로 번성하기 위해서는 블록체인 처리량, 사용자 경험, 각각의 사일로로 구분된 체인 간 상호 운용성, 그리고 신흥 토큰 기반 비즈니스 모델 주변의 규제적 명확성과 같은 중요한 규모 확대 장벽을 극복해야 합니다. 이와 같은 장벽을 해소하기 위해 이더리움의 오래된 2.0 업그레이드와 같은 주요 프로젝트들이 본격적인 채택을 위한 장애물을 극복하려 노력하고 있습니다.\n\n# 데이터 권리와 인터넷 비즈니스 모델의 혁명\n\n<div class=\"content-ad\"></div>\n\n![HowThisNewEraoftheInternetWillChangetheWorld_1](/assets/img/2024-06-20-HowThisNewEraoftheInternetWillChangetheWorld_1.png)\n\n웹 3.0의 엄청난 잠재력적 영향을 이해하려면 기술 거인들이 현재 보유한 힘과 집중력을 보면 됩니다. FAANGs(페이스북, 아마존, 애플, 넷플릭스, 구글)는 글로벌 규모의 사용자 데이터를 추출, 분석 및 활용하는 능력으로 행성상 가장 가치 있는 공개 회사 중 하나입니다.\n\n현재의 웹 2.0 모델에서, 우리는 보이는 것처럼 무료로 제공되는 서비스들 - 검색 엔진, 소셜 미디어, 클라우드 저장소 등에 익숙해져 왔습니다. 그러나 유명한 속담처럼 \"제품값을 지불하지 않으면, 넌 제품이 된다\"입니다. 우리의 주의력과 개인 데이터는 이 디지털 제국의 성장을 돕는 연료가 되어 왔습니다.\n\n개인 정보 침해 외에도, 다른 결과는 인터넷이 점점 더 통합되고 폐쇄된다는 것입니다. 이 거대 기업들은 사용자를 자사의 격리된 생태계에 가두어, 접근을 제한하고 신흥 경쟁사를 타파하기 위해 자신들만의 데이터 추출 사기를 확대시키는 동기부여되어 있습니다.\n\n<div class=\"content-ad\"></div>\n\n\"우리는 아주 오랫동안 이용 가능한 유일한 모델이었기 때문에, 이 중앙 집중식 모델에서 인류 문명의 매우 중요한 부분을 많이 재창조하고 있습니다,\" Venture Capital 회사 Andreessen Horowitz의 파트너인 Chris Dixon은 말합니다.\n\nWeb 3.0에서 목표는 현재의 인터넷 패러다임에서 소수의 승자들로부터 다시 제어권을 빼앗는 것입니다. 핵심 비즈니스 모델은 사용자 데이터와 주의를 수집하는 것에서 개별 사용자 간 직접적인 경제 교환이 중개업체가 수수료를 받지 않는 피어 투 피어 네트워크를 통해 발생하도록 전환됩니다.\n\nGoogle 드라이브에 개인 사진과 콘텐츠를 넣고 통제와 잠재적인 수익권을 내주는 대신, 단지 여러분만이 키를 가지고 있고 안전하고 분산된 방식으로 저장되는 세계를 상상해보십시오.\n\n그러면 액세스를 활용, 상업적 사용 라이선스를 부여하거나 제3자가 조건을 규제하지 않고 NFT 디지털 자산으로 파일을 판매할 수 있습니다. 이 모든 것은 자체 실행 코드와 블록체인을 통한 직접적인 사용자 간 거래로 구동됩니다.\"\n\n<div class=\"content-ad\"></div>\n\n유사한 프레임워크는 분산형 소셜 네트워크, 크리에이터 경제, 디지턈 세계, 그리고 모든 종류의 시장을 지배할 수 있습니다. 관리자가 없으면 사용자들은 더 자유롭게 연결하고, 경험과 디지턈 자산의 여러 측면을 더 많이 제어하며, 광고와 데이터 수집을 위한 인터넷의 확립된 플레이북을 넘어 새로운 경제 모델을 탐험할 수 있습니다.\n\n물론, 기존 인터넷 기업들에 대한 이런 맹렬한 비전은 적대적입니다. 이는 이들 회사들이 지난 20년 동안 고통스럽게 구축해 온 데이터 기반 제국들에 대한 존재적인 위협을 나타냅니다. 그래서 암호화폐, DeFi 및 웹 3.0의 등장은 현존하는 상황에 큰 투자를 한 마이크로소프트의 빌 게이츠 등과 같은 주요 참가자들로부터 큰 회의론을 촉발했습니다.\n\n하지만 어떠한 변혁적인 패러다임 변화도 이미 무기 요정이 병을 탈출한 상태일 수 있습니다. 블록체인과 암호 지갑의 핵심 혁신은 인터넷 상에서 데이터, 자산 및 가치의 디지턈 희귀성과 검증 가능한 소유권 개념을 해방했습니다. 플레이해서 수익을 올리는 게임이나 메타버스에서 자산 소유권에 훈련을 받은 젊은 세대들은 웹 3.0의 공개적이고 분산된 기초가 온라인 상호작용의 더 자연스러운 방식으로 생각할 수 있을 겁니다.\n\n새로운 기술이나 웹 3.0 또한 해결해야 할 합리적인 위험과 불확실성이 따릅니다. 초기 블록체인 실험으로부터 에너지 소비, 자금 세탁, 오라클 조작, 그리고 DAO 거버넌스 실패에 대한 우려가 모두 나왔습니다. 그리고 기존 규제 및 사회적 규범에 도전하는 새로운 분산형 \"와일드캣\" 애플리케이션이 나타날 것이라고 기대됩니다.\n\n<div class=\"content-ad\"></div>\n\n그러나 Web 3.0의 핵심 전제와 약속은 인터넷의 흥미로운 새로운 방향을 대표합니다. 여기서 사용자들이 어디에서나 더 열린, 투명하고 공정한 방식으로 디지털 생활과 경제를 다시 확보할 수 있는 곳입니다. 확실히 아직 확신을 얻지 못했지만, 이것은 인터넷의 진화의 다음 단계를 촉매하는 혁명적인 선도구역으로, 우리가 아는 현대의 데이터 군주들을 뒤집을 수도 있습니다.\n\nWeb 3.0이 최종적으로 우리의 세계에 미치는 영향을 정확히 알아야합니다. 그러나 한 가지 확실한 것은 인터넷의 영혼을 위한 전투가 방금 시작된 것입니다.","ogImage":{"url":"/assets/img/2024-06-20-HowThisNewEraoftheInternetWillChangetheWorld_0.png"},"coverImage":"/assets/img/2024-06-20-HowThisNewEraoftheInternetWillChangetheWorld_0.png","tag":["Tech"],"readingTime":5},{"title":"유튜브 뮤직이 실제로 얼마나 많은 데이터를 사용할까요","description":"","date":"2024-06-20 16:07","slug":"2024-06-20-HowMuchDataDoesYouTubeMusicReallyUse","content":"\n\n<img src=\"/assets/img/2024-06-20-HowMuchDataDoesYouTubeMusicReallyUse_0.png\" />\n\n인터넷을 통해 즐길 수 있는 스트리밍 서비스 중 일부는 집에서도 사용할 수 있지만 휴대폰에서도 이용할 수 있습니다. 하지만 모든 이용자에게 매달 사용할 수 있는 데이터 양에 한계가 있고, 이러한 요금제는 비용이 많이 들 수 있습니다. YouTube Music은 일부 휴대폰 모델과 스마트 TV에 포함된 인기 있는 서비스 중 하나입니다. 그래서 YouTube 음악 서비스는 얼마나 많은 데이터를 사용할까요?\n\nYouTube Music의 데이터 사용량은 스트림의 품질과 직접적으로 관려이 있습니다. 재생 중인 음악의 비트레이트가 한 시간 동안 얼마나 많은 데이터를 사용할지에 직접적으로 영향을 미칩니다.\n\n휴대폰 또는 가정 무선 요금제의 데이터 사용량을 살펴보면 일반적으로 기가바이트 또는 Gb의 형태로 제한됩니다. 각각 1000 메가바이트 또는 Mb에 1 기가바이트가 있습니다. 그렇다면 YouTube Music을 사용할 때 한 시간에 얼마만큼의 데이터가 사용될까요? 이는 앱의 오디오 또는 비디오 기능을 사용하는지에 따라 다릅니다. 사용 중인 서비스에 따라 대략적인 데이터 사용량과 계산 방법을 살펴봅시다.\n\n<div class=\"content-ad\"></div>\n\n# 오디오 데이터 속도 및 사용량\n\n데이터 속도는 오디오 및 비디오 파일이 인코딩되는 속도를 의미합니다. 이는 스트리밍되는 음악의 품질을 반영하며, 더 높은 데이터 속도는 더 높은 품질의 음악을 의미합니다. 더 높은 데이터 속도를 선택하면 더 많은 데이터를 사용하게 됩니다. 아래는 YouTube 애플리케이션의 오디오 부분에서 해당 데이터 속도로 사용되는 데이터 양을 대충 예상한 것입니다. 고품질 속도로 1Gb에 도달하려면 약 9시간이 걸립니다.\n\n![YouTube Music에서 실제로 사용하는 데이터 양](/assets/img/2024-06-20-HowMuchDataDoesYouTubeMusicReallyUse_1.png)\n\n속도 이외에도 데이터 사용량에는 다른 요소들이 영향을 줍니다. 비트 깊이, 코덱 및 파일 유형도 데이터 사용량에 영향을 미치는 요소입니다. 모든 스트리밍 서비스는 소비자들에게 음악이나 비디오를 제공하는 데 다른 파일과 유형을 사용합니다. 일부 서비스는 YouTube Music보다 더 높은 비트레이트로 오디오를 제공하며 더 많은 데이터를 소비할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 비디오 데이터 속도와 사용량\n\nYouTube Music에서 비디오를 재생하면 기기에서 사용되는 데이터 양이 크게 증가합니다. 오디오 서비스와 비디오 서비스를 동시에 사용하는 경우, 기기가 처리하기가 더 복잡하며 더 많은 데이터가 포함됩니다. 사용하는 데이터 양은 비디오 스트림에 선택한 픽셀 속도에 따라 달라질 것입니다. 선택한 픽셀 속도가 높을수록 비디오의 품질이 더 좋아집니다.\n\nYouTube는 비디오 품질을 표시하기 위해 초당 프레임(fps)를 사용하며, 초당 프레임이 더 높을수록 품질도 더 높습니다. YouTube는 시장에서 다른 스트리밍 비디오 서비스보다 훨씬 높은 fps를 사용합니다. 비디오 옵션을 선택한 경우 예상되는 데이터 사용량을 살펴보겠습니다.\n\n<div class=\"content-ad\"></div>\n\n# 유튜브 뮤직을 스트리밍할 때 유용한 팁\n\nYouTube Music 서비스가 얼마나 많은 데이터를 사용하는지 궁금하신가요? 매달 사용량에 대해 걱정되시는 분들도 있을 것입니다. 당신이 좋아하는 앱들을 여전히 즐기면서 데이터 사용량을 줄일 수 있는 팁이 몇 가지 있습니다.\n\n- WiFi에 연결하기 - 가능하다면 집이나 이동 중일 때도 무선 네트워크에 연결하세요. 많은 장소에는 무료 WiFi 핫스팟이 있어 연결할 수 있고, 외출 중일 때 해당 핫스팟을 찾아 사용하면 셀룰러 데이터 사용량에 대한 부담이 줄어듭니다. 집에 계신다면 휴대폰을 WiFi에 연결하세요. 집의 무선 요금제에서는 일반적으로 휴대폰보다 더 많은 데이터를 사용할 수 있습니다.\n- 백그라운드 프로세스 종료하기 - 핸드폰을 사용할 때 안드로이드와 아이폰 모두에서 다른 앱들의 백그라운드 프로세스를 막을 수 있습니다. 이렇게 하면 다른 앱에서의 데이터 사용을 줄일 수 있어 YouTube Music을 자유롭게 이용할 수 있습니다.\n- 셀룰러 데이터 비활성화 - 핸드폰의 대부분 앱을 거의 사용하지 않는 타입이라면, 해당 앱들의 셀룰러 연결을 비활성화하는 옵션이 있어 해당 앱들이 사용되지 않는 동안 데이터를 소모하지 않도록 할 수 있습니다.\n- 다른 앱 종료하기 - YouTube Music을 최상의 경험으로 즐기려면 다른 실행 중인 앱들을 종료해 랙이나 오디오 및 비디오 일시 중지에 문제가 없도록 해주세요.","ogImage":{"url":"/assets/img/2024-06-20-HowMuchDataDoesYouTubeMusicReallyUse_0.png"},"coverImage":"/assets/img/2024-06-20-HowMuchDataDoesYouTubeMusicReallyUse_0.png","tag":["Tech"],"readingTime":3},{"title":"제조 산업에 대한 디지털 변환은 무엇을 의미하는가  디지털 변환은 제조 산업에 끼친 영향이 크다 기술의 발전으로 제조업체들은 생산성을 높이고 비용을 절감하며 경쟁력을 강화할 수 있다 이를 통해 새로운 비즈니스 모델을 개발하고 고객 경험을 향상시킬 수 있다 디지털 변환을 통해 제조업체들은 혁신적인 방식으로 제품을 디자인, 생산 및 유통할 수 있게 되며 전반적으로 생산 과정을 최적화할 수 있다","description":"","date":"2024-06-20 16:06","slug":"2024-06-20-WhatdoesdigitaltransformationmeanfortheManufacturingindustry","content":"\n\n제작업계에 대한 디지턀 변화는 모든 제작 과정 영역에 고급 디지털 기술을 통합하여 기업이 운영하고 고객에게 가치를 전달하는 방식을 근본적으로 변화시키는 것을 의미합니다.\n\n이 섹터에서 디지털 변화의 주요 측면과 영향에 대해 알아보겠습니다:\n\n1. 자동화 및 로봇 기술\n\n<div class=\"content-ad\"></div>\n\n- 향상된 생산 효율성: 생산 프로세스를 최적화하기 위해 로보틱스 및 자동화 시스템을 활용하여 인적 실수를 줄이고 생산 속도를 높입니다.\n- 스마트 공장: 산업 4.0 원칙을 적용하여 기계 및 시스템이 연결되어 실시간 데이터 공유와 자율적 의사 결정이 가능하도록 합니다.\n\n2. 사물 인터넷 (IoT)\n\n- 연결된 장치: 사물 인터넷(IoT) 장치를 통합하여 제조장비를 원격으로 모니터링하고 제어합니다.\n- 예측적 유지보수: 센서와 데이터 분석을 활용하여 장비 고장을 예측하여 사전에 대비함으로써 다운타임과 유지보수 비용을 줄입니다.\n\n3. 빅 데이터와 분석\n\n<div class=\"content-ad\"></div>\n\n- 데이터 기반 의사 결정: 대규모 데이터 분석을 활용하여 생산 과정을 최적화하고 제품 품질을 향상시키며 폐기물을 줄입니다.\n- 실시간 모니터링: 생산 라인과 공급망의 지속적인 모니터링으로 비효율성 또는 문제를 신속히 식별하고 해결합니다.\n\n4. 인공 지능 (AI) 및 기계 학습\n\n- 향상된 품질 관리: 실시간 품질 검사와 결함 탐지를 위한 AI 기반 시스템.\n- 공정 최적화: 제조 데이터를 분석하고 공정 개선을 제안하는 기계 학습 알고리즘.\n\n5. 디지털 트윈스\n\n<div class=\"content-ad\"></div>\n\n- 가상 복제품: 제조 공정을 모의하고 최적화하기 위해 물리적 자산의 디지털 트윈을 만드는 것.\n- 수명 주기 관리: 디지털 트윈을 활용하여 제품의 디자인부터 생산, 유지보수 및 폐기까지 전 과정을 관리하는 것.\n\n6. 공급망 통합\n\n- 종단 간 투명성: 공급망 프로세스의 디지털 통합을 통해 실시간 가시성을 제공하고 공급 업체, 제조업체 및 유통업체 간의 협조를 개선하는 것.\n- 공급망 탄력성: 디지털 도구를 사용하여 공급망 탄력성을 향상시키고 장애에 신속히 대응할 수 있도록 하는 것.\n\n7. 부가 제조(3D 프린팅)\n\n<div class=\"content-ad\"></div>\n\n- 프로토타이핑 및 생산: 신속한 프로토타이핑을 위해 3D 프린팅 채택 및 복잡한 부품의 생산 요청에 대응\n- 맞춤화: 대규모 맞춤 제품 제공 능력으로 대규모 재고 필요를 줄임\n\n8. 클라우드 컴퓨팅\n\n- 확장 가능한 자원: 확장 가능한 컴퓨팅 자원, 데이터 저장 및 소프트웨어 응용프로그램을 위한 클라우드 기반 플랫폼 활용\n- 협업: 클라우드 기반 도구 및 서비스를 통해 서로 다른 위치 및 부서 간 강화된 협업\n\n9. 증강 현실(AR) 및 가상 현실(VR)\n\n<div class=\"content-ad\"></div>\n\n**10. 고객중심적 접근**\n\n- 맞춤 및 개인화: 고객 데이터와 선호도를 기반으로 한 더 맞춤화된 제품 및 서비스 제공.\n- 향상된 고객 경험: 디지털 채널을 통한 고객 상호작용 및 지원 개선.\n\n제조업에서 디지턈 변혁의 혜택\n\n<div class=\"content-ad\"></div>\n\n- 생산성 향상: 자동화 및 최적화로 인한 높은 생산성과 효율성\n- 비용 절감: 고도화된 프로세스, 예방 정비, 및 낭비 감소로 운영 비용 절감\n- 향상된 유연성: 시장 변화와 고객 요구에 빠르게 대응하는 능력\n- 제품 품질 향상: 실시간 모니터링 및 고급 분석을 통해 일관된 제품 품질 확보\n- 지속 가능성: 자원의 효율적 이용과 낭비 감소가 환경 지속가능성에 기여\n- 경쟁 우위: 최신 기술 도입과 지속적인 프로세스 개선을 통해 경쟁사를 앞서기\n\n제조업에서의 디지털 변혁은 단순히 새로운 기술을 도입하는 것뿐만이 아니라 지속적인 개선과 혁신을 위한 문화를 조성하는 것이다. 전통적인 프로세스를 재고하고, 의사 결정에 데이터를 활용하며, 궁극적으로 고객과 이해 관계자들에게 더 큰 가치를 전달하는 것을 포함한다.","ogImage":{"url":"/assets/img/2024-06-20-WhatdoesdigitaltransformationmeanfortheManufacturingindustry_0.png"},"coverImage":"/assets/img/2024-06-20-WhatdoesdigitaltransformationmeanfortheManufacturingindustry_0.png","tag":["Tech"],"readingTime":3},{"title":"51일차 OSI 모델 이해하기","description":"","date":"2024-06-20 16:03","slug":"2024-06-20-Day51UnderstandingtheOSIModel","content":"\n\n참고: 이 편집이 혼란스러웠습니다. 최종적으로 OSI 모델 안내서로 변경될 예정이니, 이 안내서를 개선하는 동안 조금만 기다려 주세요. 감사합니다!\n\n![OSI Model](/assets/img/2024-06-20-Day51UnderstandingtheOSIModel_0.png)\n\n# 물리 계층\n\n물리 계층은 통신 채널을 통해 원시 비트를 전송합니다. 이 계층은 한 쪽이 1 비트를 보내면 다른 쪽이 0 비트가 아니라 1 비트로 수신받을 수 있도록 해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n## 전형적인 설계 문제\n\n- 1과 0을 나타내는 데 사용해야 하는 전기 신호는 무엇인가요?\n- 비트가 얼마 동안 지속되는가, 데이터가 양방향으로 동시에 전송될 수 있는가\n- 초기 연결이 어떻게 설정되는가\n- 양쪽 모두 작업을 마치면 어떻게 연결을 해지하는가\n- 네트워크 커넥터가 몇 개의 핀을 갖고 있는지, 각 핀이 어떻게 사용되는가\n\n이러한 설계 문제는 주로 기계, 전기 및 타이밍 인터페이스, 물리적 전송 매체와 관련이 있으며 물리 계층 아래에 위치합니다.\n\n## 물리 계층 역할\n\n<div class=\"content-ad\"></div>\n\n- 통신 채널을 통해 물리적으로 전송될 수 있도록 신호를 한 형태에서 다른 형태로 변환하는 과정을 조절합니다.\n- 비트 단위로 전송\n- 데이터를 디지털 통신에 최적화된 하드웨어 장치로 전송할 수 있게 해주는 라인 코딩\n- 동기식 직렬 통신용 비트 동기화\n- 비동기식 직렬 통신에서의 스타트-스탑 신호 및 흐름 제어\n- 다중화된 디지털 신호의 회로 전환 및 다중화 하드웨어 제어\n- 물리적 층에서 무정상 패킷들에 의해 발생하는 혼잡 문제를 피하기 위해 캐리어 감지 및 충돌 탐지\n- 신호 균등화를 통해 안정적인 연결 보장 및 다중화 용이성 제공\n- 오류 정정 코드와 같은 전진 오류 수정/채널 부호화\n- 오류 정정을 개선하기 위한 비트 인터리빙\n- 자동 협상\n- 전송 모드 제어\n\n## 물리적 층을 사용하는 예제 프로토콜\n\n- 디지털 가입자회선\n- 통합 서비스 디지털 네트워크\n- 적외선 데이터 협회\n- 유니버설 직렬 버스\n- 블루투스\n- 컨트롤러 에어리어 네트워크\n- 이더넷\n\n# 데이터 링크 층\n\n<div class=\"content-ad\"></div>\n\n데이터 링크 계층의 주요 역할은 원시 전송 설비를 감지되지 않는 전송 오류가 없는 것처럼 보이는 라인으로 변환하는 것입니다. 이를 위해 실제 오류를 가리고 네트워크 계층이 그것들을 보지 못하도록 합니다. 이 작업은 송신자가 입력 데이터를 데이터 프레임(일반적으로 몇 백 또는 몇 천 바이트)으로 분할하고 프레임을 순차적으로 전송하는 방식으로 수행됩니다. 서비스가 신뢰할 수 있다면, 수신자는 각 프레임의 정상 수신을 확인하기 위해 승인 프레임을 다시 보내 확인합니다. 데이터 링크 계층에서 발생하는 다른 문제 중 하나(또한 대부분의 상위 계층에서도)는 빠른 송신자가 느린 수신자를 데이터로 물에 잠기게 막는 방법입니다. 송신자가 수신자가 더 많은 데이터를 수용할 수 있는 시점을 알 수 있도록 하는 교통 조절 메커니즘이 필요할 수 있습니다. 방송 네트워크에는 데이터 링크 계층에서 추가 문제가 있습니다: 공유 채널에 대한 액세스 제어 방법은 무엇인가요. 데이터 링크 계층의 특별한 하위 계층 인 매체 액세스 제어 하위 계층은 이러한 문제를 다룹니다.\n\n데이터 링크 계층의 첫 번째 하위 계층은 미디어 액세스 제어(MAC) 계층입니다. 소스 및 목적지 주소에 사용됩니다. MAC 계층은 데이터 링크 계층이 최상의 데이터 전송 수단을 제공하고 데이터 흐름 제어를 관리할 수 있게 합니다.\n\n데이터 링크 계층의 두 번째 하위 계층은 논리적 링크 제어입니다. 네트워크에서 오류 검사와 데이터 흐름을 관리합니다.\n\n## 데이터 링크 계층 업무\n\n<div class=\"content-ad\"></div>\n\n- 비트 전송 오류로 발생하는 문제를 처리합니다.\n- 발신 및 수신 장치가 과도한 속도로 데이터가 흐르는 것을 방지합니다.\n- 데이터를 계층 3인 네트워크 계층으로 전송하여 주소를 부여하고 라우팅할 수 있게 합니다.\n\n## 데이터 링크 계층 — 물리 주소 할당\n\n물리 주소 할당은 네트워크 주소 할당과 다릅니다. 네트워크 주소는 네트워크의 노드 또는 장치를 구분하여 트래픽을 네트워크를 통해 경유하거나 스위칭할 수 있게 합니다. 반면 물리 주소 할당은 링크 계층 수준에서 장치를 식별하여 동일한 물리 매체 상의 개별 장치를 구분합니다. 물리 주소할당의 주요 형태는 미디어 액세스 제어(MAC) 주소입니다.\n\n## 데이터 링크 계층 — 네트워크 토폴로지\n\n<div class=\"content-ad\"></div>\n\n네트워크 토폴로지 사양은 네트워크에서 기기가 어떻게 연결되는지를 나타냅니다. 일부 매체는 버스 토폴로지로 기기를 연결할 수 있지만, 다른 것들은 링 토폴로지를 요구합니다. 버스 토폴로지는 Juniper Networks 기기에서 지원되는 Ethernet 기술에서 사용됩니다.\n\n## 데이터 링크 계층 — 에러 통지\n\n데이터 링크 계층은 물리적 링크에서 에러가 발생했음을 상위 계층 프로토콜에 경고하는 에러 통지를 제공합니다. 링크 수준의 에러 예시로는 신호 손실, 시리얼 연결에서 클로킹 신호 손실, 또는 T1 또는 T3 링크에서 원격 단점 손실 등이 있습니다.\n\n## 데이터 링크 계층 — 프레임 시퀀싱\n\n<div class=\"content-ad\"></div>\n\n데이터 링크 계층의 프레임 순차화 기능을 통해 전송 중에 순서가 바뀐 프레임을 수신 측에서 재정렬할 수 있습니다. 패킷의 무결성은 Layer 2 헤더의 비트를 통해 확인할 수 있으며, 이 헤더는 데이터 페이로드와 함께 전송됩니다.\n\n## 데이터 링크 계층 - 흐름 제어\n\n데이터 링크 계층 내에서의 흐름 제어는 링크 상의 수신 장치가 혼잡을 감지하고 상위 및 하위 이웃에게 알리도록 허용합니다. 이웃 장치는 이러한 혼잡 정보를 자신들의 상위 계층 프로토콜로 전달하여 데이터 흐름이 조정되거나 다시 경로 지정될 수 있도록 합니다.\n\n## 데이터 링크 계층 - 데이터 링크 서브계층\n\n<div class=\"content-ad\"></div>\n\n데이터 링크 계층은 두 개의 하위 계층인 논리 링크 제어(LLC)와 미디어 액세스 제어(MAC)로 나뉩니다. LLC 하위 계층은 네트워크의 단일 링크 상에서 장치 간 통신을 관리합니다. 이 하위 계층은 링크 계층 프레임의 필드를 지원하여 여러 상위 계층 프로토콜이 단일 물리 링크를 공유할 수 있게 합니다.\n\nMAC 하위 계층은 프로토콜이 물리 네트워크 매체에 액세스하는 것을 관리합니다. 일반적으로 장치의 모든 포트에 할당된 MAC 주소를 통해, 같은 물리 링크 상의 여러 장치가 데이터 링크 계층에서 서로를 고유하게 식별할 수 있습니다. MAC 주소는 네트워크 내 포트에 수동으로 설정된 네트워크 주소에 추가로 사용됩니다.\n\n## 데이터 링크 계층 — MAC 주소 할당\n\nMAC 주소는 장치 어댑터에 영구적으로 저장된 일련 번호로, 장치를 고유하게 식별합니다. MAC 주소는 데이터 링크 계층에서 작동하며, IP 주소는 네트워크 계층에서 작동합니다. 장치의 IP 주소는 네트워크 내에서 이동하면서 서로 다른 IP 서브넷으로 변경될 수 있지만, MAC 주소는 장치에 물리적으로 연결되어 있기 때문에 변하지 않습니다.\n\n<div class=\"content-ad\"></div>\n\nIP 네트워크 내에서 장치들은 주소 확인 프로토콜(ARP)을 통해 각 MAC 주소를 해당 구성된 IP 주소와 일치시킵니다. ARP는 네트워크의 각 MAC 주소에 대한 매핑을 유지하는 테이블을 가지고 있습니다.\n\n대부분의 Layer 2 네트워크는 MAC-48, EUI-48(확장된 고유 식별자), EUI-64 중 하나의 기본 번호 공간을 사용합니다. 이들은 모두 전 세계적으로 고유합니다. MAC-48 및 EUI-48 공간은 각각 48비트 주소를 사용하고, EUI-64 공간은 64비트 주소를 사용하지만, 세 가지 모두 동일한 번호 매기기 형식을 사용합니다. MAC-48 주소는 네트워크 하드웨어를 식별하고, EUI-48 주소는 다른 장치 및 소프트웨어를 식별합니다.\n\n장치에서 지원하는 이더넷과 ATM 기술은 MAC-48 주소 공간을 사용합니다. IPv6는 EUI-64 주소 공간을 사용합니다.\n\nMAC-48 주소는 대부분의 네트워크에서 가장 일반적으로 사용되는 MAC 주소입니다. 이들 주소는 일반적으로 다음과 같은 형식 중 하나로 보이며, 12자리 16진수 숫자(길이가 48비트)입니다:\n\n<div class=\"content-ad\"></div>\n\n- MM:MM:MM:SS:SS:SS\n- MM-MM-MM-SS-SS-SS\n\n첫 세 옥텟(MM:MM:MM 또는 MM-MM-MM)은 하드웨어 제조업체의 ID 번호입니다. 제조업체 ID 번호는 전기전자기술자협회(IEEE)에서 할당합니다. 마지막 세 옥텟(SS:SS:SS 또는 SS-SS-SS)는 장치의 일련번호를 이룹니다. 해당 번호는 제조업체가 할당합니다. 예를 들어, 이더넷 인터페이스 카드의 MAC 주소는 00:05:85:c1:a6:a0일 수 있습니다.\n\n## 링크 계층 프로토콜\n\nTCP/IP 모델의 링크 계층은 호스트가 연결된 로컬 네트워크 세그먼트(링크)에서만 작동하는 네트워킹 프로토콜의 서술적 영역입니다. 이러한 프로토콜 패킷은 다른 네트워크로 라우팅되지 않습니다. 링크 계층에는 로컬(링크에서) 네트워크 노드 간 통신을 정의하는 프로토콜이 포함됩니다. 이들은 일반적으로 링크 유형에 특정한 패킷 형식 지정을 기반으로 하는 프로토콜들을 사용하여 로컬 노드 간의 링크 상태를 유지하는 목적을 달성합니다.\n\n<div class=\"content-ad\"></div>\n\n인터넷 공학 작업군(IETF)이 정의한 핵심 프로토콜은 이 계층에서 사용됩니다. 주소 해상도 프로토콜(ARP), 역 주소 해상도 프로토콜(RARP), 이더넷 인접 디스커버리 프로토콜(NDP) 등이 있습니다. NDP는 IPv6를 위한 ARP와 유사한 기능을 제공합니다. IPv6가 등장한 이후에는 Open Shortest Path First (OSPF)도 동작하는 것으로 간주되며, 이전에는 IPv4 버전의 프로토콜이 인터넷 계층에서 고려되었습니다. \n\nIS-IS (RFC 1142)는 이 계층에 맞는 다른 링크 상태 라우팅 프로토콜이지만 TCP/IP 모델에서는 고려되지만 OSI 참조 스택 내에서 개발되었으며, Layer 2 프로토콜로 분류됩니다. 인터넷 표준이 아닙니다.\n\n# 네트워크 계층\n\n네트워크 계층은 서브넷의 작동을 제어합니다. 주요한 설계 문제 중 하나는 패킷을 출발지에서 목적지로 어떻게 라우팅할지 결정하는 것입니다. 경로는 네트워크에 '고정된' 정적 테이블을 기반으로 할 수도 있으며, 자동으로 업데이트되어 고장 부품을 피할 수 있습니다. 또한 각 대화의 시작 시에, 예를 들어 원격 컴퓨터에 로그인하는 터미널 세션에서, 결정될 수도 있습니다. 마지막으로 매우 동적일 수 있으며, 각 패킷마다 새롭게 결정되어 현재 네트워크 부하를 반영할 수 있습니다. 서브넷에 동시에 많은 패킷이 존재하면 서로 방해하여 병목 현상을 일으킵니다. 혼잡을 처리하는 것도 네트워크 계층의 책임 중 하나이며, 네트워크에 적재하는 부하를 조절하는 상위 계층과 협력합니다. 더 일반적으로 제공되는 서비스 품질(지연, 전송 시간, 지터 등)도 네트워크 계층의 문제입니다. 패킷이 목적지에 도달하기 위해 두 네트워크 사이에서 이동해야 하는 경우 다양한 문제가 발생할 수 있습니다. 두 번째 네트워크에서 사용하는 주소지정이 첫 번째 네트워크에서 사용하는 것과 다를 수 있습니다. 두 번째 네트워크가 패킷을 수용하지 않을 수도 있습니다. 프로토콜이 다를 수 있습니다 등등. 모든 이 문제들을 극복하여 이질적인 네트워크를 연결할 수 있도록 하는 것은 다 네트워크 계층에 달려 있습니다. 방송 네트워크에서는 라우팅 문제가 간단하기 때문에 네트워크 계층이 얇거나 없을 수도 있습니다.\n\n<div class=\"content-ad\"></div>\n\n네트워크 계층은 오픈 시스템 상호연결 모델(OSI 모델)의 세 번째 수준으로, 네트워크 통신을 위한 데이터 라우팅 경로를 제공하는 계층입니다. 데이터는 논리적 네트워크 경로를 통해 패킷 형식으로 전송되며, 네트워크 계층에 의해 제어된 순서화된 형식으로 전달됩니다.\n\n논리적 연결 설정, 데이터 포워딩, 라우팅 및 전달 오류 보고는 네트워크 계층의 주요 책임입니다.\n\n## 네트워크 계층에서 사용되는 예시 프로토콜\n\n네트워크 프로토콜은 \"링크 서비스\"라고 불리는 것을 제공합니다. 이러한 프로토콜은 주소 지정 및 경로 정보 처리, 오류 검사, 재전송 요청 등을 다룹니다. 네트워크 프로토콜은 또한 Ethernet이나 Token Ring과 같은 특정 네트워킹 환경에서 통신하기 위한 규칙을 정의합니다.\n\n<div class=\"content-ad\"></div>\n\nIP - 인터넷 프로토콜의 약자로, OSI 네트워크 계층에서 동작하며 레이어 3 패킷을 전달하는 라우팅 프로토콜입니다.\n\nIPX - NetWare의 패킷 전달 및 라우팅을 위한 프로토콜입니다.\n\n# 전송 계층\n\n전송 계층의 기본 기능은 상위에서 데이터를 받아 이를 필요에 따라 작은 단위로 분할하고 이를 네트워크 계층으로 전달하여 다른 쪽에서 모든 조각들이 정확하게 도착하도록 하는 것입니다. 더불어, 모든 작업은 효율적으로 처리되어야 하며 시간이 흐름에 따른 하드웨어 기술의 변화로 인한 상위 계층의 격리도 보장되어야 합니다. 전송 계층은 또한 세션 계층 및 네트워크 사용자에게 제공할 서비스 유형을 결정합니다. 가장 인기 있는 전송 연결 유형은 메시지나 바이트를 보낸 순서대로 전달하는 오류가 없는 point-to-point 채널입니다. 그러나 다른 종류의 전송 서비스도 가능합니다. 예를 들어, 메시지의 순서 전달을 보장하지 않는 독립적인 메시지 전송 및 다중 목적지로 메시지를 브로드캐스트하는 것이 있습니다. 서비스 유형은 연결 설정 시 결정됩니다. (참고로 오류 없는 채널은 완벽하게 달성할 수 없습니다. 이 용어가 실제로 의미하는 것은 실제 실무에서 무시할 수 있을 만큼 오류가 낮다는 것입니다.) 전송 계층은 소스로부터 대상까지 데이터를 전달하는 true end-to-end 계층입니다. 다시 말해, 소스 머신의 프로그램은 메시지 헤더와 제어 메시지를 사용하여 대상 머신의 유사한 프로그램과 대화를 수행합니다. 하위 계층에서 각 프로토콜은 머신과 그 즉각적인 이웃 사이에 있으며 궁극적으로 소스와 대상 머신 사이에 있는 여러 라우터로 분리되어 있는 것이 아닙니다.\n\n<div class=\"content-ad\"></div>\n\n## 서비스\n\n운송 계층 서비스는 운송 계층 프로토콜을 통한 응용 프로그램에 전달됩니다. 이 서비스에는 다음과 같은 기능이 포함될 수 있습니다:\n\n- 연결 지향 통신: 일반적으로 연결을 데이터 스트림으로 해석하는 것이 더 쉬우며, 사용자 데이터그램 프로토콜(UDP) 및 인터넷 프로토콜(IP)의 연결 없는 모델과 같은 하위 연결을 다루는 것보다 낫습니다.\n- 동일한 순서 전달: 네트워크 계층은 일반적으로 데이터 패킷이 전송된 순서대로 도착하는 것을 보장하지 않지만, 이는 종종 바람직한 기능입니다. 이는 수신기가 세그먼트 번호를 사용하여 그것들을 순서대로 응용 프로그램에 전달함으로써 보통 이루어집니다. 이것은 head-of-line blocking을 발생시킬 수 있습니다.\n- 신뢰성: 네트워크 혼잡 및 오류로 인해 전송 중 데이터 패킷이 손실될 수 있습니다. 오류 감지 코드(예: 체크섬)를 통해 전송 프로토콜은 데이터가 손상되지 않았는지 확인하고 수신기가 올바르게 수신했는지 확인하기 위해 ACK 또는 NACK 메시지를 보내주어 송신자에게 전송할 수 있습니다. 손실된 또는 손상된 데이터를 재전송하는 데 사용될 수 있는 자동 반복 요청 체계를 사용할 수 있습니다.\n- 흐름 제어: 두 노드 간의 데이터 전송 속도는 때로는 관리되어야 합니다. 이는 빠른 송신자가 수신 데이터 버퍼가 지원할 수 있는 데이터보다 많이 전송하지 못하도록 하여 버퍼 오버런을 방지하기 위함입니다. 이것은 버퍼 언더런을 줄이는 데도 사용될 수 있습니다.\n- 혼잡 회피: 혼잡 제어는 통신망에 트래픽 진입을 제어하여 중간 노드 및 네트워크의 처리 또는 링크 기능의 과부하를 피하려고 시도함으로써 혼잡 붕괴를 방지할 수 있습니다. 자원을 줄이는 조치로는 데이터 전송 속도를 줄이고 패킷을 보내는 속도를 줄이는 것과 같은 조치가 있습니다. 예를 들어, 자동 반복 요청은 네트워크를 혼잡 상태로 유지할 수 있습니다. 이러한 상황은 혼잡 회피를 포함한 흐름 제어에 혼잡 회피를 추가함으로써 피할 수 있습니다. 이는 전송의 처음이나 패킷 재전송 후에 대역폭 소모를 낮은 수준으로 유지합니다.\n- 다중화: 포트는 단일 노드의 여러 끝점을 제공할 수 있습니다. 예를 들어, 우편 주소의 이름은 다중화의 한 종류이며 동일 장소의 다른 수신자를 구별합니다. 컴퓨터 응용 프로그램은 각각 자신의 포트에서 정보를 청취하여 동시에 여러 네트워크 서비스를 사용할 수 있도록 합니다. 이것은 TCP/IP 모델의 전송 계층의 일부이지만 OSI 모델의 세션 계층의 일부입니다.\n\n## 운송 계층 프로토콜\n\n<div class=\"content-ad\"></div>\n\n이 목록은 인터넷 프로토콜 스위트, OSI 프로토콜 스위트, NetWare의 IPX/SPX, AppleTalk 및 광섬유 채널의 전송 계층에 일반적으로 배치되는 일부 프로토콜을 보여줍니다.\n\n- ATP, AppleTalk 트랜잭션 프로토콜\n- CUDP, 주기 UDP\n- DCCP, 데이터그램 혼잡 제어 프로토콜\n- FCP, 광섬유 채널 프로토콜\n- IL, IL 프로토콜\n- MPTCP, 다중 경로 TCP\n- RDP, 신뢰할 수 있는 데이터 프로토콜\n- RUDP, 신뢰할 수 있는 사용자 데이터그램 프로토콜\n- SCTP, 스트림 제어 전송 프로토콜\n- SPX, 순차 패킷 교환\n- SST, 구조화된 스트림 전송\n- TCP, 전송 제어 프로토콜\n- UDP, 사용자 데이터그램 프로토콜\n- UDP-Lite\n- µTP, 미니 전송 프로토콜\n\n![이미지](/assets/img/2024-06-20-Day51UnderstandingtheOSIModel_1.png)\n\n# 세션 계층\n\n<div class=\"content-ad\"></div>\n\n세션 계층은 서로 다른 기계에서 사용자들이 세션을 설정할 수 있게 합니다. 세션은 대화 제어(누가 전송할 차례인지 추적), 토큰 관리(두 당사자가 동시에 중요한 작업을 시도하는 것을 방지), 및 동기화(장애 및 후속 복구 사건에서 장기 전송을 체크포인트 처리하여 이전 위치에서 다시 시작할 수 있도록 함)과 같은 다양한 서비스를 제공합니다.\n\n## 세션 계층 프로토콜\n\n- ADSP, AppleTalk 데이터 스트림 프로토콜\n- ASP, AppleTalk 세션 프로토콜\n- H.245, 멀티미디어 통신용 호출 제어 프로토콜\n- ISO-SP, OSI 세션 계층 프로토콜 (X.225, ISO 8327)\n- iSNS, 인터넷 저장소 이름 서비스\n- L2F, 레이어 2 전달 프로토콜\n- L2TP, 레이어 2 터널링 프로토콜\n- NetBIOS, 네트워크 베이직 입력 출력 시스템\n- PAP, 암호 인증 프로토콜\n- PPTP, 포인트 투 포인트 터널링 프로토콜\n- RPC, 원격 프로시저 호출 프로토콜\n- RTCP, 실시간 전송 제어 프로토콜\n- SMPP, 단문 통신 피어-투-피어\n- SCP, 세션 제어 프로토콜\n- SOCKS, SOCKS 인터넷 프로토콜, 인터넷 소켓 참조\n- ZIP, 존 정보 프로토콜\n- SDP, 소켓 다이렉트 프로토콜\n\n# 표현 계층\n\n<div class=\"content-ad\"></div>\n\n하위 계층이 주로 비트를 이동하는 데 관심을 두는 반면, 프리젠테이션 계층은 전송된 정보의 구문과 의미에 관심을 가집니다. 내부 데이터 표현이 다른 컴퓨터가 통신할 수 있도록 하기 위해, 교환할 데이터 구조는 추상적으로 정의될 수 있으며, '와이어 상에서' 사용될 표준 인코딩과 함께 정의될 수 있습니다. 프리젠테이션 계층은 이러한 추상적인 데이터 구조를 관리하고 더 높은 수준의 데이터 구조(예: 은행 기록)를 정의하고 교환할 수 있게 합니다.\n\n## 서비스\n\n- 데이터 변환[2]\n- 문자 코드 변환[2]\n- 압축[2]\n- 암호화 및 복호화[2]\n\n# 애플리케이션 계층\n\n<div class=\"content-ad\"></div>\n\n응용 계층에는 사용자가 흔히 필요로 하는 다양한 프로토콜이 포함되어 있어요. 널리 사용되는 응용 프로토콜 중 하나는 웹의 기초인 HTTP(HyperText Transfer Protocol)입니다. 브라우저가 웹 페이지를 원할 때, HTTP를 사용하여 해당 페이지의 이름을 호스팅 서버로 보내요. 서버는 그런 다음 페이지를 다시 보내주죠. 파일 전송, 전자 메일, 네트워크 뉴스에 대해 다른 응용 프로토콜을 사용하기도 해요.\n\n## 프로토콜 목록\n\n- 9P, Plan 9 from Bell Labs 분산 파일 시스템 프로토콜\n- AFP, Apple Filing Protocol\n- APPC, 고급 프로그램 간 통신\n- AMQP, 고급 메시지 큐잉 프로토콜\n- Atom Publishing Protocol\n- BEEP, 블록 확장 교환 프로토콜\n- Bitcoin\n- BitTorrent\n- CFDP, 일관된 파일 분배 프로토콜\n- CoAP, 제한된 애플리케이션 프로토콜\n- DDS, 데이터 분배 서비스\n- DeviceNet\n- eDonkey\n- ENRP, 엔드포인트 핸들 공간 중복 프로토콜\n- FastTrack (KaZaa, Grokster, iMesh)\n- Finger, 사용자 정보 프로토콜\n- Freenet\n- FTAM, 파일 전송 액세스 및 관리\n- Gopher, 고퍼 프로토콜\n- HL7, 헬스 레벨 세븐\n- HTTP, 하이퍼텍스트 전송 프로토콜\n- H.323, 패킷 기반 멀티미디어 통신 시스템\n- IMAP, 인터넷 메시지 액세스 프로토콜\n- IRCP, 인터넷 릴레이 채팅 프로토콜\n- IPFS, 인터플래닛 파일 시스템\n- Kademlia\n- LDAP, 경량 디렉터리 액세스 프로토콜\n- LPD, 라인 프린터 데몬 프로토콜\n- MIME (S-MIME), 다목적 인터넷 메일 확장 및 안전한 MIME\n- Modbus\n- MQTT 프로토콜\n- Netconf\n- NFS, 네트워크 파일 시스템\n- NIS, 네트워크 정보 서비스\n- NNTP, 네트워크 뉴스 전송 프로토콜\n- NTCIP, 교통 첨단 교통 시스템 프로토콜\n- NTP, 네트워크 시간 프로토콜\n- OSCAR, AOL 인스턴트 메신저 프로토콜\n- POP, 포스트 오피스 프로토콜\n- PNRP, 피어 이름 해결 프로토콜\n- RDP, 원격 데스크톱 프로토콜\n- RELP, 신뢰할 수 있는 이벤트 로깅 프로토콜\n- Rlogin, UNIX 시스템의 원격 로그인\n- RPC, 원격 프로시저 호출\n- RTMP, 실시간 메시지 프로토콜\n- RTP, 실시간 전송 프로토콜\n- RTPS, 실시간 게시 구독\n- RTSP, 실시간 스트리밍 프로토콜\n- SAP, 세션 공지 프로토콜\n- SDP, 세션 설명 프로토콜\n- SIP, 세션 시작 프로토콜\n- SLP, 서비스 위치 프로토콜\n- SMB, 서버 메시지 블록\n- SMTP, 간단한 메일 전송 프로토콜\n- SNTP, 간단한 네트워크 시간 프로토콜\n- SSH, 보안 셸\n- SSMS, 안전한 SMS 메시징 프로토콜\n- TCAP, 트랜잭션 기능 응용 부분\n- TDS, 표 형태의 데이터 스트림\n- Tor (익명성 네트워크)\n- Tox\n- TSP, 타임 스탬프 프로토콜\n- VTP, 가상 터미널 프로토콜\n- Whois (및 RWhois), 원격 디렉터리 액세스 프로토콜\n- WebDAV\n- X.400, 메시지 처리 서비스 프로토콜\n- X.500, 디렉터리 액세스 프로토콜 (DAP)\n- XMPP, 확장 가능한 메시징 및 존재 프로토콜\n\n주요 출처:","ogImage":{"url":"/assets/img/2024-06-20-Day51UnderstandingtheOSIModel_0.png"},"coverImage":"/assets/img/2024-06-20-Day51UnderstandingtheOSIModel_0.png","tag":["Tech"],"readingTime":12}],"page":"53","totalPageCount":113,"totalPageGroupCount":6,"lastPageGroup":20,"currentPageGroup":2},"__N_SSG":true}