{"pageProps":{"posts":[{"title":"데이터 스토리텔링이 당신의 새로운 슈퍼파워인 이유","description":"","date":"2024-06-20 14:59","slug":"2024-06-20-WhyDataStorytellingisYourNewSuperpower","content":"\n\n![이미지](/assets/img/2024-06-20-WhyDataStorytellingisYourNewSuperpower_0.png)\n\n데이터 스토리텔링은 가능한 한 넓은 관객 대상으로 데이터 세트를 이해할 수 있는 이야기 형식으로 변환합니다.\n\n현재 사용 가능한 고급 데이터 분석 도구의 보급으로 누구나 데이터 세트를 가져와서 시각적 그래프로 나타낼 수 있습니다.\n\n그러나 데이터와 효과적으로 소통하는 방법을 학습하지 못하는 현대 교육 방법에 따르면, 데이터와 함께 이야기를 만드는 학습자들에게 가르치는 것은 없다고 Storytelling with Data의 저자이자 전문가인 Cole Nussbaumer-Knaflic이 말합니다.\n\n<div class=\"content-ad\"></div>\n\n우리 중 많은 사람들이 숫자와 언어에 대해 형식 교육을 수 년 동안 받지만, 이를 결합하여 우리 언어 기술을 사용하여 숫자 세트에 대한 이야기를 전하는 방식은 거의 없습니다.\n\n우리 인간은 자연스러운 이야기꾼이지만, 데이터에 대한 이야기를 전하는 것에는 자연스럽지 않습니다.\n\n결과는 제대로 설명되지 않고 혼란스러운 차트와 그래프들로 가득합니다.\n\n더 잘할 수 있는 방법은 무엇일까요? 우리는 숫자를 이야기와 결합하는 방법을 이해하는 것부터 시작할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 우리에게는 다양한 사고 방식이 있습니다\n\n현대 교육의 격차가 존재하지만, 우리의 두뇌는 양적(무엇, 얼마나)과 질적(왜, 어떻게) 사고를 할 수 있도록 진화했습니다.\n\n현대 교육은 종종 양적 데이터를 서술과 결합하는 데 실패하지만, 다양한 문화적 접근법은 그것을 하는 가치를 상기시킵니다.\n\n컴퓨터 과학, 토착 지식, 교육의 교차로에서의 제 박사 연구 동안, 저는 다양한 문화가 의사 결정을 위해 양적과 질적 사고를 어떻게 통합하는지 연구했습니다. 데이터와 서술의 혼합은 효과적인 데이터 스토리텔링을 보여주며, 다양한 사고 방식을 결합하는 모델을 제시합니다.\n\n<div class=\"content-ad\"></div>\n\n강력한 숫자는 우리가 절대적으로 다룰 때 잘 작동합니다. 이것들은 데이터 집합에 대한 정적이고 추상적인 관점을 제공합니다. 그러나 이는 흔히 추상적인 것들과 거의 다루지 않는 사람들의 현실로의 전환이 항상 이루어지지는 않습니다.\n\n예를 들어 원주민 어부는 많은 다양한 입력 값들의 근사치에 기반하여 어떻게, 어디서, 무엇을 어떻게 낚아야 하는지 결정할 것입니다.\n\n날씨, 온도, 물 깊이, 연간 시기 및 이러한 변수들에 기반한 과거 결과에 대한 내부 지식 등을 고려합니다. 적응적 사고가 필수적입니다. 어제의 데이터는 오늘 내려야 할 결정과 아무런 관련이 없을 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n베르켓과 그랜트(2007)의 연구에 따르면, 그레나다 어부들의 질적 사고는 의사 결정에 있어 적응적이고 실시간 질적 사고의 실용성을 강조합니다. 사실, 많은 지방주민들은 서구 과학자가 모든 것을 극도로 상세하게 양적화해야 한다는 필요성에 당혹스러워합니다. 이 서구적 방법론은 종종 데이터의 서로 다른 조각들 간의 근본적인 관계를 놓치곤 합니다.\n\n지식체계는 이야기를 통해 복잡한 환경 데이터를 해석하는 인간의 본능적 능력을 보여줍니다. 이 접근법은 데이터 이야기의 본질을 반영하는 것으로, 질적 인사이트와 양적 데이터를 결합함으로써 우리의 지식의 깊이와 폭을 향상시킵니다.\n\n현대적인 방법은 이러한 지식이 어떻게 수집, 보급 및 관련되는지를 개선했지만, 서로 다른 문화들이 지식 전파에 접근하는 방식은 고려되어야 합니다. 많은 사람들에게는 이것이 전통적으로 실용적인 질적 방법이었습니다.\n\n다양한 사고 방식을 통합하는 것을 이해하는 것은, 전통적인 방법과 현대적인 필요가 교차하는 양적 이야기의 도전에 직면할 수 있도록 준비시켜줍니다.\n\n<div class=\"content-ad\"></div>\n\n# 양적 이야기의 도전\n\n전통적으로, 질적 사고(즉, 이야기)를 사용하고 근사치를 적용하여 결과(특정 조건 하에서 잡힌 물고기 수)를 달성하는 데 사용했습니다.\n\n이 지식은 다음 세대의 어부들에게 전수되었습니다. 이것이 대부분의 원주민 지식이 시간이 흘러도 유지되던 방식입니다 — 종종 문서화된 언어의 대신.\n\n이 전통은 가치에 이야기를 부착하려는 자연인의 성향을 강조하는데, 이는 현대 교육에서 충분히 적용되지 않아 데이터 시각화가 이야기 요소를 간과하는 결과를 낳게 됩니다.\n\n<div class=\"content-ad\"></div>\n\n우리 많은 사람들은 가치에 이야기를 첨부하기 위해 선천적으로 프로그래밍되어 있습니다. 그러나 많은 학교 시스템은 이를 결합하지 않습니다. 따라서 많은 데이터 시각화에 이야기가 포함되지 않습니다 — 그런데 그것들이 포함되어야 합니다.\n\n데이터 시각화의 선구자인 에드워드 터프트는 자신의 고전적인 서적인 \"양적 정보의 시각적 표현\"에서 \"단어와 그림은 함께 속한다\"고 언급합니다. 그는 또한 두 가지의 분리가 \"희소한 공간\"을 위해 오랜 논쟁을 벌인 예술가와 작가들의 결과라고 언급했습니다.\n\n데이터의 풍부함에 접근할 수 있는 설명은 그래픽을 시청자에게 더 잘 전달할 수 있게 만듭니다.\n\n# 복잡성을 접근하기 쉽게 만드는 것\n\n<div class=\"content-ad\"></div>\n\n시청자들은 종종 단어가 제공하는 지원이 필요합니다. 그 반대로, 많은 시청자는 단어와 숫자를 설명하는 그래픽을 필요로 합니다.\n\n데이터 스토리텔링은 이러한 영역 사이의 다리 역할을 합니다. 시각화를 통해 효과적으로 생각하는 우리에게는 차트나 그래프가 명확히 설명해 줄 수 있습니다.\n\n시각화를 해석할 수 없는 우리에게는 캡션과 주석을 통한 텍스트 통합이 공백을 메울 수 있습니다.\n\n간단한 예시를 보겠습니다.\n\n<div class=\"content-ad\"></div>\n\n## CO₂ 당 인구당 배출량의 글로벌 트렌드:\n\n지구 온난화는 뜨거운 이슈이며, 과학적으로는 시간이 흐름에 따라 전 세계적인 CO₂ 배출량이 증가함과 연결되어 있습니다.\n\n이러한 트렌드를 선 그래프로 시각화하면, 전 세계적인 배출량이 전반적으로 상승하는 방향을 더욱 쉽게 파악할 수 있습니다 — 1830년대 이후로 명확히 상승세를 유지하고 있습니다. 이를 어떻게 질적 사고를 가진 사람들에게 효과적으로 전달할 수 있을까요?\n\n선 그래프의 활용은 다년간의 데이터 트렌드를 해석하는 것을 단순화하여, 중요한 변화 또는 안정 기간을 강조할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n![이미지](/assets/img/2024-06-20-WhyDataStorytellingisYourNewSuperpower_2.png)\n\n두 시기에 대한 주석이 초기 산업화의 영향과 제2차 세계 대전 이후의 발전에 대한 이야기를 전합니다. 선 그래프의 사용은 중요한 변화 기간을 강조합니다.\n\n질적 사고자에게는 종종 급격한 증가로 인해 그래프가 하키 스틱처럼 모양이 변한다고 합니다.\n\n이러한 질적 관찰은 순수한 데이터에서 양적 추상화와 세부 사항을 제거하여 필요한 사람들에게 더 관련성있는 맥락을 제공합니다.\n\n<div class=\"content-ad\"></div>\n\n데이터를 시각화물로 변환하면 다음을 할 수 있어요:\n\n- 중요한 통찰력 강조: 시각화는 데이터 표에서 쉽게 알아보기 힘든 중요한 추세, 비교 및 변화에 주목을 끌어줘요.\n- 이해도 향상: 시각적 표현은 순수 데이터보다 해석하기 쉬울 수 있어요.\n- 소통 용이: 효과적인 시각화는 발표에서 정보를 전달하는데 사용돼요. 예를 들어, \"하키 스틱\" 차트는 데이터를 더 dramatic하고 관련성 있게 만들어줘요.\n\nA Markdown 형식으로 표를 변경할 수도 있어요. \n\n# 데이터에서 이야기 찾는 도구\n\n<div class=\"content-ad\"></div>\n\n데이터에서 이야기를 찾을 수 있는 수많은 도구들이 있어요. 그 중에서도 인기 있는 몇 가지는 다음과 같아요:\n\n## 기술적 사용자를 위한 도구:\n\n- Tableau: 복잡한 분석을 위한 대화형 데이터 시각화를 제공해요.\n- Power BI: 대화형 보고서 및 대시보드를 만들 수 있고, Microsoft 제품과 웰매칭되는 기능을 제공해요.\n- D3.js: 웹 기반 데이터 시각화를 위한 사용자 정의 가능한 JavaScript 라이브러리에요.\n\n## 비기술적 사용자를 위한 도구:\n\n<div class=\"content-ad\"></div>\n\n- Google Charts: 웹사이트나 프레젠테이션에 삽입하기 쉬운 차트 및 그래프를 생성할 수 있습니다.\n- Canva: 인포그래픽 및 데이터 그래픽을 디자인하는 데 편리한 플랫폼입니다. \n- Flourish: 코딩 없이 상호 작용하는 시각화물을 만들어 내는 데 적합하며, 어떤 대상에게나 적합합니다.\n\n# 요약하자면...\n\n데이터 스토리텔링은 \"복잡성을 접근 가능하게 만드는 것\"에 관한 것입니다. (터프트)\n\n데이터부터 시작해보세요. 어떤 이야기를 전달하나요? 이 이야기를 다른 사람이 이해하고 공감할 수 있도록 어떻게 공유할 수 있을까요?\n\n<div class=\"content-ad\"></div>\n\n데이터에서 이야기를 찾는 데 도움이 되는 많은 도구들이 있습니다: Tableau,\n\n이야기를 묘사할 때 단어와 그림을 결합하면 시청자에게 더 깊은 이야기를 전달할 수 있어요. 명료성을 제공하기 위해, 시청자는 단어가 제공하는 도움이 필요할 수도 있고, 반대로 단어를 명확하게 해주는 시각적인 도움이 필요할 수도 있어요.\n\n시각화의 목적이 데이터를 명확하게 설명하는 것이라는 것을 기억해주세요.\n\n만일 시각적인 표현이 명확하지 않다면 완전한 실패입니다.\n\n<div class=\"content-ad\"></div>\n\n위 글 읽어 주셔서 감사합니다.\n\n## 참고 자료\n\nTufte, E. R. (2001). The visual display of quantitative information (2nd ed.). Graphics Press.\n\nNussbaumer Knaflic, C. (2015). Storytelling with data: A data visualization guide for business professionals. Wiley.\n\n<div class=\"content-ad\"></div>\n\nBerkes, F., & Grant, S. (2007). Fisher knowledge as expert system: A case from the longline fishery of Grenada, the Eastern Caribbean. Fisheries Research, 84(2), 162–17.\n\n만약 이러한 유형의 이야기가 당신에게 딱 맞고 저를 작가로 지원하고 싶다면, 제 Substack을 구독해주세요.\n\nSubstack에서는 나의 생산물이 있는 다른 플랫폼에서 찾을 수 없는 매주 두 번의 뉴스레터와 기사들을 발행합니다.","ogImage":{"url":"/assets/img/2024-06-20-WhyDataStorytellingisYourNewSuperpower_0.png"},"coverImage":"/assets/img/2024-06-20-WhyDataStorytellingisYourNewSuperpower_0.png","tag":["Tech"],"readingTime":6},{"title":"데이터 시각화 101 효과적인 대시보드와 보고서를 위한 색채 심리 활용하기","description":"","date":"2024-06-20 14:57","slug":"2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports","content":"\n\n## 이 기사에서는 색상 심리학과 데이터 시각화에서의 적용을 탐구합니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_0.png)\n\n## 서문\n\n색상 심리학은 색상이 우리에게 미치는 영향과 그 지식을 다양한 상황(이 경우 데이터 시각화)에서 어떻게 활용할 수 있는지 이해하는 데 도움을 줍니다. 이는 색상이 인간의 행동, 감정 및 인식에 어떻게 영향을 미치는지에 대한 연구입니다. 다양한 색조가 우리에게 특정 감정적 반응을 유발할 수 있으며, 이러한 반응이 연령, 문화적 배경 및 문맥과 같은 다양한 요소에 의해 영향을 받을 수 있다는 것을 탐구합니다. 이 중요한 측면 중 일부는 다음과 같습니다:\n\n<div class=\"content-ad\"></div>\n\n- 색상과 감정: 다른 색상은 다른 감정과 관련이 있습니다. 예를 들어, 빨강은 흥분이나 열정을 자아내고, 파랑은 평화와 안정을 촉진할 수 있습니다.\n- 문화적 영향: 색상의 의미는 문화에 따라 달라질 수 있습니다. 예를 들어, 서양 문화에서 흰색은 순수함과 새로운 시작을 상징하지만, 동양 문화에서는 애도를 나타낼 수 있습니다.\n- 생리적 효과: 연구에 따르면 색상은 우리의 생리에도 영향을 줄 수 있습니다. 빨강은 심박수를 높일 수 있고, 녹색은 진정 효과가 있을 수 있습니다.\n\n아름다움 넘어선 색채 심리학은 데이터 시각화에서 차트와 보고서 테마의 색상 선택을 안내합니다. 이를 통해 인사이트를 청중이나 이해권자에게 효과적으로 전달할 수 있습니다. 그들의 배경을 이해하는 것이 강력한 색상을 선택하는 열쇠입니다.\n\n## 파트 1: 회색의 힘\n\n이 기사에서는 데이터 시각화에서 회색의 중요성에 대해 논의했습니다. 요점은, 회색이 기초를 제공하고 시청자의 주의를 이끄는 역할을 하며, 데이터가 전하는 이야기를 흐트리지 않고 명확성을 보장합니다. 다시 한번 요약하면:\n\n<div class=\"content-ad\"></div>\n\n- 강조를 줄이는 요소: 회색은 주목을 받지 않는 중립적인 색상입니다. 그렇기 때문에 그리드 선, 배경 또는 강조하고 싶지 않은 데이터 포인트와 같은 중요하지 않은 요소에 이상적입니다. 이러한 요소에 회색을 사용함으로써 색상이 돋보이고 시각화의 가장 중요한 측면에 관중의 시선을 집중시킬 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_1.png)\n\n- 맥락 제공: 더 밝은 회색으로 배경 정보나 큰 그림을 이해하는 데 도움이 되는 콘텍스트 데이터를 표시할 수 있습니다. 이는 색상으로 관중을 압도하지 않고 추세나 기준선을 보여줄 때 유용할 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_2.png)\n\n<div class=\"content-ad\"></div>\n\n- 등급 구조 생성하기: 다양한 회색 색조를 사용하여 데이터 시각화 내에서 시각적 등급 구조를 만들 수 있습니다. 예를 들어, 차트 레이블에는 더 어두운 회색 색조를 사용하고, 그리드선에는 더 밝은 색조를 사용할 수 있습니다. 이는 뷰어가 서로 다른 요소들을 구별하고 정보 구조를 이해하는 데 도움이 됩니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_3.png)\n\n- 눈 피로 감소: 너무 많은 색상, 특히 밝은 색상을 사용하는 것은 데이터 시각화를 오랫동안 보는 뷰어에게 눈 피로를 일으킬 수 있습니다. 회색은 눈의 중립적인 휴식 지점을 제공하여 전체 시각화를 더 피로감 없이 볼 수 있게 합니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_4.png)\n\n<div class=\"content-ad\"></div>\n\n- 섬세한 구분: 더 밝은 회색을 사용하여 대시 보드 또는 보고서의 다른 섹션을 섬세하게 구분할 수 있습니다. 이는 뷰어가 정보를 탐색하고 데이터 조각들이 서로 어떻게 관련되는지 이해하는 데 도움이 됩니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_5.png)\n\n## 파트 2: 산업 색상\n\nTowergate 보험은 520개 회사의 로고를 분석하여 그들의 색상 선호도와 해당 색상이 유발할 수 있는 감정적 반응을 이해하기 위해 노력했습니다. 그들의 연구 결과는 동일한 색상이 산업에 따라 다른 반응을 유발할 수 있다는 것을 시사합니다. 예를 들어, 파란색은 의사 소통 산업에서 인기 있는 선택지로, 명확한 의사 소통과 정신적 초점을 전달하려는 데 사용됩니다. 그에 반해, 제약 산업은 청결과 건강과의 연관성을 활용하기 위해 파란색을 종종 웰빙을 상징하는 데 사용합니다. 이 연구는 보고서나 대시보드를 위한 테마 색상을 선택할 때 유용한 통찰을 제공하며, 특히 특정 브랜드 가이드라인 외부에서 작업할 때 중요한 역할을 합니다. 관련 산업에 맞춰 색 팔레트를 맞춤으로써 보고서나 대시보드가 관련성을 유지하고 청중과 공감할 수 있도록 할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n유용한 팁: 보고서나 대시보드를 디자인할 때 특정 브랜드의 公式 색상 코드를 사용하면 브랜드 일관성을 유지할 수 있습니다. 일반적으로 이러한 색상은 공식 웹사이트나 온라인 검색을 통해 확인할 수 있습니다. 또한, 그들의 브랜드 가이드라인을 주의 깊게 살펴봄으로써 로고나 색상 사용 정책을 위반하는 일을 피할 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_6.png)\n\n색채심리를 활용하여, 저는 #DataDNA 2024년 5월 챌린지 보고서의 테마 색상으로 통신 업계(기술 지원) 에이전트 성과에 파란색을 선택했습니다. 그 이유는 다음과 같습니다:\n\n- 신뢰와 안정성: 파란색은 안정감을 불러일으키고 안정성을 나타내는데 좋아 신뢰와 안정성을 전달하는 데 좋은 선택입니다.\n- 명확한 커뮤니케이션과 집중: 파란색은 정신적 명확성과 집중력과 연관이 있어 명확한 커뮤니케이션을 촉진하고 이해하기 쉬운 메시지를 홍보하는 데 이상적입니다.\n- 전문성과 신뢰성: 신뢰와 명확성에 대한 연관은 커뮤니케이터나 브랜드에 대한 전문성과 신뢰성감을 전달합니다.\n- 안전과 안정: 파란색은 안전감과 안정감을 조성할 수도 있어 커뮤니케이션 환경에서 사용자가 불안하거나 불확실해 느낄 수 있는 상황에 유용할 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n\n<img src=\"/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_7.png\" />\n\n## 파트 3: 데이터 시각화에서의 공통 색상 지각\n\n문화를 넘어서 특정 색상은 일반적으로 공통된 지각을 일으킵니다. 여기 몇 가지 예시가 있습니다:\n\n- 빨간색은 사랑, 열정, 분노, 위험과 같은 강렬한 감정과 관련이 있습니다.\n- 파란색은 평온함, 평화, 신뢰, 슬픔과 연관되는 경우가 많습니다.\n- 녹색은 일반적으로 자연, 성장, 조화 및 때로는 질투를 나타내는 것으로 인식됩니다.\n- 노란색은 행복, 낙관주의, 에너지, 때로는 주의를 불러일으킵니다.\n- 검은색은 일반적으로 권력, 세련미, 격식, 명복(일부 문화에 따라)와 관련이 있습니다.\n\n\n<div class=\"content-ad\"></div>\n\nMarkdown 형식의 표로 변경해주시면 됩니다.\n\n\n| ![Data Visualization101 - Leveraging Color Psychology for Effective Dashboards and Reports](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_8.png) |\n|:--:|\n| 이미지 1 |\n  \n| ![Data Visualization101 - Leveraging Color Psychology for Effective Dashboards and Reports](/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_9.png) |\n|:--:|\n| 이미지 2 |\n\n\n그러나 컨텍스트에 따라 색상의 의미가 다를 수 있다는 점을 기억하는 것이 중요합니다. 예를 들어, 빨강은 일부 동양 문화에서 행운을 상징할 수 있지만, 흰색은 아시아 일부 지역에서 애도에 사용됩니다. 이 원칙은 데이터 시각화에도 동일하게 적용됩니다. 여기에서 빨강과 같은 색상은 종종 부정적인 값을 나타내거나 감소하는 추세를 나타냅니다, 반면 초록색은 일반적으로 긍정적인 값을 나타내거나 증가하는 추세를 나타냅니다. 그러나 이 규칙은 모든 경우에 적용되지 않습니다. 그 이유는 색상이 특정 컨텍스트에 따라 다른 의미를 갖을 수 있기 때문입니다.\n\n아래 차트로 나타낸 주가 상승은 회사와 이해관계자들에게 긍정적인 소식을 알리는 것을 의미합니다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_10.png\" />\n\n또 다른 예에서는 상슨하는 유가가 소비자들에게 나쁜 뉴스로 전환되는 방법을 강조합니다. 그래서 여기에서 빨간색은 긍정적인 가치를 나타내는 것을 의미합니다 - 소비자에게 부정적인 영향을 뜻합니다.\n\n<img src=\"/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_11.png\" />\n\n독서해 주셔서 감사합니다! 이 글이 유익하게 느껴졌으면 좋겠습니다. 궁금한 점이 있으시면 언제든지 문의해 주세요.","ogImage":{"url":"/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_0.png"},"coverImage":"/assets/img/2024-06-20-DataVisualization101LeveragingColorPsychologyforEffectiveDashboardsReports_0.png","tag":["Tech"],"readingTime":6},{"title":"윈도우에서 NVIDIA GPU 가속을 활용해 llama-cpp-python 설치하기 간단 안내","description":"","date":"2024-06-20 14:56","slug":"2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide","content":"\n\n<img src=\"/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_0.png\" />\n\n개발자이신가요? 로컬 LLM 개발을 위해 Windows에서 하드웨어 가속된 llama-cpp-python의 성능을 끌어올리고 싶으신가요? 더 이상 찾지 마세요! 이 안내서에서는 스텝별로 안내하여 본인이 설치하는 동안 겪은 문제점을 피할 수 있도록 도와드리겠습니다.\n\n# Prerequisites:\n\n- Visual Studio 설치:\n\n<div class=\"content-ad\"></div>\n\n- Windows용 C++ CMake 도구.\n- C++ 핵심 기능\n- Windows 10/11 SDK.\n\n![이미지](/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_1.png)\n\n2. CUDA Toolkit:\n\n- NVIDIA 공식 웹사이트에서 CUDA Toolkit 12.2를 다운로드하고 설치합니다.\n- nvcc --version 및 nvidia-smi로 설치 여부 확인합니다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_2.png\" />\n\n- 환경 변수에 CUDA_PATH (C:\\Program Files\\NVIDIA GPU Computing Toolkit\\CUDA\\v12.2)를 추가하세요.\n\n## 설치 단계:\n\n새 명령 프롬프트를 열고 Python 환경을 활성화하세요 (예: conda 사용). 다음 명령을 실행하세요:\n\n<div class=\"content-ad\"></div>\n\n```shell\nCMAKE_ARGS=-DLLAMA_CUBLAS=on을 설정합니다.\nFORCE_CMAKE=1로 설정합니다.\npip install llama-cpp-python --force-reinstall --upgrade --no-cache-dir\n\n# 컴파일 시 cuBLAS가 사용되고 있는지 확인하려면 --verbose를 사용하세요.\n```\n\n설치 중 --verbose 옵션을 추가하면 CUDA가 컴파일에 사용되는지 확인할 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_3.png)\n\nCUDA가 올바르게 구성되지 않았다면, llama-cpp-python은 하드웨어 가속을 사용하지 않고 설치됩니다.\n\n<div class=\"content-ad\"></div>\n\n만약 Cuda가 감지되지만 No CUDA toolset founderror가 발생한다면 다음을 수행하세요:\n\n- 파일을 복사합니다: C:\\Program Files\\NVIDIA GPU Computing Toolkit\\CUDA\\v12.2\\extras\\visual_studio_integration\\MSBuildExtensions 에서 아래 경로로:\n(Enterprise 버전 인 경우) C:\\Program Files\\Microsoft Visual Studio\\2022\\Enterprise\\MSBuild\\Microsoft\\VC\\v170\\BuildCustomizations\n또는\n(Community 버전인 경우) C:\\Program Files\\Microsoft Visual Studio\\2022\\Community\\MSBuild\\Microsoft\\VC\\v170\\BuildCustomizations\n\n```js\ncopy \"C:\\Program Files\\NVIDIA GPU Computing Toolkit\\CUDA\\v12.2\\extras\\visual_studio_integration\\MSBuildExtensions\" \"C:\\Program Files\\Microsoft Visual Studio\\2022\\Enterprise\\MSBuild\\Microsoft\\VC\\v170\\BuildCustomizations\"\n```\n\n(설치에 기반하여 경로를 조정하세요)\n\n<div class=\"content-ad\"></div>\n\n# 테스트\n\n- 다음의 Python 코드를 실행하여 설치를 확인하세요:\n\n```js\nfrom llama_cpp import Llama\nllm = Llama(model_path=\"model.gguf\", n_gpu_layers=30, n_ctx=3584, n_batch=521, verbose=True)\n# GPU 및 모델에 맞게 n_gpu_layers를 조정하세요\noutput = llm(\"Q: 태양계의 행성을 말해주세요? A: \", max_tokens=32, stop=[\"Q:\", \"\\n\"], echo=True)\nprint(output)\n```\n\n![링크 텍스트](/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_4.png)\n\n<div class=\"content-ad\"></div>\n\n만약 설치가 올바르게 되었다면, 모델 속성에서 BLAS = 1 지표가 표시될 것입니다.\n\n# 결론:\n\n이 단계를 따르면, Windows 기기에 cuBLAS 가속을 사용하여 llama-cpp-python을 성공적으로 설치했을 것입니다. 이 안내서는 과정을 간소화하고 흔한 문제를 피할 수 있도록 돕는 것을 목표로 합니다.\n\n이제 향상된 성능을 갖는 로컬 llama 개발에 뛰어들 준비가 되었습니다. GPU 오프로딩에 행운을 빕니다!","ogImage":{"url":"/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_0.png"},"coverImage":"/assets/img/2024-06-20-Installingllama-cpp-pythonwithNVIDIAGPUAccelerationonWindowsAShortGuide_0.png","tag":["Tech"],"readingTime":3},{"title":"차원이 다른 창문, 문 최고의 창문 또는 문을 찾는 데 도움이 될 5가지 팁, 설치가 제대로 이루어졌는지 확인하는 방법","description":"","date":"2024-06-20 14:55","slug":"2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly","content":"\n\n얼마 전에 아내가 문자를 보내와서 창문이 얼었다고 했어요.\n\n그래서 따뜻한 물을 쏟고 기다리라고 했더니, 떨어질 거예요… 문제없어.\n\n그러다가 컴퓨터가 아마 더 이상 작동하지 않을 거라고 했대요.\n\n물론 농담이죠 — 제 아내는 컴퓨터와 공예 천재에요. 그녀 덕분에 이 기사를 쓰게 되었어요. 창문과 문에 대해 올바른 선택을 하는 방법을 알려드릴게요.\n\n<div class=\"content-ad\"></div>\n\n창문은 빛이나 공기의 원천 이상일 수 있다는 것을 보여 주었어요 — 그리고 문에 대해 이야기하자니... 선택 사항, 스타일, 그리고 고급 디자인들이 정말 다양하답니다.\n\n걱정하지 마세요, 모든 옵션을 하나씩 살펴볼 생각은 없어요 — 만약 그렇게 하고 싶다면, 지역 전문가와 상의하여 평면도와 디자인에 가장 적합한 것을 찾아보세요.\n\n![image](/assets/img/2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly_0.png)\n\n우리가 다루게 될 것은 구매 전 알아야 할 5가지 핵심 정보입니다.\n\n<div class=\"content-ad\"></div>\n\n## 1. 옛 기술, 새로운 디자인\n\n창문과 문 전문가를 찾기 시작했을 때 문제가 발생했어요.\n\n경험 많은 전문가들이 많이 있는 기업들은 옛 스타일의 문에만 초점을 맞추고 있었는데, 새로운 스타일의 문은 새로운 회사에서만 구할 수 있었는데, 그 회사들에 대해 충분히 신뢰할 만한 정보를 알지 못했어요.\n\n그래서 제 조언은 중간 길을 찾아 최선의 방법을 선택하는 거예요.\n\n<div class=\"content-ad\"></div>\n\n여러분은 경험 많은 비즈니스를 원하시는 것 같은데, 그것이 가능하면서도 어려운 일입니다.\n\n## 2. 맞춤형 솔루션\n\n여러분의 집이 이웃 집이나 거리 반대편의 집과 똑같나요?\n\n만약 그렇다면 아마 여러분도 모두와 똑같은 문을 원하실 겁니다.\n\n<div class=\"content-ad\"></div>\n\n만약 그렇다면, 왜 이제 모두를 똑같이 만들기 시작하나요?\n\n선반에서 문을 가져오는 대신 집에 맞춤형 문을 받아보세요. 사용자 정의 소재, 색상, 마감 또는 스타일 - 그것들을 할 수 있어요.\n\n귀하의 비즈니스나 집을 위해 특별히 제작된 문을 받게 되면 이웃들과 일치하지 않음을 확신할 수 있지만, 분명히 그들을 빛낼 수 있을 거에요.\n\n![이미지](/assets/img/2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly_1.png)\n\n<div class=\"content-ad\"></div>\n\n## 3. 모든 옵션\n\n큰 문이 필요하신가요, 리프트 앤 슬라이드 옵션을 찾으시나요, 아니면 대부분 유리로 이루어진 것이나 커스텀 창문이 있는 것을 원하시나요?\n\n원하는 것을 얻을 수 있어야 합니다. 특별한 것을 원하더라도 상관없어야 합니다.\n\n이는 맞춤형 작업을 넘어서 모두 구비한 것을 얻는 것입니다.\n\n<div class=\"content-ad\"></div>\n\n이렇게 생각해 볼 수 있어요: 자신만의 디자인을 만들어가는 것은 멋지지만, 소재, 크기, 스타일 등에 제한이 있는 경우 그리 멀리 나아갈 수 없어요.\n\n따라서 단순히 사용자 정의 디자인을 제작해 주는 비즈니스를 찾는 것이 아니라, 모든 옵션을 제공해 제한이 없는 선택을 할 수 있는 곳을 찾아보세요.\n\n## 4. 전문성을 기대하세요\n\n결국 모든 사람이 창문 및 문 전문가가 아니라는 사실이 안타까운 일이에요.\n\n<div class=\"content-ad\"></div>\n\n가끔은 최선의 옵션이 무엇인지, 어떻게 결정해야 하는지 알기 어려울 때가 있죠. 그럴 땐 쉬운 방법을 택하라고 말하죠.\n\n전문가에게 물어보고, 어떤 생각을 갖고 있는지와 당신의 옵션을 비교한 후에 결정하세요.\n\n그래서 전문가들을 스며들게 하는 거죠. 그들을 최대한 잘 활용하고, 필요한 모든 조언을 사전에 얻어보세요.\n\n## 5. 타협하지 마세요\n\n<div class=\"content-ad\"></div>\n\n자주 듣는 최악의 소식 중 하나는 누군가가 문이나 창문에 덜 투자했다는 것이고, 그들이 영원히 후회할 것이라는 것입니다.\n\n문은 하루에 여러 차례 통과하는 것이며, 모든 손님들도 그렇습니다.\n\n집의 큰 특징이자 당신의 성을 소개하는 요소이며, 사람들이 떠날 때 경험하는 마지막 것입니다.\n\n그러니 가치 있게, 웅장하게, 그리고 당신만의 것으로 만드세요.\n\n<div class=\"content-ad\"></div>\n\n창문은 여러분이 집 안으로 그것을 들여보내고 싶을 때 더 넓은 세상으로의 창구입니다.\n\n매일 보거나 상호 작용할 수 있기 때문에 원하는 옵션을 선택하는 것이 가치가 있습니다.\n\n![창문 이미지](/assets/img/2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly_2.png)\n\n적절한 창문과 문은 집이나 비즈니스에서 모든 차이를 만들어줄 수 있습니다 - 그들은 실내와 실외의 세계 사이의 인터페이스입니다.\n\n<div class=\"content-ad\"></div>\n\n내 리틀 스타트업에 오신 걸 환영합니다! 테이블 태그를 마크다운 형식으로 변경하시려면 다음과 같이 하시면 됩니다:","ogImage":{"url":"/assets/img/2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly_0.png"},"coverImage":"/assets/img/2024-06-20-Top-TierWindowsDoors5FastFactsForFindingTheBestWindowsorDoorsHowToMakeSureTheyreInstalledProperly_0.png","tag":["Tech"],"readingTime":3},{"title":"네오빔, 하지만 윈도우에서 실행하기","description":"","date":"2024-06-20 14:53","slug":"2024-06-20-NeovimbutitsinWindows","content":"\n\n![Neovim in Windows](/assets/img/2024-06-20-NeovimbutitsinWindows_0.png)\n\n얼마 전, 저는 아마도 다시는 Neovim에 관한 글을 쓰지 않을 것이라고 스스로에게 말했습니다... 그러나 여기 있군요.\n\n![Neovim in Windows](/assets/img/2024-06-20-NeovimbutitsinWindows_1.png)\n\n하지만 이전 포스트와 달리, 이번엔 10분 미만으로 읽을 수 있도록 이 포스트를 작성할 거에요. 그리고 이번에는 윈도우용 Neovim 설정에 대해 이야기할 걵니다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-NeovimbutitsinWindows_2.png\" />\n\n# 놀랍도록 쉬웠어요\n\n본래 Neovim을 내장된 Windows 환경에 설정하는 것이 Linux와 비교해 상당히 어렵고 일관성이 없을 것이라고 믿었었어요. 하지만 Ubuntu에서 구성된 Neovim 설정을 몇 분 만에 복제한 후, 전체 프로세스가 매우 간단하다는 사실을 발견해서 매우 기뻤어요.\n\n그래서 이곳에서 시간을 많이 절약한 것은 이미 준비된 설정 파일 세트가 있기 때문이지만, 이것은 윈도우즈에서 Neovim을 처음부터 설정하는 것이 리눅스에서 하는 것과 거의 같은 프로세스라는 것을 보여주기도 합니다. 이에 대해서는 이 기사에서 언급했었어요:\n\n<div class=\"content-ad\"></div>\n\nVim 기반 편집기를 사용해 본 적이 없다면, 위에 링크된 기사를 포함하여 몇 가지 자료를 찾아보시는 것을 강력히 권장합니다. 결국 여기서 우리가 하는 것은 이미 존재하는 Neovim 구성을 복제하는 작업이니 말이죠. 하지만 대부분의 사람들이 fully-fledged 코드 편집기를 즐기기 때문에, 여러분이 사용하시는 것에 더 힘을 줍시다.\n\n# Chocolatey 설치하기\n\n![이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_3.png)\n\nLinux와는 다르게 macOS와 유사하게, Windows에는 내장된 패키지 관리자가 없습니다 (winget에 대해 언급하지 마세요). Ubuntu 사용자는 apt를 기본으로 사용하고, Arch 사용자는 pacman을 선호하며, macOS 사용자는 대부분 brew를 선택하는 반면, Windows의 패키지 관리자인 choco (또는 Chocolatey)가 있습니다.\n\n<div class=\"content-ad\"></div>\n\n네오빔을 설치하기 위해 Chocolatey를 사용하겠습니다. \n\n- 관리자 권한으로 실행한 명령 프롬프트 또는 PowerShell을 엽니다 (마우스 오른쪽 버튼 - \"관리자 권한으로 실행\")\n- Get-ExecutionPolicy를 실행합니다. Restricted가 반환되면 Set-ExecutionPolicy AllSigned 또는 Set-ExecutionPolicy Bypass -Scope Process 중 하나를 실행합니다.\n- 다음을 실행합니다:\n\n```js\nSet-ExecutionPolicy Bypass -Scope Process -Force; [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.ServicePointManager]::SecurityProtocol -bor 3072; iex ((New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1'))\n```\n\n그리고 이제 Chocolatey가 설치되어 있어야 합니다! choco를 실행하면 다음과 같은 출력이 표시될 것입니다:\n\n<div class=\"content-ad\"></div>\n\n![Neovim in Windows](/assets/img/2024-06-20-NeovimbutitsinWindows_4.png)\n\n# Neovim 설치 및 PATH에 추가\n\n이제 Chocolatey가 준비되었으니, choco install neovim을 사용하여 Neovim을 설치할 수 있습니다. Chocolatey가 Neovim을 설치하면, 바로 작동하지 않을 수 있습니다(nvim을 실행하면 인식되지 않는 명령어 오류가 표시될 수 있습니다). 이 경우, Neovim을 PATH 환경 변수에 추가해야 합니다.\n\n이를 위해 Windows 키를 누르고 \"시스템 환경 변수 편집\" 옵션을 찾아야 합니다.\n\n<div class=\"content-ad\"></div>\n\n아래 화면에 있을 때 \"환경 변수...\"를 선택하면 다른 창이 열립니다.\n\nPATH 환경 변수를 선택한 다음 그 아래에 있는 \"편집...\" 버튼을 선택하세요.\n\n<div class=\"content-ad\"></div>\n\n아래 Markdown 형식을 이용하여 표 태그를 변경해주세요.\n\n\n![Neovim을 Windows에 설치하는 이미지 1](/assets/img/2024-06-20-NeovimbutitsinWindows_7.png)\n\n여기서 \"새로 만들기\"를 선택하고 Neovim이 설치된 경로를 추가하세요. 저의 경우, C:\\tools\\neovim\\nvim-win64\\bin에 설치되었는데, 다른 경로도 조금씩 다를 수 있으니 확인해보세요.\n\n말할 필요도 없이, 이미 열려 있는 터미널에서는 여전히 nvim을 사용할 수 없습니다. 새로운 터미널을 열기보다는 Chocolatey를 통해 환경 변수를 새로 고칠 수 있는 이 명령어를 실행하세요: RefreshEnv.cmd. 이제 nvim 명령어를 실행하면 Neovim이 열릴 것입니다!\n\n![Neovim을 Windows에 설치하는 이미지 2](/assets/img/2024-06-20-NeovimbutitsinWindows_8.png)\n\n\n<div class=\"content-ad\"></div>\n\n# 복제하기\n\n이제 Neovim 설정을 복제할 때입니다. 적절한 경로는 Win + R (Windows 실행)를 눌러 %appdata%를 입력하고 ENTER 키를 눌러 탐색할 수 있습니다. Roaming에서 한 디렉토리 뒤로 이동한 후 Local로 이동하세요.\n\n![이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_9.png)\n\nLocal에서 Neovim은 nvim이라는 이름의 폴더를 찾을 것이므로 지금 할 일은 현재 디렉토리에서 터미널을 열고 선택한 깃허브 저장소를 복제한 다음, 복제된 폴더의 이름을 이미 nvim으로 지정하지 않았다면 nvim으로 변경하는 것뿐입니다.\n\n<div class=\"content-ad\"></div>\n\n만약 내 설정을 원한다면, 다음을 실행해보세요:\n\n```js\ngit clone https://github.com/kevinfengcs88/neovim-config\n```\n\n그러면 neovim-config라는 폴더가 생성됩니다. 해당 폴더를 nvim으로 변경하고, 다음에 Neovim을 열 때 모든 것이 제대로 로드되어야 합니다.\n\n![이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_10.png)\n\n<div class=\"content-ad\"></div>\n\n하지만 작은 문제가 하나 있어요... 우리 멋진 아이콘들은 어디에 있나요? Nerd 폰트가 없으면 Neovim을 정리하고 깔끔하게 보이게 하는 멋진 글리프와 기호들을 렌더링할 수 없겠어요. 파일 트리 탐색기가 특히 싫어 보이네요...\n\n![Neovim in Windows](/assets/img/2024-06-20-NeovimbutitsinWindows_11.png)\n\n# Windows 터미널 설치하기\n\n![Installing Windows Terminal](/assets/img/2024-06-20-NeovimbutitsinWindows_12.png)\n\n<div class=\"content-ad\"></div>\n\n네드 폰트를 설치하기 전에는 네드 폰트와 호환되는 터미널이 필요합니다. 안타깝게도 명령 프롬프트와 파워쉘은 네드 폰트를 지원하지 않을 뿐만 아니라 조금 못생겼어요 (죄송해요).\n\nWindows 터미널은 멀티탭 터미널 에뮬레이터로 파워쉘, 명령 프롬프트, 심지어 Azure 클라우드 쉘을 실행할 수 있습니다. 무엇보다도, 네드 폰트를 지원합니다. Microsoft Store에 액세스할 수 있다면, GUI를 사용하여 간단히 설치할 수 있습니다. 안타깝게도 제 데스크탑은 Microsoft Store에 문제가 있어서 약간의 조사를 해야 했어요.\n\nWindows 터미널의 GitHub 릴리스로 이동하여 \"Latest\" 릴리스를 찾아보세요.\n\n![Windows Terminal Latest Release](/assets/img/2024-06-20-NeovimbutitsinWindows_13.png)\n\n<div class=\"content-ad\"></div>\n\n“에셋” 섹션으로 스크롤하여 .msixbundle로 끝나는 파일을 다운로드하세요. 파일을 다운로드했다면 Windows 터미널을 설치하는 몇 가지 다른 방법이 있습니다.\n\n하나는 .msixbundle 파일을 실행하는 것인데, 이를 통해 GUI를 통해 Windows 터미널을 설치할 수 있어요:\n\n![이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_14.png)\n\n다른 방법은 PowerShell 명령어를 사용하는 것인데 (물론 “Downloads” 디렉토리에 있는 경우):\n\n<div class=\"content-ad\"></div>\n\n```js\nAdd-AppxPackage [이름]\n```\n\n다운로드한 .msixbundle 파일의 전체 이름으로 [이름]을 대체하세요.\n\nWindows 터미널을 설치한 후에는 Windows 시작 메뉴를 열 때 \"최근 추가된\" 섹션에서 찾을 수 있습니다. 쉽게 찾을 수 있도록 시작 메뉴에 고정하는 것을 추천합니다.\n\n# Nerd 폰트 설치하기\n\n\n<div class=\"content-ad\"></div>\n\n이제 Windows 터미널이 있으니 Nerd 폰트를 설치해보겠습니다. 이 작업은 여러 가지 방법으로 할 수 있는데, 하나는 nerdfonts.com을 방문하는 것이고, 다른 하나는 해당 GitHub 리포지토리를 이용하는 것입니다. 제가 이전 기사의 한 부분에서 후자를 다루었기 때문에, 이번에는 Nerd Fonts 웹사이트에서 설치하겠습니다.\n\n[Nerd Fonts 웹사이트의 \"다운로드\" 페이지](https://www.nerdfonts.com)로 이동하면 다양한 폰트들이 나타납니다.\n\n<div class=\"content-ad\"></div>\n\n선호하는 글꼴을 찾아 다운로드하고 다운로드한 글꼴의 ZIP 파일로 이동한 후 글꼴의 \"regular\" 변형을 찾아보세요:\n\n![참조 이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_17.png)\n\n해당 파일을 열어서 Windows에 글꼴을 설치하세요.\n\n![참조 이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_18.png)\n\n<div class=\"content-ad\"></div>\n\n폰트가 설치되었는지 확인하려면 Windows의 \"폰트 설정\"으로 이동하여 검색할 수 있어요.\n\n![이미지](/assets/img/2024-06-20-NeovimbutitsinWindows_19.png)\n\n# 마무리하며\n\n마지막으로, Nerd Fonts를 지원하는 터미널과 Nerd 폰트가 설치된 상태에서 몇 가지 더 실행 단계만 거치면 Neovim을 그 모든 영광으로 볼 수 있어요.\n\n<div class=\"content-ad\"></div>\n\nWindows Terminal을 열고 창 헤더 어디든 마우스 오른쪽 버튼을 클릭하세요:\n\n![image](/assets/img/2024-06-20-NeovimbutitsinWindows_20.png)\n\n“Settings”를 클릭한 후 사이드바에서 “Defaults” 탭으로 전환하세요:\n\n![image](/assets/img/2024-06-20-NeovimbutitsinWindows_21.png)\n\n<div class=\"content-ad\"></div>\n\n\"외형\"으로 스크롤을 내려주세요:\n\n\n<img src=\"/assets/img/2024-06-20-NeovimbutitsinWindows_22.png\" />\n\n\n마지막으로 \"글꼴\" 옵션을 변경해주세요:\n\n\n<img src=\"/assets/img/2024-06-20-NeovimbutitsinWindows_23.png\" />\n\n\n<div class=\"content-ad\"></div>\n\n그리고 마침내 끝났어요!\n\n![Neovim in Windows](/assets/img/2024-06-20-NeovimbutitsinWindows_24.png)\n\n# 결론\n\nWindows용 Neovim 설정은 Linux 환경에서 Neovim을 경험한 사람으로서 매우 원활한 경험입니다. 대부분의 것들이 동일합니다. 단지 설정 파일을 저장하는 경로가 약간 다를 뿐입니다.\n\n<div class=\"content-ad\"></div>\n\nWindows에서 Neovim은 Linux 환경과 비교하여 시작 시 약 3배 정도 느립니다. 그리고 \"차가운\" 시작(수 시간 동안 Neovim을 열지 않아 리소스가 할당되지 않은 상태)에서는 10배 이상 느립니다.\n\n저의 Linux에서의 차가운 시작은 대략 200 또는 250밀리초이며, 일반적인 시작은 100밀리초 또는 그 이하입니다. 그러나 Windows에서는 일반적인 시작이 대략 280밀리초이며, 차가운 시작은 상당히 느리게 2000밀리초 이상(네, 2초 이상)이 소요됩니다. 이 부분은 확실히 확인하고 최적화할 필요가 있습니다. 왜냐하면 이제 Windows에서 작업을 할 때 Neovim을 사용할 것이기 때문입니다.\n\n읽어 주셔서 감사합니다! 다음에 또 뵙겠습니다, 친구들 :)\n\nKevin Feng || 웹사이트 || GitHub || LinkedIn || Medium (이미 여기 있으시네요!)\n\n<div class=\"content-ad\"></div>\n\n# 소스\n\n- [Windows Report](https://windowsreport.com/windows-terminal-windows-10/)\n- [Chocolatey](https://chocolatey.org/install#individual)","ogImage":{"url":"/assets/img/2024-06-20-NeovimbutitsinWindows_0.png"},"coverImage":"/assets/img/2024-06-20-NeovimbutitsinWindows_0.png","tag":["Tech"],"readingTime":8},{"title":"Windows 터미널을 더욱 향상시켜보세요 Oh My Posh와 함께하는 스텝바이스텝 설치 가이드 VSCode 설정 포함","description":"","date":"2024-06-20 14:51","slug":"2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded","content":"\n<img src=\"/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_0.png\" />\n\n터미널에서 상당한 시간을 보내는 경우, 효율적이고 미려한 명령줄 인터페이스의 가치를 아실 것입니다. Oh My Posh는 터미널 프롬프트를 시각적으로 멋지고 매우 기능적인 작업 공간으로 변환해주는 강력한 도구입니다. 개발자, 시스템 관리자 또는 터미널 애호가이든, Oh My Posh를 통해 터미널 경험을 다음 수준으로 끌어올릴 수 있습니다.\n\n## Oh My Posh란?\n\nOh My Posh는 프롬프트 문자열을 조정할 수 있는 모든 셸에 대한 사용자 정의 프롬프트 엔진입니다.\n\n<div class=\"content-ad\"></div>\n\n## Oh My Posh를 사용해야 하는 이유\n\n- 사용자 정의: 다양한 테마 중에서 선택하거나 작업 흐름과 미적 취향에 맞게 자신만의 테마를 만들 수 있습니다.\n- 생산성: 추가 명령어를 입력하지 않고도 필수 정보에 빠르게 액세스할 수 있습니다.\n- 크로스 플랫폼: Windows, macOS 및 Linux에서 원활하게 작동합니다.\n- 커뮤니티 지원: 다양한 테마와 기능을 기여하는 활기찬 커뮤니티가 있습니다.\n\n## 설치 가이드\n\n터미널을 개선하고 싶나요? Oh My Posh를 설치하기 위해 이 간단한 단계를 따르세요:\n\n<div class=\"content-ad\"></div>\n\n**단계 1:** PowerShell 및 Microsoft 터미널을 설치합니다 (이미 설치되어 있지 않은 경우).\n\n**단계 2:** Oh My Posh 설치:\n\nOh My Posh를 설치하려면 Microsoft Store에서 설치하거나 PowerShell을 열고 다음 명령을 실행합니다:\n\n```js\nwinget install JanDeDobbeleer.OhMyPosh -s winget\n```\n\n<div class=\"content-ad\"></div>\n\n단계 3: 터미널 설정 구성\n\n설치 후 Oh My Posh를 사용하도록 터미널을 구성해야 합니다.\n\n- 네르드 폰트 설치: https://www.nerdfonts.com/\n- 터미널/편집기를 설치된 폰트를 사용하도록 구성하십시오:\n- 터미널에서 설정으로 이동하여 기본 섹션에서 font-face를 찾은 다음 설치한 네르드 폰트 중 하나로 설정하십시오:\n\n![이미지](/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_1.png)\n\n<div class=\"content-ad\"></div>\n\n- VS Code를 사용하려면 settings.json 파일로 이동해서 다음 코드를 추가하세요:\n\n```js\n\"terminal.integrated.fontFamily\": \"Hack Nerd Font\", // Hack Nerd Font은 내가 설치한 글꼴의 이름입니다\n```\n\n- 쉘에서 Oh My Posh를 사용하도록 구성하세요:\n- PowerShell 프로필 스크립트를 편집하세요\n\n```js\nnotepad $PROFILE\n```\n\n<div class=\"content-ad\"></div>\n\n위 명령어에서 오류가 발생하면 먼저 프로필을 만들어야 합니다:\n\n```js\nNew-Item -Path $PROFILE -Type File -Force\n```\n\n그런 다음 다음 줄을 추가하십시오:\n\n```js\noh-my-posh init pwsh | Invoke-Expression\n```\n\n<div class=\"content-ad\"></div>\n\n한 번 추가하면 변경 사항이 적용되려면 프로필을 다시로드하세요:\n\n```js\n. $PROFILE\n```\n\n위의 명령어를 입력한 후 이와 같은 오류가 발생하면:\n\n![이미지](/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_2.png)\n\n<div class=\"content-ad\"></div>\n\n새로운 PowerShell 세션을 관리자 권한으로 열어서 다음 코드를 추가해야 해요(자세한 내용은 이 링크에서 확인할 수 있어요):\n\n```shell\nSet-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser\n```\n\n그런 다음 실행하세요:\n\n```shell\n. $PROFILE\n```\n\n<div class=\"content-ad\"></div>\n\n만약 이와 같은 오류가 vscode에서 발생한다면:\n\n![Error](/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_3.png)\n\n터미널을 관리자 모드로 실행하여 다음 명령어를 실행해주세요:\n\n```js\nInstall-Module PsReadLine -Force\n```\n\n<div class=\"content-ad\"></div>\n\n만약 vscode에서 이런 식으로 나쁜 인코딩이 발생한다면:\n\n<img src=\"/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_4.png\" />\n\n다음 코드를 vscode 설정 파일인 setting.json에 추가해보세요:\n\n```js\n\"terminal.integrated.profiles.windows\": {\n    \"PowerShell\": {\n        \"shell_integration\": true,\n            \"source\": \"PowerShell\",\n            \"icon\": \"terminal-powershell\",\n            \"args\": [\n                \"-NoExit\",\n                \"-Command\",\n                \"oh-my-posh init pwsh | Invoke-Expression\"\n            ]\n        }\n  }\n```\n\n<div class=\"content-ad\"></div>\n\n**단계 4: 테마 선택**\n\n여기에서 테마를 찾아 설정할 수 있어요. 이것은 oh-my-posh 문서입니다.\n\n저는 이 테마를 사용하고 이렇게 보여요:\n\n![이미지](/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_5.png)\n\n<div class=\"content-ad\"></div>\n\n이 튜토리얼을 즐기시길 바라며, 만약 오류를 만나게 된다면 도움이 되어 문제를 해결하는 데 도움이 되기를 바랍니다 😍.\n","ogImage":{"url":"/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_0.png"},"coverImage":"/assets/img/2024-06-20-ImproveYourWindowsTerminalwithOhMyPoshAStep-by-StepInstallationGuidevscodesetupincluded_0.png","tag":["Tech"],"readingTime":4},{"title":"DSQuery 및 LDAPSearch를 사용한 수동 Active Directory 쿼리 소개","description":"","date":"2024-06-20 14:47","slug":"2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch","content":"\n\n# 소개\n\n정직하게 말하자면, BloodHound와 PowerView는 Active Directory(AD)를 조회하고 열거하며 조사하는 데 객관적으로 더 나은 도구입니다. 이 도구들은 더 효율적이고 직관적이며 BloodHound를 사용하면 쿼리를 쉽게 추적할 수 있습니다. 또한 파워뷰에서 -v 플래그를 사용하면 실행 중인 쿼리를 볼 수 있어 시간을 절약할 수 있습니다. 그러나 최근 평가에서 내가 한 대상에게 들을 수 없는 상황에 처했을 수도 있습니다. 그런 경우에 팀은 호스트에서 어느 도구도 실행할 수 없었고 도구를 프록시로 사용하는 데 어려움을 겪었습니다. 이 도구를 사용하기 위한 해결책을 찾느라 사투를 벌이는 동안에도 여전히 목표를 달성해야했습니다. 따라서 앞서 얻은 자격 증명을 사용하여 수동으로 쿼리를 수행하기로 결정했습니다. *nix 시스템에서는 ldapsearch를 사용하여 수동 LDAP 검색을 수행할 수 있고, Windows 시스템에서는 dsquery를 사용할 수 있습니다.\n\n이 블로그에서는 자격 증명이나 쿼리를 시작할 컨텍스트를 어떻게 얻을지에 대한 제안은 제공하지 않겠지만, 이미 필수적인 정보를 가지고 있다고 가정하겠습니다. 대신, 이 도구들로 쿼리를 작성하는 방법과 다른 해결책을 찾아내는 동안 어떻게 시작해야 하는지에 중점을 둘 것입니다.\n\n# 도구\n\n<div class=\"content-ad\"></div>\n\n좋아요, BloodHound, PowerView 및 다른 합리적인 옵션이 작동하지 않을 때 수동으로 AD 쿼리를 시작해야 하는 상황에 있습니다. 시작할 수 있는 두 가지 도구를 살펴보겠습니다. Dsquery와 ldapsearch는 AD를 쿼리하는 데 사용되는 도구이며, 공격적인 AD 상황인식에 사용할 수 있습니다.\n\n먼저, Windows 이진 파일인 dsquery에 대해 이야기하겠습니다. 따라서 목표에 (있는 경우) 이미 존재하지 않은 경우 너무 많은 경고를 일으키지 않고도 업로드할 수 있습니다. dsquery.dll은 기본적으로 대부분 또는 모든 Windows 시스템의 C:\\Windows\\System32\\dsquery.dll에 있습니다.\n\n![그림](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_0.png)\n\n바이너리 dsquery.exe는 일부 서버에 이미 C:\\Windows\\System32\\dsquery.exe에 존재할 수 있습니다. Dsquery는 Windows 원격 서버 관리 도구(RSAT) 패키지의 일부이며 Microsoft에서 여기서 다운로드할 수 있습니다. 또한 해당 위치에서 Microsoft가 설명하길 \"Windows 10 2018년 10월 업데이트부터 RSAT는 자체 Windows 10의 \"기능 요청\" 세트로 포함되어 있습니다.\" 해당 지침에 따라 상황에 따라 목표에 필요한 항목을 얻을 수 있는 옵션이 있을 수 있습니다. Dsquery는 명령줄 유틸리티이며 다음이 필요합니다:\n\n<div class=\"content-ad\"></div>\n\n- Active Directory Domain Services (AD DS) 서버 역할이 설치되어 있어야 합니다 (즉, 쿼리할 도메인이 있어야 함)\n- 승격된 명령 프롬프트(즉, NT AUTHORITY\\SYSTEM 컨텍스트)\n\n두 번째 도구는 macOS 및 *nix 시스템에 기본으로 있으며 ldapsearch입니다. 이미 시스템에 설치되어 있을 수 있지만 ldap-utils 패키지를 설치하여 설치할 수 있습니다. macOS에서는 이미 설치되어 있지 않다면 brew를 통해 openldap 패키지를 설치할 수 있습니다. ldapsearch 쿼리를 실행하려면 AD를 쿼리할 수 있는 유효한 AD 계정의 자격 증명이 필요합니다. 제가 찾은 가장 좋은 가이드(맨 페이지 외)는 이 웹사이트에 있습니다. 여기서의 ldapsearch 쿼리 컨텍스트는 Ubuntu Windows Subsystem for Linux에 도메인 서비스 계정의 평문 자격 증명을 사용합니다.\n\n# 쿼리 구조화\n\nDsquery와 ldapsearch는 유사한 쿼리 구조를 가지고 있으므로 둘 사이를 이동하기 쉽습니다. 출력 형식은 다르지만 대부분 동일한 정보를 제공할 것입니다. 또한 동일한 결과를 얻을 수 있는 여러 가지 방법이 있지만, 제가 선호하는 방법을 설명하겠습니다. 두 도구 모두 수행할 작업에 따라 다양한 명령 줄 옵션이 있습니다. 본 블로그에서는 과거에 사용해본 일반적인 옵션 몇 가지를 다룰 것이나, 사용 사례의 빈틈을 막기 위해 문서를 참고할 것을 권장합니다.\n\n<div class=\"content-ad\"></div>\n\n## Dsquery 구조\n\ndsquery의 기본 구조는 다음과 같습니다:\n\ndsquery `대상 유형` `필터` `옵션`\n\n대상 유형에는 다음 옵션이 있습니다:\n\n<div class=\"content-ad\"></div>\n\n- 컴퓨터\n- 연락처\n- 그룹\n- OU\n- 사이트\n- 서버\n- 사용자\n- 할당량\n- 파티션\n- * (와일드카드)\n\n첫 번째 매개변수로 객체 유형을 지정하거나 와일드카드 검색의 필터에 객체 유형을 지정하거나 모든 객체 유형을 열어두실 수 있습니다. 객체 유형을 지정하거나 와일드카드를 사용할 때 필터와 출력 결과가 다릅니다. 대개 다른 객체 유형은 많은 정보를 제공하지 않기 때문에 저는 객체 유형에 와일드카드 옵션을 주로 사용합니다. 이는 개인적인 선호도이며 처음 시작할 때는 둘 다 작동합니다. 아래 예시에서는 객체 유형으로 사용자가 지정된 쿼리와 객체 유형 및 테스트 도메인의 사용자에 대한 objectclass 필터가 지정된 쿼리를 확인할 수 있습니다 (PLANETEXPRESS).\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_1.png)\n\ndsquery user\n\n<div class=\"content-ad\"></div>\n\n이 예에서는 도메인 사용자에 대한 간단한 쿼리를 사용하면 도메인의 모든 사용자의 식별 이름이 표시됩니다. 이 방법은 매우 쉽고 간결하지만 정보가 많이 부족한 점이 있습니다. 와일드카드를 사용한 예제를 살펴보고 결과를 하나의 사용자로 제한해 봅시다.\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_2.png)\n\ndsquery * -filter \"(objectclass=user)\" -attr * -limit 1\n\n이전 것과 비교했을 때 이 필터는 훨씬 길고 비교적 복잡하지만 더 많은 정보를 얻을 수 있습니다. 예를 들어 사용자의 그룹 멤버십, 설명 및 이름을 모두 볼 수 있습니다. 두 쿼리 사이에는 조금 다른 결과가 나오지만 이에 대해 뒤에서 더 자세히 설명하겠습니다. 한 가지 빠른 팁: 대소문자 구분은 대부분 중요하지 않습니다. 원하면 적절한 형식을 사용할 수 있지만 결과에 큰 영향을 미치지 않을 것입니다. 결과에 영향을 준다고 판단되면 한 객체에 대한 모든 속성을 가져와 이름을 올바른 형식으로 복사하는 것이 좋습니다. dsquery를 사용한 쿼리의 경우 쿼리의 컨텍스트는 도메인에 가입된 호스트의 NT AUTHORITY\\SYSTEM 명령 프롬프트에 있을 것입니다.\n\n<div class=\"content-ad\"></div>\n\n## Ldapsearch 구조\n\nLdapsearch는 쿼리를 어떻게 구성할 지에 대해 더 많은 유연성을 제공합니다. 이 블로그 전체를 일관성 있게 유지하기 위해 사용할 형식은 다음과 같습니다:\n\nldapsearch `형식 옵션` `인증 옵션` `도메인 옵션` `쿼리 필터` `속성 목록`\n\n아마도 이것이 완전히 정확하지는 않겠지만, 이것이 내가 이 논의를 구성하고 \"시작하기\" 방법으로 생각할 것을 권장하는 방식입니다. 모든 옵션을 설명하지는 않겠지만, 모두들 매뉴얼 페이지를 읽거나 여기 추가 옵션을 검토하도록 장려합니다. 일관성을 위해 dsquery로 모든 사용자를 나열하는 동일한 쿼리를 사용합시다.\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_3.png\" />\n\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(objectClass=user)” dn\n\n\n안녕하세요! Ldapsearch는 더 복잡할 것입니다. 종종, 필요한 옵션을 갖춘 첫 번째 쿼리를 작성한 다음 필터와 필요한 속성 목록을 조정하기 위해 마지막 두 부분을 수정합니다. 중요한 점은 이곳에서 전제로 한 것은 AD에 액세스할 수 있는 계정의 일반 텍스트 자격 증명을 가지고 있다는 것입니다. 이 쿼리에 대해, 제목 계정에 대한 일반 텍스트 사용자 이름과 암호를 사용했으며 이는 손상된 서비스 계정을 시뮬레이션합니다. 사용자 이름과 암호는 반드시 필요하지 않을 수 있지만 어떤 종류의 인증이 필요할 것입니다. 이 블로그에서는 이러한 방식으로 쿼리를 작성할 것이며, \"옵션\" 섹션에서 다른 방법에 대해 설명하겠습니다.\n\n# 쿼리 작성하기\n\n<div class=\"content-ad\"></div>\n\n## 복합 필터\n\n복합 필터는 성공적인 쿼리를 위해 꼭 필요해요. 이를 사용하면 찾고자 하는 대상의 범위를 크게 좁히고 시간을 낭비하지 않게 도와줄 수 있어요.\n\n복합 필터는 다음과 같이 보일 거에요:\n\n“(&(attribute1=value1)(attribute2=value2))”\n\n<div class=\"content-ad\"></div>\n\n여기에서 &는 복합 필터임을 나타내고, 어떤 결과도 해당 속성에 대해 두 가지 값을 가져야 합니다. ! 기호를 사용하여 필터에서 항목을 제외할 수 있지만 괄호로 감싸야 합니다. 다음과 같이 몇 가지 결과를 제외할 수도 있습니다:\n\n\"(&(attribute1=value1)(!(attribute2=value2)))\"\n\n이 필터는 attribute1에 대한 값이 value1이고 attribute2에 대한 값이 value2가 아닌 결과 목록을 생성합니다. 이러한 필터는 dsquery와 ldapsearch 간에 동일하게 작동합니다. 사용 중인 명령 줄 도구에 따라 ! 기호를 사용하는 데 어려움이 있을 수 있습니다.\n\n## 와일드카드\n\n<div class=\"content-ad\"></div>\n\n이 도구를 사용한 모든 쿼리는 와일드카드 검색입니다. 처음 시작할 때 환경에 적응하고 방향을 잡을 때 굉장히 유용합니다. 일반적으로 저의 접근 방식은 매우 넓게 시작하여 찾은 것을 기반으로 쿼리를 좁히는 것입니다. 이름이나 구절을 별표로 감싸거나 구절의 시작 또는 끝에 두는 등 여러 방법으로 쿼리를 구체화할 수 있습니다.\n\ndsquery를 사용하여, 모든 Windows 기기의 이름과 sAMAccountName을 가져오고 싶은 예시를 살펴보겠습니다.\n\n![image](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_4.png)\n\ndsquery * -filter “(&(objectclass=computer)(name=*win*))” -attr name samaccountname -d 192.168.88.195\n\n<div class=\"content-ad\"></div>\n\n\n![image](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_5.png)\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(&(objectclass=computer)(name=*win*))” name samaccountname\n\n실제로 이를 시작할 때는 앞으로 진행하기 위해 필요한 속성만 반환하는 것이 좋습니다. 대규모 AD 환경에서는 많은 결과를 반환할 수 있으며, OPSEC 고려사항과 AD 개체를 통해 읽을 때의 주의 기준에 따라 더 적은 속성이 더 좋을 수 있습니다. 잠재적인 대상을 좁힐 때, 구체적인 결과를 얻기 위해 와일드카드를 사용하지 않고 이동할 가능성이 높습니다.\n\n와일드카드를 사용하는 또 다른 이점은 찾고 있는 내용을 알아보기 어렵게 만들기 위해 부분 단어를 사용할 수 있다는 것입니다. 예를 들어, password 또는 administrator를 검색하는 대신 *sword* 또는 *minis*와 같이 검색할 수 있습니다.\n\n\n<div class=\"content-ad\"></div>\n\n## 사용자\n\nAD에서 사용자를 찾는 것은 복잡할 수 있습니다. 특히 도메인이 사용자 이름 대신 사용자명을 사용하지 않을 때는 더욱 그렇습니다. 많은 경우에, 사용자들은 입사할 때 이름과 직접적으로 연결되지 않는 고유한 식별자를 부여받습니다. 사용자를 쿼리할 때 명심해야 할 중요한 점은 컴퓨터 객체도 사용자로 간주된다는 것입니다. 쿼리에 따라 결과에서 컴퓨터를 제외해야 할 수도 있습니다.\n\n이 예에서는 w가 이름에 포함된 모든 사용자 객체를 반환하는 쿼리를 보여줍니다:\n\n![image](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_6.png)\n\n<div class=\"content-ad\"></div>\n\n\ndsquery * -filter “(&(objectclass=user)(!(objectclass=computer)(name=*W*)))” -attr name samaccountname -d 192.168.88.195\n\n시스템 관리자가 관리 기능과 일상적인 사용을 위한 서로 다른 계정을 가지는 것이 일반적입니다. 이와 같은 쿼리를 사용하면 -sa 또는 -da와 같은 추가 권한을 나타내는 이름을 가진 계정을 찾을 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_7.png)\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(&(objectclass=user)(name=*W*))” name samaccountname\n\n\n<div class=\"content-ad\"></div>\n\n이 ldapsearch 예제에서 보듯이 컴퓨터 개체가 사용자와 함께 반환되었습니다. ldapsearch에서 객체를 제외하는 것은 어렵기 때문에 *nix 시스템에서 ! 연산자는 특정한 의미를 갖습니다. 저는 이를 escape 하는데 성공한 방법을 찾지 못했습니다 (\\! 그리고 다른 여러 시도한 것들이 잘못된 필터를 반환했습니다).\n\n## 그룹\n\n그룹을 수동으로 찾고 추적하는 것은 매우 어려울 수 있습니다. 잘 구조화된 AD 환경에서는 세부적인 권한을 갖는 그룹들이 있을 것이며, 사용자들은 작업 요구에 따라 그룹에 배치될 것입니다. 또한, 또다른 복잡성 수준을 추가하는 중첩 그룹을 발견하기도 합니다. 특정 권한을 가진 그룹을 찾는 것은 명명 규칙과 용어를 모르는 경우 어려울 수 있습니다.\n\ndsquery에서는, 그룹 개체 유형을 사용하여 이름별로 그룹을 빠르게 찾을 수 있습니다. 와일드카드 개체 유형을 사용하면 사용자를 찾을 때 필요한 속성이 더 많이 반환됩니다. 아래는 이름에 *admin*이 포함된 그룹이 그룹 개체 유형을 사용하여 나열된 쿼리들입니다. 그런 다음, 그룹 이름에 *admin*이 포함된 그룹을 열거하는 와일드카드 유형을 사용하는 쿼리가 옵니다. 마지막으로, 특정 그룹인 Domains Admins가 선택되고 해당 그룹의 멤버가 (이 경우에는 한 명만) 나열됩니다.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_8.png)\n\ndsquery group -name *admin* -d 192.168.88.195\n\ndsquery * -filter “(&(objectclass=group)(name=*admin*))” -attr name samaccountname -d 192.168.88.195\n\ndsquery * -filter “(&(objectclass=group)(samaccountname=도메인 관리자))” -attr name samaccountname member -d 192.168.88.195\n\n\n<div class=\"content-ad\"></div>\n\nldapsearch에서는 구문이 dsquery와 매우 유사합니다. 아래는 이름에 *admin*이 포함된 그룹을 찾는 ldapsearch 구문입니다.\n\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(&(objectclass=group)(name=*admin*))” name samaccountname\n\n\n그룹에 대한 운영 참고 사항으로, 목록을 좁힐 때는 적은 속성으로 시작하고 확장하는 것이 좋습니다. 또한 그룹의 설명을 확인하는 것도 좋은 아이디어입니다. 그룹 이름에 사용된 약어나 줄임말에 대한 자세한 내용이 그룹 설명에 포함되어 있는 경우가 많습니다. 그룹 설명에서 약어나 줄임말을 설명하는 경우가 종종 있습니다.\n\n<div class=\"content-ad\"></div>\n\n## 컴퓨터\n\n내 경험상, 특정 컴퓨터를 찾거나 그룹 컴퓨터를 찾을 때는 일반적으로 이미 검색을 뒷받침할 정보가 있습니다. 다행히 컴퓨터를 찾는 것은 사용자를 찾는 것보다 쉽습니다.\n\ndsquery에서 컴퓨터 객체 유형이나 와일드카드를 사용할 수 있습니다. 컴퓨터 객체 유형을 사용하면 컴퓨터를 필터링하는 데 사용할 수 있는 여러 옵션이 있지만, 이 블로그에서는 이를 자세히 다루지는 않겠습니다. 와일드카드 객체 유형을 사용하면 출력이나 필터에 운영 체제(operatingsystem 속성)를 추가하는 것이 좋습니다. 이렇게 하면 시스템을 대상으로 선택할 때 매우 유용한 정보를 얻을 수 있습니다.\n\n아래 예시는 dsquery에서 이름에 DC가 포함된 컴퓨터 객체를 검색하는 방법을 보여줍니다. 가정은 도메인 컨트롤러가 환경에 표시되어 있다는 것입니다. 이 환경은 도메인 컨트롤러가 하나뿐이지만, 더 큰 환경에서는 많은 도메인 컨트롤러가 있을 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n\n<img src=\"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_10.png\" />\n\ndsquery computer -name *DC* -d 192.168.88.195\n\ndsquery * -filter “(&(objectclass=computer)(name=*DC*))” -attr name samaccountname operatingsystem -d 192.168.88.195\n\nLdapquery will be very similar, and again, I recommend adding the operating system attribute to the filter or output.\n\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_11.png\" />\n\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D 'PLANETEXPRESS\\SService' -w 'L1feD3@thSeamlessContinuum' -b 'DC=PLANETEXPRESS,DC=LOCAL' \"(&(objectclass=computer)(name=*DC*))\" name samaccountname operatingsystem\n\n\n대부분의 쿼리와 마찬가지로, 컴퓨터에 대한 모든 속성을 나열한 후 타겟팅하는 것을 권장합니다. 또한, 컴퓨터의 sAMAccountName은 이름에 $가 추가된 것입니다. 명령행을 사용할 때, 이것이 무슨 일을 하느냐에 따라 문제를 일으킬 수 있습니다.\n\n## 설명\n\n<div class=\"content-ad\"></div>\n\n도메인에서 잠재적인 대상에 대해 자세히 알아보는 좋은 방법은 설명으로 검색하는 것입니다. 종종 약어 및 머릿글이 설명에 나온다는 것을 알면 유용하며, 제한된 정보가 주어졌을 때 도움이 됩니다. 때로는 비밀번호가 설명에 심지어 포함되어 있을 수도 있습니다.\n\n이 쿼리를 위한 필터를 만들 때, 필요한 경우가 아니라면 개체 유형을 명시적으로 지정하지 않습니다. 결과가 조금 더 열리고 예상치 못한 상황이나 설정을 발견할 수 있습니다. 또한, 해당 속성으로 출력하는 설명을 반드시 포함해야 합니다. 왜냐하면 검색 중인 키워드나 구문이 있을 수는 있지만, 도움이 되지 않는 맥락 속에 있을 수도 있기 때문입니다.\n\n다음은 dsquery에서 password와 admin이 설명에 포함된 개체를 검색하는 몇 가지 예시입니다.\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_12.png)\n\n<div class=\"content-ad\"></div>\n\n아래는 표와 동일한 내용을 Markdown 형식으로 작성한 것입니다.\n\n\ndsquery * -filter “(description=*password*)” -attr name description -d 192.168.88.195\n\ndsquery * -filter “(description=*admin*)” -attr name description -d 192.168.88.195\n\n주의할 점은 출력물이 조금 더 길어진다는 점입니다. 이제 같은 쿼리를 ldapsearch로 살펴봅시다.\n\n\n위 내용을 참고해주시고, 필요하시면 질문해주시기 바랍니다.\n\n<div class=\"content-ad\"></div>\n\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(description=*password*)” name description\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_14.png)\n\n![이미지](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_15.png)\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(description=*admin*)” name description\n\n\n<div class=\"content-ad\"></div>\n\n상황에 따라서 약어만 주어지고 전체 이름을 알고 싶다면 그 설명에 약어가 나와있지 않을 수 있습니다.\n\n## 비밀번호 마지막 설정\n\npwdLastSet 속성은 대상이 되는 계정을 찾을 때 도움이 될 수 있습니다. 서비스 계정은 때때로 특정 기능에 필요하며 해당 기능에 따라 변경하기 어려울 수 있으므로 오래되고 간단한 암호를 가지고 있을 수도 있습니다. 이는 조직의 암호 정책이 제대로 시행되었는지를 빠르게 확인할 때도 유용합니다.\n\nDsquery 및 ldapsearch는 동일(=)이외의 비교를 허용합니다. 이 경우에는 pwdLastSet 속성이 특정한 양보다 작은 개체를 찾아야 합니다. 이 값은 에포크 시간에 저장돼 있기 때문에 읽기가 어렵습니다.\n\n<div class=\"content-ad\"></div>\n\n비록 이 도메인이 새롭지만, 여전히 dsquery에서 이 쿼리가 어떻게 보이는지 살펴볼 수 있습니다. 단순히 `를 사용한 쿼리는 작동하지 않으므로 `=가 필요합니다.\n\n![image](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_16.png)\n\ndsquery * -filter “(&(objectclass=user)(pwdlastset`=132655849658851779))” -attr name pwdlastset -d 192.168.88.195\n\nldapsearch에서도 쿼리를 수행할 때 `=를 사용해야 할 것입니다.\n\n<div class=\"content-ad\"></div>\n\n\n<img src=\"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_17.png\" />\n\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(&(objectclass=user)(pwdlastset`=132655849658851779))” name pwdlastset\n\n설명: 주로 시간을 얻는 데 관련된 운영 참고 사항이 있습니다. 온라인 변환기를 사용하여 시간을 얻고 변환할 수 있습니다. 또한 PowerShell 또는 Windows 명령 줄 (dsquery 예제에 표시된대로 w32tm.exe /ntte `에포크 시간`)을 사용하여 사람이 읽을 수 있는 버전을 얻을 수도 있습니다. 이전에 언급된 바와 같이, 이것은 클라이언트의 결과를 개선하는 데 확인하는 빠른 확인 사항이 될 수도 있습니다.\n\n## Member Of\n\n\n<div class=\"content-ad\"></div>\n\n멤버오브 속성으로 검색하는 것은 이미 약간의 정보가 있는 경우에 가장 적합합니다. 그룹 멤버십에 기반한 사용자를 찾는 데 매우 도움이 됩니다. 이미 그룹의 이름을 알고 있다면 당연히 속성에 그룹의 구성원을 나열할 수 있습니다. 그러나 필터를 결합하여 여러 그룹의 구성원인지 사용자를 확인할 수도 있습니다. 예를 들어 Domain Admins 및 Server Operators와 같이 여러 그룹의 구성원인 사용자가 있는지 확인할 수 있습니다.\n\ndsquery를 사용하여 그룹의 구성원인 사용자를 쿼리하는 방법은 다음과 같습니다:\n\n\n<img src=\"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_18.png\" />\n\ndsquery * -filter “(&(memberof=CN=Staff,DC=PLANETEXPRESS,DC=LOCAl)(memberof=CN=ShipCrew,DC=PLANETEXPRESS,DC=LOCAL))” -attr name memberof -d 192.168.88.195\n\n\n<div class=\"content-ad\"></div>\n\n쿼리를 위해 그룹의 완전한 distinguishedName이 필요할 수 있습니다. ldapsearch에서 비슷한 쿼리를 작성할 것입니다.\n\n![image](/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_19.png)\n\n```plaintext\nldapsearch -LLL -x -h DC-THESHIP.PLANETEXPRESS.LOCAL -p 389 -D ‘PLANETEXPRESS\\SService’ -w ‘L1feD3@thSeamlessContinuum’ -b ‘DC=PLANETEXPRESS,DC=LOCAL’ “(&(memberof=CN=Staff,DC=PLANETEXPRESS,DC=LOCAl)(memberof=CN=ShipCrew,DC=PLANETEXPRESS,DC=LOCAL))” name memberof\n```\n\n쿼리 중에 이 정보를 터미널이나 어플리케이션 외부에 저장하는 것이 중요합니다. 쿼리는 많은 공간을 차지할 수 있고 정보를 저장하면 추가 쿼리를 다시 실행할 필요가 없습니다.\n\n<div class=\"content-ad\"></div>\n\n# 옵션들\n\n## Dsquery\n\n쿼리 끝에 추가할 수 있는 여러 옵션이 있습니다. 위 쿼리에서 사용된 옵션들이거나 저가 가장 자주 사용하는 옵션들입니다.\n\n-attr\n\n<div class=\"content-ad\"></div>\n\n이것은 와일드카드 유형으로 사용할 수 있는 속성 필터입니다. -attr *을 사용하면 객체의 모든 속성을 출력할 수 있습니다. 특정 속성을 얻으려면 AD의 속성 이름(예: sAMAccountName, pwdLastSet 등)을 쉼표로 구분된 목록에 사용하면 됩니다. 일반적으로 저는 매우 넓은 범위의 객체 필터로 시작하여 속성을 좁혀 나갑니다. 대상 객체의 목록을 좁히는 동안 속성을 더 개방하여 추가 정보를 얻습니다. 매우 큰 AD 환경에 있을 때, 그리고 사용하는 C2 플랫폼에 따라 실제로 시간을 절약할 수 있습니다. 일반적으로 시작할 때는 아주 넓은 범위의 네트를 던져두고 더 많은 정보를 알게 되면 좁혀나갑니다.\n\n-d\n\n이것은 도메인 플래그이며 큰 도메인 환경에서 작업할 때 매우 유용할 수 있습니다. FQDN 또는 IP 주소로 쿼리할 서버를 지정할 수 있으며 환경이 허용된다면 다른 도메인으로 쿼리하는 데 사용할 수 있습니다. 다른 도메인 컨트롤러를 쿼리하면 흥미로운 데이터 점이 제공될 수 있습니다. 대부분의 데이터가 도메인 컨트롤러 간에 복제되지만 최종 로그인은 항상 복제되지 않는 경우가 있습니다. 특정 사용자 또는 사용자가 마지막으로 로그인한 시간을 찾고 있다면, 인증한 도메인 컨트롤러에 따라 다른 답을 얻을 수 있습니다.\n\n-u -p\n\n<div class=\"content-ad\"></div>\n\n이 두 가지 플래그는 AD 쿼리에 사용할 사용자 이름과 비밀번호를 지정하는 데 사용할 수 있어요.\n\n-limit\n\n큰 도메인에서 작업할 때 유용한 다른 옵션입니다. 기본적으로 dsquery의 결과는 처음 100개로 제한됩니다. 0으로 설정하면 쿼리 결과가 모두 반환됩니다. 제가 이를 운영에 사용하는 다른 방법은 한 번에 결과를 반환하기 전에 리미트를 1로 설정해서 필터와 옵션이 올바르게 설정되었는지 확인하는 것이에요.\n\n## Ldapsearch\n\n<div class=\"content-ad\"></div>\n\nLdapsearch에는 블로그를 작성할 만큼 충분한 옵션이 있습니다. 여기에서 사용되거나 더 유용한 옵션에도 초점을 맞출 것입니다.\n\n- L(L)(L)\n\n이 옵션은 제 모든 ldapsearch 명령어의 시작 부분에 있습니다. 출력에서 일반 LDAP 정보를 제거합니다. 세 가지 레벨이 있으며, 일반적으로 모든 정보를 제거하는 것을 선택하였습니다. 정보를 제거하면 출력물이 더 간결해지기 때문입니다.\n\n- x\n\n<div class=\"content-ad\"></div>\n\n간단한 인증 (즉, 사용자 이름 및 비밀번호)을 사용하므로 Simple Authentication and Security Layer (SASL)이 아닙니다. 이 예시에서는 사용자 이름과 비밀번호를 사용해야 했지만 항상 해당 사례가 아닐 수 있습니다.\n\n-h\n\n질의를 실행할 대상 호스트를 지정하는 데 사용합니다. 예시로 사용된 환경에서는 도메인 컨트롤러가 하나만 있어 일관성이 있었습니다.\n\n-p\n\n<div class=\"content-ad\"></div>\n\n일반적으로 LDAP 서버가 청취하는 포트 번호를 지정하세요. LDAPS의 경우 보통 389 또는 636입니다만, 확인이나 문제 해결 중에는 미리 확인하는 것이 좋습니다.\n\n-D\n\n이는 LDAP 디렉토리에 바인딩할 distinguishedName입니다. -x 옵션을 사용하지 않는 경우 서버는 이 값을 무시할 것입니다.\n\n-w -W -y\n\n<div class=\"content-ad\"></div>\n\n모두 비밀번호 관련 사항입니다. 예제에서 -w를 사용한 이유는 C2를 통해 사용 중이시라면 이것이 필요한 옵션이기 때문입니다. C2를 사용할 때 비밀번호를 입력할 방법이 없는 경우가 많기 때문입니다. 명령을 통해 평문 비밀번호를 보내는 것은 좋은 실천 방법이 아니지만, 비밀번호를 입력할 수 있는 방법이 없으면 쿼리가 완료되지 않을 수 있습니다. 상호 작용하는 경우 -W 옵션을 사용하여 비밀번호를 요청할 수도 있습니다. 또는 비밀번호 파일을 사용할 수 있는 -y 옵션을 사용할 수도 있습니다.\n\n-b\n\n쿼리의 검색 베이스를 지정하는 데 사용됩니다. 일반적으로 도메인에 대한 식별 이름이겠지만 쿼리에 따라 더 세부적으로 좁힐 수도 있습니다.\n\n# 결론\n\n<div class=\"content-ad\"></div>\n\n이것은 AD를 질의하는 가장 쉬운 방법도 가장 최적의 방법도 아닙니다. 시작부터 이렇게 말씀드리듯이 BloodHound나 PowerView와 같은 도구들이 이에 더 적합합니다. dsquery나 ldapsearch를 사용해야 하는 상황에 처했을 때, 이 안내서가 여러분이 이러한 쿼리를 어떻게 만들어야 하는지 연구하는 시간을 조금이나마 절약할 수 있도록 도와줄 것입니다. 이 두 도구에 대해서 다뤄야 할 쿼리와 옵션은 훨씬 더 많습니다. 나는 내 자신의 도메인 설정을 마무리하고 이 블로그를 쓰고 정신건강을 유지하려고 노력하는 힘든 경험을 견디고 나면, 추가 정보를 포함한 후속 글을 작성할 수도 있습니다.\n\n여기서 찾고 계신 것을 찾지 못하셨나요? 트위터로 연락 주시거나 SpecterOps에 연락 주세요. 추가 정보를 포함한 후속 블로그가 언젠가 공개될 예정이며, 여러분의 제안을 환영합니다.","ogImage":{"url":"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_0.png"},"coverImage":"/assets/img/2024-06-20-AnIntroductiontoManualActiveDirectoryQueryingwithDsqueryandLdapsearch_0.png","tag":["Tech"],"readingTime":18},{"title":"윈도우 포렌식 USB 장치 프로파일링","description":"","date":"2024-06-20 14:45","slug":"2024-06-20-WindowsForensicsUSBDeviceProfiling","content":"\n\n# 개요:\n\nUSB 장치 프로파일링은 조사자가 숙지해야 할 전통적인 디지털 포렌식 활동 중 하나입니다. 클라우드 저장소 애플리케이션의 널리 퍼진 사용에도 불구하고, USB는 여전히 악성 소프트웨어 전달 및 데이터 유출 수단으로 사용됩니다. 이 기사에서는 USB를 식별하고, 사용 중일 때 USB와 관련된 모든 활동을 사용자에게 연관시키는 단계를 다룰 예정입니다. 다음은 USB 장치에 대해 알고 싶은 목록입니다:\n\n```js\n1. 제조업체 및 제품 ID\n2. iSerialNumber/ParentIdPrefix\n3. Friendly name, vendor, product, and version\n4. 장치가 처음/마지막으로 연결된 시간\n5. 장치가 마지막으로 제거된 시간\n6. 볼륨 이름\n7. 마지막으로 마운트된 디렉토리 드라이브 문자\n8. 볼륨 GUID, 필요한 경우\n9. 장치와 연관된 사용자 계정\n10. 볼륨 시리얼 번호\n```\n\n# 현재 구성 설정 결정하기\n\n<div class=\"content-ad\"></div>\n\n시스템 하이브에는 시스템 구성 데이터를 저장하는 ControlSet00X라는 키가 있습니다. 컴퓨터를 활용하는 동안, 현재 키의 버전은 CurrentControlSet으로 메모리에 저장되어 오프라인 하이브에 표시되지 않습니다. 올바른 데이터셋을 확인하려면 SYSTEM\\Select\\LastKnownGood를 검사하여 어떤 ControlSet을 조사해야 하는지 결정해야 합니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_0.png)\n\n여기에서 LastKnownGood 값이 1로 설정되어 있어 ControlSet001과 작업할 것입니다.\n\n# SYSTEM\\CurrentControlSet\\Enum\\USB\n\n<div class=\"content-ad\"></div>\n\nUSB 키는 장치 유형과 관계없이 외부 장치에 대한 유용한 정보를 저장하는 종합물입니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_1.png)\n\n레지스트리 탐색기에는 키를 분석하는 프로세스를 가속화하는 일부 내장 플러그인이 있습니다. USB 키를 살펴볼 때 이 도구는 모든 하위 키에 대한 고수준 정보를 추출하고 위의 스크린샷과 같은 테이블 형식으로 집계합니다. 다음 사항을 보고합니다:\n\n- 타임스탬프: 연결된 하위 키에 대한 마지막 쓰기 시간\n- 하위 키의 이름 (참고: 제조업체 및 제품 ID, VID/PID에 따라 이름이 지정됨)\n- 일련 번호: 이 값은 iSerialNumber이며 장치의 펌웨어에 하드 코딩되어 있습니다.\n- ParentIdPrefix: 이 값은 장치가 USB 연결 SCSI 장치 (UASP)인 경우에만 나타납니다.\n- 서비스: 장치 유형\n- 기타...\n\n<div class=\"content-ad\"></div>\n\nUSBSTOR 장치인 VID_0781 및 PID_5581을 계속 검사할 것입니다. 이전에 VID/PID를 사용하여 USB의 제조사와 모델을 DeviceHunt에서 확인해보세요.\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. 제조사: SanDisk, 제품: Ultra\n```\n\n## SYSTEM\\CurrentControlSet\\Enum\\USB\\VID_0781&PID_5581\n\n레지스트리 탐색기에 의해 보고된 고수준 정보가 유용하게 사용됩니다. 하지만 좀 더 세부적인 정보는 하위 키에 포함되어 있습니다.\n\n<div class=\"content-ad\"></div>\n\n이전에 언급했듯이 각 장치는 VID와 PID로 식별된 SYSTEM\\CurrentControlSet\\Enum\\USB 하위 키를 생성합니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_2.png)\n\n조사 중인 장치를 확장하면 다음 하위 키의 이름으로 장치의 iSerialNumber가 표시됩니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_3.png)\n\n<div class=\"content-ad\"></div>\n\n아래는 Markdown 형식으로 변환되어 있습니다:\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_4.png)\n\n$iSerialNumber 키를 검사하면 다음과 같은 추가 정보가 확인됩니다:\n\n- DeviceDesc: 장치는 bulk-only 전송, 대량 저장장치입니다\n- Service: USBSTOR (USB 저장 장치 프로토콜)입니다\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_5.png)\n\n\n<div class=\"content-ad\"></div>\n\n흥미로운 정보 중 상세 정보는 하위 키에서 나옵니다: Properties\\'83da6326–97a6–4088–9453-a1923f573b29'. 여기서는 장치가 처음 연결된 시간, 마지막 연결된 시간 및 시스템에서 마지막으로 제거된 시간을 확인할 수 있습니다.\n\n![이미지 1](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_6.png)\n\n![이미지 2](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_7.png)\n\n![이미지 3](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_8.png)\n\n<div class=\"content-ad\"></div>\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. Vendor: SanDisk, Product: Ultra\n4. First Connect: 2024-06-13, 14:06:41\n   Last Connect:  2024-06-13, 15:22:23\n5. Last Removal Time: 2024-06-13, 20:36:31\n```\n\n## 친환경적인 이름 및 버전 번호 확인\n\n장치의 친환경적인 이름과 버전 번호를 얻으려면 USBSTOR 키 아래를 살펴보면 됩니다. 버전 번호는 HardwareID 값에 있습니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_9.png)\n\n<div class=\"content-ad\"></div>\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. Friendly Name: USB SanDisk 3.2Gen 1 USB Device\n   Vendor: SanDisk, Product: Ultra, Version: 3.2Gen1\n4. First Connect: 2024-06-13, 14:06:41\n   Last Connect:  2024-06-13, 15:22:23\n5. Last Removal Time: 2024-06-13, 20:36:31\n```\n\n## 볼륨 정보 확인\n\nSOFTWARE 하이브에서 Windows Portable Devices를 찾아 볼륨 이름을 얻을 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_10.png)\n\n\n<div class=\"content-ad\"></div>\n\n볼륨 GUID를 얻으려면 SYSTEM\\MountedDevices 아래를 살펴볼 수 있습니다.\n\n![이미지](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_11.png)\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. Friendly Name: USB SanDisk 3.2Gen 1 USB Device\n   Vendor: SanDisk, Product: Ultra, Version: 3.2Gen1\n4. First Connect: 2024-06-13, 14:06:41\n   Last Connect:  2024-06-13, 15:22:23\n5. Last Removal Time: 2024-06-13, 20:36:31\n6. Volume Name: New Volume\n7. Last Mount Point/Drive letter: TBD\n8. Volume GUID: {b445a977-284b-11ef-b163-c333a7edd79a}\n```\n\n## 장치가 사용자 계정과 관련이 있는지 확인하기\n\n<div class=\"content-ad\"></div>\n\n이제 우리가 볼륙 GUID를 알았으니 해당 값과 NTUSER 하이브를 교차 참조할 수 있습니다. 이를 위해 MountPoints2 아래를 살펴봐야 합니다.\n\n![image](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_12.png)\n\n볼륙 GUID가 존재하기 때문에 두 가지 중 하나는 반드시 사실일 것입니다:\n\n- 사용자가 장치가 연결된 상태에서 활성으로 로그인되어 있었음\n- 장치가 연결된 시점에서 사용자가 마지막으로 로그인되어 있었음\n\n<div class=\"content-ad\"></div>\n\n어떤 시나리오가 유효한지 확인하려면 시스템의 보안 이벤트 로그를 확인하여 사용자가 로그인한 시간을 판단해야 합니다. 이를 위해 이벤트 ID: 4624/4647 또는 4624/4634 사이의 타임스탬프 차이를 취하여 사용자의 로그인/로그오프 시간을 확인할 수 있습니다. 로긴/로그오프 이벤트에서 LogonID가 일치하는지 확인하세요.\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. Friendly Name: USB SanDisk 3.2Gen 1 USB Device\n   - Vendor: SanDisk, Product: Ultra, Version: 3.2Gen1\n4. First Connect: 2024-06-13, 14:06:41\n   - Last Connect:  2024-06-13, 15:22:23\n5. Last Removal Time: 2024-06-13, 20:36:31\n6. Volume Name: New Volume\n7. Last Mount Point/Drive letter: TBD\n8. Volume GUID: {b445a977-284b-11ef-b163-c333a7edd79a}\n9. User Account Associated w/ the device: Ross\n10. Volume Serial Number: TBD\n```\n\n## 볼륨 일련 번호 가져오기\n\n볼륨 일련 번호(VSN)를 얻으려면 Microsoft-Windows-Partition/Diagnostic.evtx 로그를 참조하고 기기의 마지막 연결 시간을 교차 참조할 수 있습니다. 기억하세요, 레지스트리는 UTC 시간으로 기록하고 이벤트 로그는 로컬 시간으로 기록합니다. 이벤트 로그의 타임스탬프를 올바르게 해석하기 위해 SYSTEM\\CurrentControlSet\\Control\\TimezoneInformation를 확인하세요.\n\n<div class=\"content-ad\"></div>\n\nVSN은 Vbr0에 저장되어 있습니다. 또한, 분석 중인 장치가 NTFS 시스템이기 때문에 VSN을 찾으려면 offset 0x43를 살펴보아야 합니다. 바이트 순서도 잊지 말고, 리틀-엔디안 형식으로 저장되어 있을 겁니다.\n\n![이미지1](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_13.png)\n\n우리는 또한 Partition-4DiagnosticParser라는 오픈 소스 도구를 이용하여 장치의 iSerialNumber를 필터링하는 쉬운 방법을 사용할 수 있습니다.\n\n![이미지2](/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_14.png)\n\n<div class=\"content-ad\"></div>\n\n```js\n1. VID/PID: 0781, 5581\n2. iSerialNumber: 0401805d69c0bed0de932277ac861f044d10940c13885d7307a00cd7471423b\n3. Friendly Name: USB SanDisk 3.2Gen 1 USB Device\n   - Vendor: SanDisk, Product: Ultra, Version: 3.2Gen1\n4. First Connect: 2024-06-13, 14:06:41\n   - Last Connect:  2024-06-13, 15:22:23\n5. Last Removal Time: 2024-06-13, 20:36:31\n6. Volume Name: New Volume\n7. Last Mount Point/Drive letter: TBD\n8. Volume GUID: {b445a977-284b-11ef-b163-c333a7edd79a}\n9. User Account Associated w/ the device: Ross\n10. Volume Serial Number: 306B19C9\n```\n\n## Last Mount Point/Drive Letter Determination\n\n안녕하세요! 장치의 드라이브 문자를 레지스트리에서 확인하지 못했습니다. 그 드라이브 문자는 재사용되었기 때문입니다. 또한 이벤트 로그를 통해 확인할 수 없습니다. 있었던 시간의 이벤트가 덮어써졌기 때문이죠. 하지만 시스템에서 다양한 쉘 항목(예: LNK 파일)을 조사하고 그 중 일치하는 VSN을 포함하는 것이 가능한 접근 방식입니다. 토지 조사 이미지를 촬영할 때 쉘 항목을 복사해 낼 걸 그랬어요. 그때는 레지스트리와 이벤트 로그만 복사했습니다. 제 실수였죠. 여러분의 시스템에서 이를 수행하려면 이미지와 함께 LNK 아티팩트를 추출하는 것을 권장합니다.","ogImage":{"url":"/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_0.png"},"coverImage":"/assets/img/2024-06-20-WindowsForensicsUSBDeviceProfiling_0.png","tag":["Tech"],"readingTime":8},{"title":"브라우저 비교 결말 크로미움 기반 브라우저","description":"","date":"2024-06-20 14:42","slug":"2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers","content":"\n\n![이미지](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_0.png)\n\n브라우저 비교 시리즈의 이전 버전에서 몇 가지 인기 있는 브라우저와 최고의 Firefox 포크를 비교했고, 이번 마지막 편에서는 성능과 기능을 기반으로 최고의 Chromium 기반 브라우저들을 비교할 것입니다. 성능 벤치마크 세부 정보는 기사 말미에 제공됩니다.\n\n## 7. 오페라 & 오페라 GX\n\n![이미지](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_1.png)\n\n<div class=\"content-ad\"></div>\n\n오페라 및 오페라 GX의 UI/UX가 최고인데, 각기 다른 대상을 위해 매력적인 독특한 외모를 가지고 있습니다. 그러나 불필요한 기능의 과도한 양과 특정 측면에서의 불안정성은 경험을 악화시킵니다.\n\n✅ 장점: 내장된 광고 차단기가 잘 작동하며, 작업 공간은 특정 유형의 사용자에게 좋을 수 있습니다. 그렇지만 PIP 모드는 이 목록의 다른 모든 브라우저와 비교할 때 매우 특별합니다. 탭을 전환할 때 현재 실행 중인 비디오가 자동으로 팝업되며, 다른 Chromium 기반 브라우저에서 누락된 시청 중 플레이어를 통해 시청하는 기능이 제공됩니다. 파일 업로드를 시도할 때 빠르게 최근 다운로드한 파일을 선택할 수 있는 빠른 대화 상자가 유용합니다. 오페라 GX의 모드(사실 장치)와 CPU 및 RAM 제한자와 같은 기능도 특정 상황에서 유용할 수 있습니다.\n\n❌ 단점: 실제로는 프록시인 VPN은 속도가 매우 느립니다. 사실, 크롬 스토어의 VPN 확장 프로그램이 더 빠른 속도를 제공합니다. 투명 모드로 인해 비디오가 과포화되고 과도하게 날카롭게 보이며, HD 비디오가 원래보다 나쁘게 보이게됩니다. 핀보드는 좋은 개념이지만 동기화에 매우 오랜 시간이 걸립니다. AI 기능은 때로는 어색할 수 있습니다. 유튜브와 같은 일부 웹 사이트가 이유를 알 수 없이 오페라에서 느리게로드됩니다.\n\n이것은 감정이 교차하는 느낌을 남기네요.\n샤프한 기능을 원한다면, UI 또는 모드 또는 CPU 및 RAM 제한이 필요하다면 오페라 GX를 선택하십시오. 그렇지 않으면 오페라가 더 나은 선택일 것입니다.\n\n성능 점수 : 오페라 GX - 977.09 | 오페라 - 957.24\n\n<div class=\"content-ad\"></div>\n\n디자인: 5/5\n성능: 2/5\n안정성: 3/5\n다이어트 체험: 2/5\n\n## 6. 토륨\n\n![이미지](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_2.png)\n\n토륨은 멋진 프로젝트입니다. 개발자에게 큰 박수를 보냅니다.\n\n<div class=\"content-ad\"></div>\n\n✅ 장점: 정말 빠르며, 이 목록에서 성능 2위를 기록하고 있어요. 최근 논란이 있었지만, Mercury와 Thorium 브라우저는 개발자인 그들의 브라우저로서 객관적으로 매우 뛰어난 성능을 자랑해요.\n\n❌ 단점: 안정성은 항상 문제로 남아 있습니다. 유지 보수 및 업데이트를 주로 한 사람이 하고 있어서 그런데요. Thorium의 디자인은 약간 웃긴데, 이상하게 색칠된 아이콘이 있어요. (어두운 모드에서 컨트라스트 비율 안좋아요)\n\n벤치마크 점수: 1239.81\n\n디자인: 3/5\n성능: 5/5\n안정성: 2/5\n무난한 경험: 5/5\n\n<div class=\"content-ad\"></div>\n\n## 5. 크로미움 및 비구글 크로미움\n\n![크로미움 및 비구글 크로미움 비교](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_3.png)\n\n크로미움과 비구글 크로미움의 기능에는 큰 차이가 없기 때문에 둘을 하나의 섹션으로 그룹화했습니다.\n\n✅ 장점: 두 브라우저 모두 성능이 매우 우수하지만 크로미움이 일반적으로 벤치마크에서 더 높은 점수를 받았습니다. Google 통합이 거슬리지 않는다면 크로미움을 사용해도 좋습니다. 트래킹을 완전히 떨어져 나가고 싶은 사용자를 위해 비구글 크로미움이 좋은 선택일 것입니다. 두 브라우저는 동일한 기능을 갖추고 있으며, 비구글 크로미움은 Google의 간섭 없이 제공되므로 이것이 좋을지 나쁠지는 당신에게 달렸습니다.\n\n<div class=\"content-ad\"></div>\n\n❌ 단점: 이 두 프로젝트는 Windows용으로 개발자들이 공식 빌드를 제공하지 않습니다. 그러므로 코드를 직접 컴파일해야 하며, 이는 보통 사용자를 위한 것이 아니거나 프로젝트 자체만큼 안전하지 않은 커뮤니티 빌드에 의존해야 할 수도 있습니다. 업데이트가 문제가 될 수 있습니다.\n\nUngoogled Chromium에서 벤치마크를 실행하는 동안, 브라우저를 여전히 충분히 잘 사용할 수 있었는데 예상치 못했던 점은 성능이 일부 병목 현상을 겪고 있어 실제 성능이 점수보다 약간 높아야 한다는 결론을 내리게 했습니다. 즉, Chromium과 동등한 성능이어야 합니다.\n\n벤치마크 점수: Chromium - 1125.86 | Ungoogled Chromium - 1020.86\n\n디자인: 4/5\n성능: 4/5\n안정성: 3/5\n무거운 경험 없음: 5/5\n\n<div class=\"content-ad\"></div>\n\n## 4. Microsoft Edge\n\n![image](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_4.png)\n\n✅ 장점: Edge는 상당히 좋은 Copilot 통합 기능과 강력한 PDF 리더-편집기가 기본 제공됩니다. Windows의 Copilot은 현재 열려 있는 웹페이지나 PDF 파일에 기반하여 직접 질문에 답할 수도 있습니다. 또한 두 웹사이트를 동시에 볼 수 있는 분할 화면 모드와 세로 탭도 제공합니다. 현재 쇼핑 중인 웹사이트에서 적용 가능한 쿠폰 목록을 보여주는 강력한 쇼핑 기능도 포함되어 있습니다. 성능도 괜찮습니다.\n\n❌ 단점: 기능이 많아서 때로는 디자인이 혼잡해 보일 수 있습니다. 때때로 브라우저가 느린 느낌을 줄 수도 있습니다.\n\n<div class=\"content-ad\"></div>\n\nEdge는 여러 가지를 시도하려고 노력하지만, 그 중 많은 부분에서 꽤 괜찮습니다. 하지만, 원시적이고 깔끔한 브라우징 경험을 제공하는 데는 부족합니다. 다른 것들과 비교해 뛰어나다거나 특별한 것은 없지만 그저 그런 선행자입니다. 전반적으로, Edge는 꽤 괜찮은 브라우저입니다.\n\n벤치마크 점수: 973.92\n\n디자인: 4/5\n성능: 3/5\n안정성: 5/5\n무거운 경험: 3/5\n\n얻는 점수에 따르면 5위에 속해야 하지만, 일부 기능들 때문에 4위에 속해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n## 3. 비발디\n\n![이미지](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_5.png)\n\n오랫동안 비발디를 사용하지 않았는데, 이제 사용해보니 상쾌한 느낌이었어요.\n\n✅ 장점: 비발디는 맞춤 설정에 대한 탁월한 성능을 보여줍니다. 브라우저를 사용자 취향에 맞게 조정하는 데 도움이 되는 다양한 설정이 있어요. 아마도 현재까지 가장 맞춤화된 Chromium 기반 브라우저일 거에요. 기본 UI의 일부 요소는 굉장히 오래된 느낌을 주고, 일부 요소는 굉장히 현대적으로 보입니다. 또한 메일 클라이언트, 캘린더 및 RSS 피드 리더가 기본으로 제공되어요. 공간 탭 탐색과 탭 쌓기 같은 독특한 기능도 있어요. 또한 매우 안정적인 브라우저입니다.\n\n<div class=\"content-ad\"></div>\n\n❌ 단점: 성능 면에서는 더 나은 것을 얻을 수 있습니다. 비발디는 웹글을 사용하는 그래픽 집중 작업에 특히 적합하지 않습니다. 또한 초기화되고 깨끗한 브라우징 경험을 제공하지 않습니다.\n\n장점이 충분히 인상적이어서 이 브라우저를 3위에 올려놓습니다. 비록 이 목록에서 가장 느린 브라우저이지만요. 우리 2위 후보와 동일한 점수를 받았다고 생각해보세요.\n\n벤치마크 점수: 939.16\n\n디자인: 5/5\n성능: 2/5\n안정성: 5/5\n무거운 경험 없음: 3/5\n\n<div class=\"content-ad\"></div>\n\n## 2. 크롬\n\n![크롬](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_6.png)\n\n✅ 장점: 크롬은 모든 크로미움 브라우저 중에서 여전히 최고의 UI와 성능을 갖고 있으며, 대체로 모든 기준을 충족합니다. 만약 구글 계정을 광범위하게 사용한다면, 크롬은 매우 부드럽게 통합되어 현재 열려 있는 탭, 히스토리, 즐겨찾기를 동기화하고 다른 기기로 탭을 전송할 수 있습니다.\n\n❌ 단점: 장점은 사용자에 따라 단점이 될 수도 있습니다. 구글 통합 기능이 이 브라우저에 깊게 내재화되어 있습니다. 크롬을 좋아하지만 구글의 통합 기능은 별로라고 느끼는 경우, 최신 빌드를 찾아 다운로드하기 위해 조금만 노력하여 크로미움을 검토해 볼 수 있습니다. 그 외에는 크롬이 충분히 좋습니다.\n\n<div class=\"content-ad\"></div>\n\n## 성능 평가\n\n- Benchmark 점수: 1050.76\n- 디자인: 5/5\n- 성능: 4/5\n- 안정성: 5/5\n- 블로트 없는 경험: 3/5\n\n## 1. 브레이브\n\n![이미지](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_7.png)\n\n<div class=\"content-ad\"></div>\n\n장점: Brave는 이 목록 중에 아무것도 아닌 것처럼 벤치마킹 테스트를 훌륭하게 통과합니다, 특히 webgl 및 캔버스 렌더링에 관한 부분에서. 이 브라우저는 일상적인 사용에서 매우 빠르게 느껴지며 오픈 소스입니다. 처음에 출시됐을 때는 거들 먹거리는 것이라 여겼지만, 예상보다 훨씬 오래 지속되었고 어떠한 주요 기술 기업도 후원하지 않음에도 매우 안정적이었습니다. 선택 사항으로 세로 탭이 함께 제공됩니다.\n\n단점:\n암호화폐와 관련된 일부 기능, 사용자에 따라 미달리는지 생각될 수 있는 유료 VPN, 그리고 크롬이나 오페라의 UI와는 거리가 있는 조잡한 UI가 함께 제공됩니다.\n\n만약 이 글이 Brave에 의해 후원되었다는 생각이 들면, 그렇지 않습니다. 벤치마크를 직접 실행하여 차이를 확인할 수 있습니다.\n\n디자인: 3/5\n성능: 5/5\n안정성: 5/5\n무거운 경험: 4/5\n\n<div class=\"content-ad\"></div>\n\n여기 각 브라우저의 성능을 비교한 간략한 내용입니다 -\n\n![Browser Comparison](/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_8.png)\n\n일부 세부 정보 -\n\n벤치마킹 테스트는 AMD Ryzen 5 7535HS 및 8GB DDR4 RAM, 512GB M.2 SSD를 탑재한 Windows 11 기기에서 UBlock Origin이 모든 브라우저에 설치된 상태로 Basemark에서 수행되었습니다.\n\n<div class=\"content-ad\"></div>\n\n지금은 브라우저 비교 시리즈를 마칩니다. 다음 글은 Windows에서의 초보자를 위한 라이싱 가이드가 될 예정이에요. 기대해 주세요!\n\n브라우저를 비교한 제 글을 확인해 보세요. 특히 파이어폭스 포크에 관한 내용이 담겨 있어요.","ogImage":{"url":"/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_0.png"},"coverImage":"/assets/img/2024-06-20-BrowsercomparisonfinaleChromiumbasedbrowsers_0.png","tag":["Tech"],"readingTime":6},{"title":"Times Up, 타임랩스 HackTheBox에서 어드민으로 가는 길, 브루트포스터 해킹과 라프스 해킹으로 웃음을 전해보았어","description":"","date":"2024-06-20 14:41","slug":"2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox","content":"\n\n그 테이블 태그를 마크다운 형식으로 변경하십시오.\n\n<div class=\"content-ad\"></div>\n\n가장 먼저, 저는 어떤 것을 다루고 있는지 확인하기 위해 nmap 스캔을 실행했습니다. Nmap, 믿을 수 있는 네트워크 매퍼,는 smb, ldap 및 Kerberos와 같은 여러 개의 오픈 포트를 보여주었는데, 이는 '블루 스크린 오브 데스'보다 더 '윈도우 머신'을 크게 외치고 있습니다.\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_1.png)\n\nSMB 공유 열거\n\nSMB 포트가 열려 있어서, null 자격 증명을 사용하여 smbclient를 통해 smb 공유를 열거할 억제할 수 없는 욕구가 생겼습니다. 그리고 'Shares'라는 이름이 붙은 드문한 공유가 있었습니다.\n\n<div class=\"content-ad\"></div>\n\n![image1](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_2.png)\n\nShares 디렉토리에 대해 궁금증을 느껴 'Shares' 디렉토리로 들어가 보았고, DEV 디렉토리 안에 winrm 백업을 찾아내었습니다. 파일을 다운로드했지만, 파일이 암호로 보호되어 있는 것을 깨닫자 흥분이 잠시 가셨어요.\n\n![image2](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_3.png)\n\n<div class=\"content-ad\"></div>\n\n집 비밀번호를 크랙하기\n\n비밀번호가 없어? 문제 없어요. 저는 zip2john을 사용하여 zip을 크랙 가능한 형식으로 변환하고 그런 다음 록유(wordlist)를 사용하여 존 더 리퍼(john the ripper)를 실행했어요. 바로 그래요! 비밀번호가 크랙되었어요.\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_4.png)\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_5.png)\n\n<div class=\"content-ad\"></div>\n\nPFX 파일 잠금 해제하기\n\nZip 파일 안에는 .pfx 파일이 있었는데, 이 파일도 비밀번호가 필요했습니다. 궁금해하는 분들을 위해 .pfx 파일은 암호화와 인증에 사용되는 인증서와 개인 키가 들어 있습니다. pfx2john을 사용하여 해시 값을 얻었고 다시 한 번 john과 rockyou를 사용하여 해독했습니다.\n\n[이미지1](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_6.png)\n\n[이미지2](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_7.png)\n\n<div class=\"content-ad\"></div>\n\n인증서 및 키 생성\n\npfx 패스워드를 손에 쥐고 openssl을 사용하여 인증서와 키를 추출했습니다.\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_8.png)\n\n\"Legacyy\"로 로그인하기\n\n<div class=\"content-ad\"></div>\n\n이 키와 인증서를 사용하여 이블 윈알엠으로 세션을 시작하여 \"legacyy\" 사용자로 액세스를 얻었습니다.\n\n\n<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_9.png\" />\n\n\n콘솔 히스토리 분석\n\n안으로 들어가서 PowerShell 콘솔 히스토리를 살펴보고 또 다시 행운을 가졌습니다. svc_deploy 사용자의 자격 증명을 발견했습니다.\n\n<div class=\"content-ad\"></div>\n\n아래는 Markdown 형식으로 변환해 보겠습니다.\n\n\n<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_10.png\" />\n\n<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_11.png\" />\n\nLogging in as svc_deploy\n\nWith new credentials, I logged in as the svc_deploy user. Now, it was time to gather some serious intel.\n\n\n<div class=\"content-ad\"></div>\n\n![/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_12.png](<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_12.png\" />)\n\n샤프 하운드 배포하기\n\n저는 머신에 SharpHound를 다운로드하고 데이터 수집을 위해 실행했습니다. SharpHound는 미첵된 사용자를 위한 BloodHound에 사용되는 도구로, Active Directory 데이터를 수집하는 도구입니다.\n\n![/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_13.png](<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_13.png\" />)\n\n<div class=\"content-ad\"></div>\n\n\n![이미지1](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_14.png)\n\nBloodHound 분석\n\nBloodHound를 실행하여 SharpHound 데이터를 업로드하고 svc_deploy 사용자를 소유로 표시했습니다. \"Outbound Object Control\"에 대한 빠른 검색에서 svc_deploy가 Timelapse 도메인의 dc01의 로컬 관리자 비밀번호를 읽을 수 있는 LAPS Readers 그룹의 구성원임을 확인했습니다.\n\n![이미지2](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_15.png)\n\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_16.png)\n\n다이어그램에서 svc_deploy 사용자가 LAPS_READERS 그룹의 구성원이며 DC01.TIMELAPSE.HTB의 암호를 읽을 수 있음을 보여줍니다.\n\nLAPS 악용\n\nActive Directory의 LAPS(Local Administrator Password Solution)는 도메인 가입된 컴퓨터의 로컬 관리자 암호를 관리하는 기능입니다. AdmPwd 모듈을 사용하여 LAPS Readers 그룹의 구성원이 실제로 dc01의 LAPS 암호를 읽을 수 있음을 확인했습니다.\n\n\n<div class=\"content-ad\"></div>\n\n\n![image1](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_17.png)\n\n![image2](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_18.png)\n\nUsing AdmPWD module to extract password of Administrator user:\n\n![image3](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_19.png)\n\n\n<div class=\"content-ad\"></div>\n\n관리자 액세스 획들하기\n\n로컬 관리자 암호로 무장하고 마지막으로 evil-winrm을 사용했습니다. 이번에는 관리자 사용자로 로그인했습니다. 성공!\n\n![이미지](/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_20.png)\n\n루트 플래그 -`\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_21.png\" />\n\n결론:\n\nnmap 스캔부터 LAPS 이용까지, \"Timelapse\" 정복 여정은 도전과 승리의 롤러코스터였습니다. 각 단계마다 무차별 대입, 교묘한 열거 및 전략적 이용이 필요했습니다. 경험 많은 해커든 호기심 많은 초보자든, 이 가이드가 가치 있는 통찰과 재미로운 순간을 제공해줄 것으로 기대합니다. 해킹 즐겁게 하세요!","ogImage":{"url":"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_0.png"},"coverImage":"/assets/img/2024-06-20-TimesUpTimelapseHowIBrute-ForcedLAPS-edandLaughedMyWaytoAdminonHackTheBox_0.png","tag":["Tech"],"readingTime":6}],"page":"57","totalPageCount":113,"totalPageGroupCount":6,"lastPageGroup":20,"currentPageGroup":2},"__N_SSG":true}