{"pageProps":{"posts":[{"title":"개인정보 보호, 정치, 그리고 포르노","description":"","date":"2024-05-27 15:45","slug":"2024-05-27-Privacypoliticsandporn","content":"\n캐나다 정치가 아이스크림이라면, 저당량 네오폴리탄 맛일 것 같아요. 쇼콜라, 바닐라, 딸기 같은 세 가지 서로 다른 옵션이 있는데, 실제 맛과는 다르게 느껴질 수 있고 인공적인 후맛을 남길 수 있어요.\n\n보수당, 자유당, 신민당이 있지만, 마음이나 취향에 따라 아이스크림을 선택하는 것처럼, 캐나다 유권자들도 자신의 가치관과 포부를 가장 잘 대변하는 정당을 선택해요. 다른 정당들도 있지만, 이들은 열매맛 사탕처럼 인기가 없어요; 좋아하는 사람들은 정말로 좋아하지만, 대부분의 사람들은 시식조차 시도하지 않아요.\n\n우리 시스템은 매우 진한 바닐라 맛같아요; 캐나다는 입헌 군주국가이자 입헌 민주주의국가에요. 여왕과 총리가 있어요. 대통령도 선거단과 2차 개정안도 없어요. 북쪽 이웃국가는 미국의 양당 정치의 광적인 보도나 멜로드라마 같은 것은 없지만, 때로는 열기를 내고, 섭씨로도 측정하니 그리 나쁘게 보이지 않아요.\n\n1982년부터 시행된 우리의 비교적 새로운 권리와 자유 헌장은 우리의 표현의 자유가 절대적이지 않다고 규정해요. 헌장은 자유롭고 민주적인 사회에서 정당화된다면 특정 제약을 허용해요. 이는 캐나다 법이, 예를 들어 혐오 발언, 공공안전, 다른 권리와 자유를 보호하기 위해 필요하다면 표현에 제한을 가할 수 있다는 것을 의미해요.\n\n<div class=\"content-ad\"></div>\n\n리베럴당이 최근에 온라인 해심법안(C-63)을 도입하여 온라인 표현 규제를 확대하고 범죄 처벌을 강화했습니다. 이 법안은 성적 피해를 주거나 아동을 괴롭히는 콘텐츠, 폭력적 편견을 부추기거나 테러주의를 부추기는 콘텐츠, 즉 혐오를 조장하는 콘텐츠에 중점을 둔 디지털 안전위원회를 설립할 것입니다.\n\n그러나 이 법안의 타이밍은 더 이상 나빠질 수 없습니다.\n\n저스틴 트뤼도 총리의 인기 하락은 묵시적으로 못 박고, 그의 리베럴 정부는 온라인 Safety Comission의 체제를 구축하기 위해 5950만 캐나다 달러를 낭비했습니다. 이 돈은 캐나다 국경경비청이 COVID-19 시기에 여행자를 위해 세관 및 이민 신고를 용이하게 하고 백신 요구 사항을 정리하기 위해 사용하는 간단한 ArriveCan 앱에 소비된 것입니다. 이 모바일 어플리케이션의 초기 버전은 2년 전에 8만 달러만 사용되었는데, 이는 국가 기관의 매우 나쁜 관리 기록 뿐만 아니라 디지털 신원증명과 디지털 안전위원회의 미래 관리에 대한 어떠한 선의의 의지도 침해했다고 생각됩니다.\n\n보수당 지도자인 피에르 폴리에브르는 이 법안을 \"표현의 자유를 침해하는 공격\"으로 보기 때문에 이를 좋아하지 않습니다. 이 부분은 정당의 일부인 \"소수의 소수 집단\"이 \"결코 받아들일 수 없는 견해\"(예: Freedom Convoy)를 가지고 있을 수 있는데, 이미 그의 정당은 아동 보호에 대한 다른 영향을 가진 다른 접근 방식에 투자하고 있기 때문입니다.\n\n<div class=\"content-ad\"></div>\n\n보수당과 신민주당의 지지를 받아 독립적인 퀘벡 센터인 미빌드샤느가 S-210이라는 법안을 발의했습니다. 이 법안은 사용자가 사이트를 이용하기 전에 나이 확인을 하지 않아도 포르노 사이트를 형사상 책임을 물을 수 있도록 하는 내용이 포함되어 있습니다. 이 법안은 일부 식별 부분을 해석에 맡기기 때문에, 입법적으로 매우 문제가 될 수 있습니다. 현재 이 법안은 하원에서 검토를 기다리고 있습니다.\n\n이러한 논리는 외관상 설득력이 있지만, 이미 플레이보이 잡지를 구매할 수 없는 어린이들이 있기 때문에 문제가 됩니다. 2020년부터 플레이보이 사가 종이 재판판을 출판하지 않았기 때문이죠. COVID로 인해 센터폴드를 비롯한 많은 것들이 사라졌습니다.\n\n이 두 법안은 좋은 의도를 가지고 있으며, 아이들을 위한 온라인 안전 문제에 전념하는 것은 찬양 받을 만 합니다. 그러나 악마는 세부 사항에 있습니다. 시스템 설계적인 관점에서 보면, 선형 시스템(정부)이 혼돈된 시스템(인터넷)을 통제하려고 할 때 필요한 자원의 양이 거대하며 의도치 않은 결과를 예측하기 어렵습니다.\n\n다시 말해, 캐나다 정치인이 시민을 위한 디지털 신분증에 대해 이야기할 때마다 러시아 해커들은 날개를 달 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n# 위험한 곳, \"인터넷.\"\n\n왜 외계인들이 지구를 방문하지 않을까요?\n\n순진한 사람들은 제3종 접촉이 발생하지 않은 이유로 우주가 너무 방대하고, 우리가 알고 있는 삶이 적을 뿐만 아니라, 일부 문명만 화성 간 탐사에 관심이 있기 때문이라고 생각합니다.\n\n오, 페르미, 순수한 너드! 외계인들이 우리를 피하는 이유는 인터넷에 접근할 수 있기 때문입니다.\n\n<div class=\"content-ad\"></div>\n\n사이버 공간에 대한 것은, 당신이 더 큰 참혹한 악당과 악당들의 둥지를 더 이상 찾을 수 없다고 생각할 때, 더 나쁜 것으로부터 두 번의 클릭만 떨어져 있다는 점입니다. 만약 당신이 어둠의 레딧에 떨어진다면, E.T.의 충고를 따라 가능한 빨리 \"집으로 돌아가\"세요.\n\n인터넷을 위한 설명서는 없습니다.\n\n우리 대부분은 기술이 발전하는 동안 디지털 리터러시를 형성해야 했던 GenXer입니다. 옛날 AOL 트라이얼과 404 에러. 우리는 디지털 이민자였습니다. 우리 자식들과 손자, 손녀들은 디지털 네이티브였습니다. 그것이 그들이 물려받은 땅입니다; 많은 양육 결정처럼, 기술에 대한 접근과 우리 집 앞에 가져올 수 있는 것에 대한 접근은 정서적이고 편향적일 수 있습니다.\n\n당신이 당신이 이미 살고 있는 것보다 더 복잡한 성인 생활에 대비하기 위해 아이들에게 세계의 위험을 어떻게 노출시키나요? 현재의 보호장치와 더 많은 보호장치가 해답인가요, 아니면 모든 것이 교육, 기준 개발 및 자녀와 성숙한 대화에 관한 것인가요? 디자이너, 정부, 그리고 사회가 멈추고 부모들이 결정할 수 있는 지점은 어디인가요?\n\n<div class=\"content-ad\"></div>\n\n나이와 교육수준은 디지털 소양(source)과 정치적 견해를 예측하는 좋은 지표입니다. 캐나다에서는 63%의 노인이 인터넷과 디지털 기술을 사용하지 않거나 기초적인 사용자로 분류되며, 고등학교 졸업생도 40%가 해당됩니다. 반면, 15~34세의 사용자 중 77%는 숙련이나 고급 사용자로 분류되며, 총주의자 학위 이상을 가진 캐나다인의 76%도 해당됩니다.\n\n![그림](/assets/img/2024-05-27-Privacypoliticsandporn_0.png)\n\n민주주의에서 이 디지털 격차는 오류인가 특징인가요? 기술에 대한 불신과 두려움을 자본화하는 어떤 당이 이길 수 있는 주장을 갖게 되겠죠. 결국, 누가 화소화된 성기로부터 어린이를 보호하지 않겠습니까?\n\n\"내 견해로는\" = 편향을 인정하는 것.\n\n<div class=\"content-ad\"></div>\n\n진짜 문제는 그들이 그것에 접근하는 방식이 정말로 좋은 의도, 비교립 체제가 아니며, 미래 중심적인지입니다.\n\n어린이들의 안전 뿐만 아니라 일관되게 요구, 창조 및 인터넷의 어두운 구석을 가능하게 하는 사회의 종류를 분석하는 논리적인 논쟁이 가능할까요?\n\n당신이 입법을 추진할 권한이 있다면, 무엇을 제안하겠습니까? 범죄화, 자아 표현, 혹은 치료?\n\n# 통계에 따르면: 포르노가 존재합니다\n\n<div class=\"content-ad\"></div>\n\n온라인 세계의 어느 정도가 포르노에 전념되어 있는지 어떻게 생각하십니까? 섹스와 관련된 모든 것과 마찬가지로, 현실은 종종 우리의 상상력과는 거리가 멉니다.\n\n웹 페이지 중 포르노가 차지하는 비율은 약 4%로 추정됩니다 (출처). 포르노허브는 추정 방문자 수가 월간 643백만 명인 세계에서 7번째로 많이 방문되는 웹사이트로, 아마존의 600백만 명 방문자를 압도해 그 자리를 차지했습니다 (출처). 이것은 사람들이 조금은 Jeff Bezos보다 Johnny Sins를 약간 더 선호한다는 것을 암시할 정도입니다.\n\n참고로, 1분마다 55,000 기가바이트의 성인 콘텐츠가 업로드된다고 합니다 (출처). YouTube, 온라인에서 가장 많이 방문되는 페이지인 만큼 1분마다 2.815 테라바이트를 받는데, 매월 45억 명 방문자를 유치합니다.\n\n글로벌로 가장 자주 방문되는 상위 100개의 웹사이트 중 4개가 성인 콘텐츠 플랫폼이라고 합니다. 포르노 관련 주제는 웹 검색량의 13%와 모바일 검색의 20%를 이끌고 있어서 아직 사람들이 북마크를 사용하는 방법을 잘 모르는 것 같습니다.\n\n<div class=\"content-ad\"></div>\n\n\n![Privacy, Politics, and Porn](/assets/img/2024-05-27-Privacypoliticsandporn_1.png)\n\n포르노 그라피티에 따르면, 전체 트래픽의 79%는 20개 국가에서 기여하는 것으로 나타났어요. 이 통계는 'America #1' 슬로건을 재구성했고 미국 다음으로 영국, 일본, 프랑스, 이탈리아가 뒤를 이었습니다.\n\n캐나다는 7위네요! 알겠어요, 캐나다친구들, 그건 초보 숫자야! Mindgeek (Pornhub)는 몬트리올에 있으니까 국가 경제를 지원해야죠, 알겠죠?\n\n포르노 사이트 방문은 보통 짧고 달콤하죠. 미국인들의 평균 방문 시간은 9분 44초예요. \"이탈률\"에게 완전히 새로운 의미를 부여하고 있네요. (출처)\n\n\n<div class=\"content-ad\"></div>\n\n위오밍, 미시시피 및 알라바마는 포르노를 가장 오래 시청하는 미국 주입니다. 위오밍은 놀라운 평균 11분 3초를 소비하며, 미시시피와 알라바마는 각각 10분 51초와 10분 46초를 소비합니다.\n\n이러한 주가 가장 긴 시청 시간을 보이는 이유는 알 수 없습니다. 내구력 때문인가요? 줄거리를 위해 머물러 있는 걸까요? 아니면 보수당을 지지하고 있어서 이러는 걸까요? 이것은 이제 그대로 남아 있을 것입니다.\n\n자유의 땅에서는 루이지애나의 2022년 성인 사이트 연령 확인을 위한 규정이 아이디 앱 사용 증가로 이어졌고, 아칸소 및 유타를 비롯한 여러 주가 2023년에 이어 관련 법률을 시행했습니다. 법률은 소년 소녀들 사이의 소셜 미디어 중독과 포르노 액세스를 규제하기 위한 것이었으며, 이에 관한 헌법적 타당성에 대한 다양한 법원 판결과 법적 도전이 있었습니다 (출처).\n\n유타의 규정이 초래한 부작용 가운데, PornHub는 전체 주의 IP 주소를 차단하여 가상 사설망 (VPN) 사용이 967% 증가했습니다. (출처).\n\n<div class=\"content-ad\"></div>\n\n![이미지](/assets/img/2024-05-27-Privacypoliticsandporn_2.png)\n\n텍사스와 몬타나도 곧 유사한 입법을 추진할 것으로 예상되며, 이에 따른 VPN 사용량이 증가할 것으로 예상됩니다. 하지만 추적하기 어려운 것은 이들 사용자 중 얼마나 많은 사람이 성인 콘텐츠를 찾기 위해 다른 경로를 선택하는지입니다.\n\n# 표면 웹, 딥 웹 및 다크 웹에서의 신원\n\n가상 사설망은 웹의 표면 수준에서 익명성을 유지하는 방법입니다. 그러나 많은 사람들의 놀라움으로, 인터넷에는 공공 검토를 벗어나 익명성의 추가적인 층을 제공하는 영역인 딥 웹과 다크 웹이 발전해 왔습니다.\n\n<div class=\"content-ad\"></div>\n\n\n![프라이버시, 정치 그리고 포르노그래피](/assets/img/2024-05-27-Privacypoliticsandporn_3.png)\n\n깊은 웹은 검색 엔진 인덱싱되지 않은 인터넷의 모든 부분을 포함하며, 개인 데이터베이스 및 구독 기반 서비스를 포함합니다. 깊은 웹에는 의료 기록, 법률 문서, 과학 보고서, 구독 정보, 학술 저널, 은행 및 금융 기록, 개인 이메일 계정, 그리고 기업 웹 페이지와 같은 개인 데이터베이스가 포함됩니다. 이러한 자료에는 특정 자격 증명 또는 권한이 필요합니다.\n\n이 데이터는 일반적인 검색 엔진에 인덱싱되지 않으므로 대다수의 인터넷이 일반 대중에게 숨겨진 상태입니다. 그리고 만약 제3자에 의해 악용된다면 모든 관련자들은 심각한 문제에 직면하여 대규모 소송과 돌이킬 수 없는 개인 피해를 입을 수 있습니다.\n\n다크 웹은 깊은 웹의 일부이지만 동일하지는 않습니다. 자세한 내용은 생략하고, 사용자의 개인 정보보호와 익명성 유지로 잘 알려져 있으며 연결을 여러 서버를 통해 라우팅하고 각 단계에서 데이터를 암호화하여 처리합니다.\n\n\n<div class=\"content-ad\"></div>\n\n다크 웹은 특별한 익명성을 제공합니다. 독재 정부에서의 언론의 자유를 위한 포럼, 부도덕한 행위에 대한 고발, 개인 보복이나 차별을 두려워하지 않고 커뮤니티에 참여하는 등 합법적인 활동을 지원할 수 있습니다. 또한 암호 화폐 개발의 기반을 마련해 주었습니다. 그들이 어떤 목적으로 사용했는지는 묻지 마세요.\n\n반면, 마약 거래, 해킹 서비스, 장기 밀매, 신용카드 사기, 테러리즘 및 기타 불법 상품 및 소모적인 활동에 대해 악명이 높습니다. 2014년 포츠머스 대학교의 Gareth Owen은 Tor에서 가장 흔히 호스팅된 콘텐츠가 아동 포르노그래피였음을 발견했습니다.\n\n주로 추적이 어려우므로, VPN에 돈을 지불하고 정부의 디지털 신분증을 믿지 않는 만성 포르노 사용자가 얼마나 많이 다크 웹으로 향할지 알기 어려울 것입니다. 얼마나 많은 기술에 능숙한 14세 소년들이 있을지요?\n\n# 알고리즘은 후회가 아닌 참여를 추적합니다.\n\n<div class=\"content-ad\"></div>\n\n인터넷이 우리로부터 정보를 수집하는 데 더 능동해지면 우리의 개인 및 전문적인 삶을 우리의 아바타와 분리하는 것은 거의 불가능해집니다. 그 논리는 간단합니다: 훌륭한 네티즌이라면 두려워할 것이 없고, 당신은 온라인 잘못 행동의 현실적인 결과를 피하기가 거의 불가능하므로 좋은 네티즌이 되어야 합니다.\n\n착안과 악에 대해, 인터넷의 디지털 익명성은 우리에게 그런 잘못된 길을 걷게 했는데, 온라인에서 발생하는 일은 온라인에 남는다고 느끼게 했습니다. 그러나 모든 것이 추적되는 시대에선, 어떻게 우리의 브라우저 히스토리에게 실수로 링크를 클릭했고 본 건 원치 않았고 다시 보고 싶지 않은 것이라고 말할 수 있을까요? 유튜브에게 예를 들자면, 나는 조던 피터슨에게는 전혀 신경 쓰지 않겠다고 말하고 싶은데, 그 알고리즘이 그를 권장해 주기를 그만두라고 요청해도 계속해서 나타나는 것처럼 말이죠.\n\n이제 어느 날 디지털 범죄를 우연히 목격해야 하는 상황에 처해 있다면, 온라인 피해법에 중요한 부분 중 하나인 디지털 안전 위원회가 준수 기록을 유지할 권한이 있는 것을 알고 있는 상황에서, 당신이 범죄를 신고한 사람임을 혼동하지 않도록 정보가 안전하게 전달되며 제대로 이해될 수 있을까요?\n\n우리의 정의 개념은 디지털 무게에 대처하는 데 더 잘 적응되어야 합니다. 어떤 범죄, 예를 들어 상대방의 동의 없이 친밀한 사진을 공개하는 것과 같은 하나의 범죄는 수백만 번 복제되어 영원히 서버에 저장될 수 있습니다. 그런 결과가 어디서 일어났는지를 알 수 있을까요? 일반인들의 대답은 확실한 평생 수감 및 매년 소변마려운 일들을 받아들이는 세션이겠지만, 법적으로 맥락이 중요합니다. 이러한 위반사항들은 일반적으로 민형사적 범죄로 분류되며 벌금, 벌칙 피해배상 및 징역형이 가능합니다. 그러나 이들은 여전히 충분히 심각하게 대해주지 않아 많은 사례들이 신고되지 않습니다. (출처)\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-05-27-Privacypoliticsandporn_4.png\" />\n\n테일러 스위프트가 최근 비극적으로 X에서 성적으로 음란한 AI 생성 이미지가 유포되어 피해자가 되었습니다 (물론, X에서 일어나다니요). 이미지는 계정이 정책을 위반하여 최종적으로 정지되기 전에 17 시간 만에 사이트에서 4500만 회 이상 조회되고 24,000번 이상 재게시되었습니다. 이러한 영향은 그의 영토 내에서 관련된 모든 사람들에 대한 적절한 법적 자원이 충분히 있었던 경우에 무척 어려운 것이기 때문에 상상하기 어려워집니다. AI는 암을 치료하는 데 사용될 수도 있지만 사회적 암이 되어서는 안 된다.\n\n우리 연방 법은 공정한 처벌의 목적을 정의하지만 벌은 즉시 어떤 영토나 주를 횡단할 수 있습니다. 지역에서 저지른 행위가 다른 곳에서는 큰 문제가 아닐 수도 있지만 다른 곳에서는 반드시 처벌이 보장됩니다. 캐나다의 경우, 음주 법적 연령이 표준화되지 않습니다:\n\n- 앨버타, 매니토바, 온타리오, 프린스 에드워드 아일랜드, 퀘벡, 사스카처외에는 18세\n- 브리티시컬럼비아, 뉴브런즈윅, 뉴펀들랜드 래브라도, 노스웨스트테리토리즈, 노바스코샤, 누나부트, 요콘 외에는 19세입니다.\n\n<div class=\"content-ad\"></div>\n\n지역 간 불일치에 대한 통치법은 어떻게 합니까? 이전히 존재하는 잘못된 부분에 대한 설계는 어떻게 하나요? 디지털 정책의 미래를 탐색하는 데는 많은 주의가 필요하며 가끔은 민감한 대화와 잘 알고 있는 봉양이 필요합니다.\n\n사용자 경험 디자이너로서, 우리는 합법적이고 도덕적이며 윤리적인 범위를 벗어나는 활동이 존재한다는 사실과 조율해야 합니다. 우리는 존재하는 세계를 위해 디자인하며, 언젠가는 우리의 작업이 사회에 순수 가치를 가져다 줄 것을 희망합니다.\n\n우리는 디지털 환경의 엄청난, 혼돈스러운 성격과 해당 사용자의 다양한 요구와 권리를 고려하는 세심한 접근 방식을 주장해야 합니다. 기술적으로 유익하거나 가치 중심적인 정책 뿐만 아니라 디지털 격차의 깊은 이해, 의도하지 않은 결과의 가능성 및 안전하면서도 자유로운 온라인 환경 조성의 중요성에 기반을 둔 정책이 요구됩니다.\n\n이 미묘한 균형은 계속되는 대화, 혁신적 사고, 정부, 기술 기업 및 시민사회 간의 협력이 필요하며, 우리의 집단적 안전과 시민의 자유를 존중하면서도 디지털 정책의 미래를 탐색해야 합니다.\n\n<div class=\"content-ad\"></div>\n\n결백함과 개인 정보 보호는 하나의 공통점이 있습니다: 한 번 상실되면 다시 되찾을 수 없다는 것입니다.\n","ogImage":{"url":"/assets/img/2024-05-27-Privacypoliticsandporn_0.png"},"coverImage":"/assets/img/2024-05-27-Privacypoliticsandporn_0.png","tag":["Tech"],"readingTime":9},{"title":"슈프림 코트의 슈퍼매이져리티는 2024년 대통령 선거에서 조 바이든을 지지해야 하는 주요한 이유입니다","description":"","date":"2024-05-27 15:42","slug":"2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024","content":"\n\n![image](/assets/img/2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024_0.png)\n\n슈퍼매이저리티는 십사번째 수정안 \"자유\"에서 개인의 개인 정보 보호와 자율성을 깎아내리고 있습니다.\n\n돕스(Dobbs) 사건에서 대법원 슈퍼매이저리티는 “개인의 존엄과 자율성에 중요한 역할을 하는 개인 선택”을 하는 개인 권리를 확고히 하는 헌법적 교리를 훼손하는 과정을 시작했습니다. 이는 “개인의 정체성과 신념을 정의하는 가까운 선택을 포함한 개인 존엄과 자율성을 강화하는 권리”로, 대부분의 미국인들의 삶의 다반사를 차지하고 있는 권리입니다.\n\n대법원이 돕스로로 르 전환하여 50년의 생식 자율성을 정부의 개입에서 제거하기 전에, 트럼프와 대법원 판사들은 를 결정된 사법라는 것을 의심하게 만들었습니다. 돕스에서는 제도적인 타당한 절차의 소멸을 볼 수 있으며 이것은 \"결혼, 생식, 피임, 가족 관계, 육아 및 교육과 관련된 개인적인 결정을 보호하는 헌법 교리\"입니다. 대법원의 수렴점에서 \"생활 중에서 사람이 할 수 있는 가장 가까운 또는 개인적인 선택 사항들, 존엄과 자율성의 핵심, ...자유의 중추\"는 이제 의심의 대상이 될 뿐만 아니라 \"십사번째 수정안에 의해 보호받을 수 없게 되었으며 ... 자유의 핵심\"은 더 이상 \"자신의 존재, 의미, 우주, 그리고 생명의 미스터리를 정의하는 권리\"를 보장하지 않습니다. 앤트니 케네디 재판관, 남동부 펜실베니아 계획모성단체. 케시.\n\n\n<div class=\"content-ad\"></div>\n\n현재 법정의 초과다수는 정부의 간섭으로부터 개인 자율권의 중요한 추가적인 권리, 즉 피임권(최근 트럼프가 의문을 제기한), 인종간 결혼, 성적 활동, 동의하는 성인 간의 성관계, 동성 결혼, 그리고 부모가 자녀의 보호, 양육, 교육, 보살핌, 그리고 통제를 지시하는 권리를 위협하고 있습니다. 만일 토마스 대법관의 의견이 받아들여진다면, 법정은 1965년에 판결된 커네티컷 주 그리스월드 대 커네티컷 사건부터 시작하여 모든 중요한 정당한 절차/사생활권 사건을 재검토하고 뒤집을 것입니다. (그리스월드 사건에서 법정은 결혼한 부부가 주의 간섭 없이 피임에 대한 헌법적 사생활권을 갖고 있다고 판결했습니다.)\n\n![이미지](/assets/img/2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024_1.png)\n\n초과다수는 대통령으로부터 권력을 차지하여 미국 국민의 건강, 안전, 복지를 약화시키고 있습니다.\n\n보수주의자들은 대사법 판사들을 혐오하지만, 그렇지 않을 때도 있습니다. 법정의 보수파 다수는 \"주요 질문 규범\"을 통해 기존 입법의 해체와 강화를 가속화하고 있으며, 수십 년 동안 유지된 권력 구조를 실질적으로 변화시키고 있어 의회에서 더 많은 교착 상태를 초래하고 있으며 미국 국민의 건강, 안전, 복지를 위협하고 있습니다. 행정부가 법률을 제정하고 행정하고 이를 \"활동주의적 보수파 초과다수\"의 만족에 어울리게 하는 연방 정부의 능력은 심각하게 손상되어 있거나 불가능하게 되어가고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n“주요 질문 주의”는 미국 행정법 사례에 적용되는 법률 해석 원칙으로, 법원이 의회가 주요 정치적 또는 경제적 중요성으로 라벨링한 문제들을 행정 기관에 위임하지 않는다고 가정합니다. 만일 슈퍼마이어리티가 연방 기관이 마음에 들지 않는 규제를 집행하고 있다면, 법원은 단지 집행물의 주제가 의회가 행정 기관에 위임하지 않은 “주요 질문”에 속한다고 결론지을 필요가 있습니다.\n\n미국 의회는 대부분의 연방 기관을 창설하며 의회가 정의한 정책 시행을 실행하고 강제하기 위한 규정을 제정하도록 합니다. 대부분의 이러한 기관들은 행정부의 일부이며, 의회가 제정한 법률을 집행하는 기관입니다. 연방 기관은 법률, 기술, 산업 및 과학 정책 감독을 총괄하므로, 특수 분야의 잘 교육받고 높은 기술을 가진 인력들을 고용합니다. 많은 사람들은 세계적으로 인정받는 학자들 및 전문가입니다.\n\n당연히 의회는 자신의 정책 시행에 필요한 세부 사항을 파악하고 채워넣기 위한 전문성, 시간, 인내심 또는 능력을 갖추지 않습니다. 결국 의회의 구성원으로 들어가는 유일한 요구 조건은 후보자가 25세 이상이거나 미국 시민권자로 적어도 일곱 년간 미국 시민이어야 하고, 대표하려는 주에 거주하고 있어야 한다는 것입니다. 상원의 구성원이 되려면 후보자가 30세 이상이어야 하며, 적어도 아홉 년간 미국 시민이어야 하고, 대표하려는 주에 거주하고 있어야 합니다.\n\n“조 바이든 대통령이 취임한 이후로 연방 주택 정책을 효과적으로 통제해 왔으며, 어떤 근로자가 코로나바이러스 19 예방접종을 받아야 하는지 결정하고, 환경문제 대응을 위한 EPA의 권한을 상당 부분 박탈하였으며, 교육 장관이 학생 대출을 수정하거나 사면할 수 있는 연방 법률을 다시 쓰기도 하였습니다.\n\n<div class=\"content-ad\"></div>\n\n\"현재 다수파로 이해되는 대법원의 주요 질문 원칙은 지난 몇 년 동안 거의 공중에서 나타났습니다. 민주당 행정부가 만든 정책을 무효화하기 위해 공화당 임명 판사들에 의해 거의 배타적으로 사용되었습니다. 이 원리는 헌법 어디에도 언급되지 않았습니다. 연방 법령에도 언급되어 있지 않습니다. 선출되지 않은 판사들이 연방 정책에 지나친 통제력을 행사하려는 것으로 보입니다.\n\n이 원리의 결과는 놀라울 정도로 큽니다. 실제로, 주요 질문 원칙은 대법원을 국회가 행정부 기관에 위임한 어떤 정책 문제에 대한 최종 결정권으로 만들어, 선출되지 않은 판사들이 연방 정부의 두 선출 권력을 모두 무시할 권한을 부여합니다.\"\n\n대법원이 행정부를 주도권으로 뒤 바꿨을 때의 상황입니다.\n\n![image](/assets/img/2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024_2.png)\n\n<div class=\"content-ad\"></div>\n\n미국의 슈퍼매이조리티는 인종 중심의 지역구 획정을 승인하는 등 소수결정을 유지하고 보존합니다.\n\n몇 주 전에 저는 미국 대법원 변호사 협회 멤버십을 포기하기로 결정했습니다. 그 이후로 정부의 제3조 지점에 대한 뉴스가 악화되었습니다. 네, 알리토 장관의 명백한 정치적이고 극단적인 이기주의 행동에 대한 보도는, 이전에 그가 법정 앞에서 사안을 갖고 있는 사람들로부터 사치스러운 선물을 받은 사실을 우리에게 더 명백히 보여주었으며, 그것을 연방법에 위반한 채 보고하지 않았다는 이전 뉴스와 결합하여, 우리가 이미 그의 글, 연설, 설교, 법정 외부 단체와의 연게에 대해 알고 강력히 의심했던 것을 더욱 확실히 확인했습니다. Jamelle Bouie가 말한 것처럼, \"사무엘 알리토 장관을 둘러싼 상황에 대한 미국 역사에는 진정한 전례가 없습니다.\" 알리토 가족의 '하늘에 호소(주님의 심판)'.\n\n(비록 이에 대해 갈렬하지만) 우선, 그가 뉴저지 집 밖에 게양한 '하늘에 호소' 깃발(\"깃발\")을 처음엔 1987년 유타주 솔트레이크시티에서 설립된 몰몬교와 밀접한 관계를 맺은 에버그린 인터내셔날 주식회사 심볼로 오인했습니다. 그 회사는 \"동성애자 감소 및 동성애 행동 극복을 원하는 사람들을 돕기 위한\" 명시적인 임무를 갖고 있었습니다. 이 회사는 2014년 폐쇄되었습니다.\n\n1월 6일 폭동에서 '하늘에 호소' 깃발이 기독교 국민주의의 상징으로서 부각되고 있다는 사실을 배우고 있으며, 기독교 국민주의가 폭동을 계획하고 실행하는 데 중추적인 역할을 한 사실을 알고 있습니다. 최고법원판사 알리토, 연방주의회 회장 레오 루시, 하원의원 마이클 존슨을 비롯한 더 많은 지지자들에 대해 더 많은 정보를 알게 되고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n알리토의 신념 체계와 2023년 5월 23일 목요일 발표된 연방 대법원 판결인 Alexander v. South Carolina State Conference of the NAACP에 공통된 주제는 엘리 마이스탈이 이야기한 것처럼, 이렇다: 유일하게 자격 있는 미국 시민, 즉 백인들만이 완전한 시민권과 책임을 부여받아야 하며, 희석되지 않은 투표권, 존중받을 가치 있는 목소리를 가지고 있어야 한다는 것입니다. 알리토의 공개된 백인 크리스찬 국민주의를 기반으로 한 나는 한 걸음 더 나가서, 낙태, 동성 결혼, 트랜스젠더 권리, 그리고 정부에서 종교를 배제하는 것을 지지하는 사람들, 각성한 자유주의자, 이념주의자, 무신론자, 그리고 하위 품종, 인종, 민족, 종교를 가진 사람들은 자격 없다고 생각합니다.\n\n미국 헌법은 미국 선거인단의 소수를 통해 대통령을 선출할 수 있게 하며, 미국 선거인들의 소수를 통해 대통령이 후보자를 임명한 대법관들을 승인하게 합니다. 이 결함이 있는 시스템은 연방 및 주 의회가 정치적 지시도정을 통해 소수의 지배를 연장할 수 있으며, 대법관들은 이를 헌법과 완벽하게 일치한다고 여깁니다. 연방 대법원 정의로 나아가는 법률 원칙 설명.\n\n이번 주에도 대법원은 다시 한 번 그의 인종주의적이고 반민주적인 사법 기반을 확실하게 보여주었습니다. 2013년에 Shelby County v. Holder 사례에서 대법원은 1965년 투표권법의 중요한 부분인 Section 5를 약화시켰는데, 이는 투표에 대한 차별적 장벽을 극복해야만 했던 남부 주 및 카운티들이 미국 법무부장관이나 워싱턴 D.C.의 연방 지방 법원과 의결되는 선권 제안 입법을 사전에 승인받게 했습니다. Shelby County 사례에서의 결정을 확장시켜, 이번 주의 초과 다수가 인종주의적 지시도정에 대한 도전을 거의 불가능하게 만들 것으로 예상됩니다.\n\nAlexander 사례에서 사우스 캐롤라이나 의회는 2020년 인구조사를 기반으로 국회 의석구역을 다시 그렸습니다. 재선거는 20만 명의 흑인 유권자를 새로운 선거구로 분산시켰으며, \"[제1 국회의 지역]을 대부분의 찰스턴으로부터 제거함으로써 도시의 120년 역사를 끊었습니다.\" NAACP는 이 지도가 헌법적으로 인종주의적 지시도정이라고 주장했습니다. 대법원은 사우스 캐롤라이나 지도 사례에 대해 판결했습니다. 아프하한 증거 청취 후, 세 명의 연방 지방법원 패널은 NAACP의 주장을 받아들이며, 사실이 지도가 헌법에 위반되는 인종주의적 지시도정임을 압도적으로 입증했다고 결정했습니다.\n\n<div class=\"content-ad\"></div>\n\n알리토 재판관이 쓴 6-3 다수결 의견에 따르면, 상급 법원은 하급 법원이 사실적인 결정을 뒤엎었는데, 이를 “분명히 잘못되었던 사실적인 판단”이라 하며 상급 법원이 일반적으로 하지 않는 일을 했습니다. 그들은 사실을 재검토하고 “극명하게 다른 결론”에 이른 것입니다. 2019년 5-4 다수결에 근거하여 정치적인 아웃라이어 재구획을 허용한 것이 연방 법원의 관할 범위를 벗어난다고 판단한 알리토의 다수파는 재구획이 정치적인 것으로 규정하고 이에 따라 합법적이라고 명명했습니다. 남부 지역에서 흑인과 백인 유권자가 역사적으로 높은 극성을 띄고 있음에도 불구하고, 그들의 투표 패턴은 강력하게 인종과 관련이 있으며 증거가 분명하게 그 재구획이 인종을 기반으로 한 것임을 입증했습니다. 그리고 투표권 보호 법 1965년은 특히 다수파가 사우스캐롤라이나에게 흑인 투표권을 약화시키는 것을 허용한 것과 정확히 반대하도록 통과됐습니다. 남부 의원 중 누군가가 지도를 다시 그릴 때 인종이 고려되지 않았다고 주장한다면, 법원에 충분할 것입니다. 최고 법원은 인종적 재구획 선례를 해체했습니다.\n\n알리토의 결정이 '인종 차별적인 재구획을 방지하는데 있어 일련의 선례를 약화시키는 것으로 나쁜 것이라 할지라도, 다수파는 단독 강조 의견을 쓴 토마스 재판관에게 충분하지 않았습니다. 그는 법원이 “투표구획을 제한하는 모든 선례를 무효화해야 한다고 주장했으며, ‘한 사람 한 표’를 수립하거나 확인하는 공정한 사례를 제시한 것은 첫째부터 지도를 바꿀 권한이 없기 때문이라고 말했습니다. 그리고 그는 법원이 재구획에 불법적으로 개입했다고 주장하는 것 중 상당 부분을 놀라운 가해자인 ‘브라운 대 교육청 대 퀸’에 책임을 돌렸습니다. 클라렌스 토마스, 인종적 재구획을 위한 충분한 주장을 제시합니다.\n\n카건 재판관은 \"오늘의 다수파가 청구인들에게 불리한 결론을 내리기 위해 사실과 법률을 왜곡할 수 있는 사례를 찾은 것 이외에는 목격한 모든 합리적인 법정 구경꾼들이 알고 있는 것을 기초로 원념 참배를 포함한 반대 의견을 마무리했습니다. 그분의 의견은 이렇게 말합니다: ‘다양한 방법으로, 오늘의 다수파는 도전자들을 상대로 덱을 쌓습니다. 상태가 ‘인종을 고력하지 않은’ 대해 가능한 이야기를 갖고 있었다는 것 때문에 도전자들이 패배해야 한다, 다수파는 말합니다 — 심지어 반대 이야기가 더 타당했을 경우라도. 그리고 다시 한번, 다수파는 말합니다, 그들이 본증명의 특정 형태를 제시하지 않았기 때문에 (이들에게는 그것이 중요할 것인지를 알아차리지 못한 상태에서이기도 하고 최근 이 법원이 원고로 하여금 필요하지 않다고 말한 것) 패배해야 한다. 도전자들이 주장한 것처럼 주 재구획 계획이 인종적 분류의 결과임을 증명하기 위해 전문적인 통계 분석을 포함한 방대한 증거를 제시했음에도 상태가 그것을 인종적 분류의 결과로 생각하기 위해 노력하고 어렵고 서투른 부인 이상의 것을 제시한 사실에도 불구하고. 상태의 거짓 주장을 믿기 어려운 것으로 생각한 세 명의 판사들이 그 논백이 사실상 믿을 수 없는 것이며, 원고의 증거에 덧입히지 않았다고 생각했다. 투표에서 인종적 분류가 논의되면, 다수파는 말합니다, 모든 의심은 상태의 편을 들어주는 것으로 해결되어야 하며, 그렇지 않으면 (하느님 금지인) ‘책망적이고 멸시적인’ 행태를 벌릴 수밖에 없다고 하는 것입니다.\n\n<div class=\"content-ad\"></div>\n\n주 의회 의원들과 지도 제작자들에게 인종적 선거구 재편에 대한 메시지네요. 저는 이미 언급한 이유들로, 이러한 행위자들은 종종 정당 목적을 달성하기 위해 인종을 대리인으로 사용하는 동기를 갖는 경우가 많습니다. 때로는 소수 선거인플루언스를 직접 억제하고 싶을 수도 있습니다. 이번에는 이 법정이 주들에게 말합니다. 오늘 주들아, 앞으로 나아가세요. 인종을 사용하는 합법적인 이유, 예를 들어 평등한 투표권을 보장하는 법률을 준수하기 위한 것 같은 인정받는 사유가 없다 하더라도 앞으로 나아가세요. 당신이 (최선의 경우) 인종을 파티 이익을 가져오기 위한 단순한 수단으로 사용하고 있다 할지라도, 각각의 경우에 더 많은 공화당당원이든 더 많은 민주당당원이든 더 많은 정당원을 선출하기 위한 단축으로 인종을 사용할지라도 앞으로 나아가세요. 최종적으로 당신의 행적을 알리는 것은 충분히 쉽습니다: 인종 기반의 결정이 아닌 가능성을 제기하면 결정적입니다. 그래서 이 '혐오스러운' 시민 분류의 관행은 계속될 것입니다. 이 것은 인종 일반화에 근거를 두고 인종적 분할을 이용하는 것입니다. 특히 선거 영역에서는 '만연한 인종차별의 추악한 양상'이길래, 우리 스스로, 우리의 정치 대표자들, 특히 이 법정에게는 더 나은 것을 요구해야 합니다. 존경히 반대를 표합니다.\"\n\n반대 의견 33~34.\n\nR.VanWagoner는 https://medium.com/@richardvanwagoner에 게시합니다. https://richardvanwagoner.medium.com/subscribe\n\n\\*나의 형제인 매우 재능 있는 소설 작가이자 소설가, 로버트 호드슨 밴 왜너,가 https://medium.com/@richardvanwagoner에 대한 실용적이고 기술적 제안을 제공한 데에 상당한 공로가 있습니다. 로브의 두 번째 소설인 서스펜스 드라마는 2020년 11월 17일 출시되었습니다. 아마존, 바른스 앤 노블, 애플 북스토어, 그리고 여러분이 선호하는 지역 서점에서 이 소설인 \"The Contortionists\"는 농담적으로 몰몬지역 아동의 실종에 대해 다룬 심리적 페이지 터너입니다. 저는 이 소설을 두 번 읽고 오디오 버전을 두 번 들었습니다. 그것은 문학적 걸작입니다. 그러나 'The Contortionists'는 마음이 약한 사람들에겐 권하지 않습니다.\n\n<div class=\"content-ad\"></div>\n\n**Richard J Van Wagoner**은 제 아버지입니다. 그의 영예, 상, 그리고 전문 협회 목록은 광범위합니다. 그는 웨버 주립 대학교의 명예 교수 (회화 및 드로잉)로 총 3회 시각 예술 학과 의장을 맡은 경력이 있습니다. 그는 다수의 대학에서 초청 강의와 지도를 하였으며 다수의 전시 및 전시회 심사위원도 역임했습니다. 그의 작품은 국내외 다수의 전시와 전시회로부터 초대를 받아 전시되었으며 그의 작품은 국내외로 다수의 여행전시에 참가했습니다. 저의 딸 Angela Van Wagoner는 프로 사진작가로서, 제 아버지 작품 중 500개 이상을 촬영했습니다. https://medium.com/@richardvanwagoner 에 게재된 아버지의 작품 사진은 그녀가 찍은 것입니다.\n","ogImage":{"url":"/assets/img/2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024_0.png"},"coverImage":"/assets/img/2024-05-27-TheSupermajorityontheSupremeCourtistheOverarchingReasontoVoteforPresidentBidenin2024_0.png","tag":["Tech"],"readingTime":9},{"title":"주리안 어쌘지 사건이 전 세계 언론인들에게 왜 중요한지","description":"","date":"2024-05-27 15:41","slug":"2024-05-27-WhyJulianAssangesCaseMattersforJournalistsWorldwide","content":"\n\n![Why Julian Assange's Case Matters for Journalists Worldwide](/assets/img/2024-05-27-WhyJulianAssangesCaseMattersforJournalistsWorldwide_0.png)\n\n위키리크스 창립자 줄리언 어샌지스는 지금 감옥에서 너무 오랜 시간을 보내 왔기 때문에 그가 왜 그곳에 있는지 점점 기억하기가 힘들어지고 있습니다.\n\n그는 2019년부터 런던의 벨마시 감옥에 수감되어 있었습니다. 미국이 기밀 정보를 배포한 혐의로 그를 인도하려고 해올 동안 그는 거기서 억류되어 있었습니다. 그 이전에는 성 폭행 조사 및 기소를 피하기 위해 스웨덴으로 인도되는 것을 피하기 위해 에콰도르 대사관 (런던에 위치)에서 7년간 망명을 구하고 있었습니다. 그 시절에는 그 혐의가 최종적으로 철회되었습니다.\n\n이번 주에 어샌지스와 그의 변호팀은 중요한 승리를 거뒀습니다: 그는 미국으로의 인도를 항소할 권리를 부여받았습니다.\n\n<div class=\"content-ad\"></div>\n\n승리일지 모르지만, 어쌍지는 여전히 감옥에 수감 중이며, 그의 사건은 언론인과 언론 자유 옹호자들이 알아야 할 중요한 사안입니다. 그가 미국으로 송환돼 재판을 받게 된다면, \"대중의 이익을 위한 정보\"를 공유한 것으로 처음으로 감옥에 가게 될 수도 있습니다.\n\n## 어쌍지의 (거의) 20년 요약\n\n어쌍지의 법적 문제는 2006년 웹사이트 위키리크스를 창설할 때 시작되었지만, 그 당시에는 그것이 전형적인 뉴스 기관으로 여겨지지 않았습니다. 위키리크스는 규제되고 비밀스러운 정보를 게시하여 전 세계에서 불법행위, 부패, 전쟁 범죄를 폭로하는 것을 사명으로 삼았습니다.\n\n위키리크스는 2010년에 악명을 얻게 되었는데, 미국군이 2007년 배그다드에서 미군에 의해 11명의 민간인이 살해당한 사건을 보여주는 분류된 미국 군사 비디오를 온라인으로 공유했습니다. 이 비디오와 수천 건의 다른 문서는 군 정보 분석관인 첼시 매닝에 의해 어쌍지와 위키리크스에 제공되었습니다. 매닝 자신도 기밀 정보를 공개한 혐의로 스파이법에 따라 기소되어 여러 해 동안 감옥에 있게 되었습니다.\n\n<div class=\"content-ad\"></div>\n\n어느 날 어쌍지는 1917년 스파이기법에 따른 17개 혐의와 \"컴퓨터 침입 공모\" 1개 혐의로 기소될 것이며, 매닝의 폭로를 발표한 것이 이로 이어질 것입니다.\n\n그 과정에서 어쌍지는 성폭행 혐의로 기소될 것이기도 합니다. 그는 그 혐의에 대해 무죄를 주장하며 스웨덴으로 이송되어 법정에 출석하는 것을 피하기 위해 에콰도르 대사관에 망명을 청했습니다. 결국 에콰도르 대사관 당국은 어쌍지를 내쫓았으며 그는 미국으로 이송을 기다리기 위해 구금되었습니다. 2019년부터 그는 런던의 교도소에 수감되어 있습니다.\n\n## 그러나 이 모든 일들이 어떤 의미를 지니며 언론의 자유와 언론에게 미치는 영향은 무엇일까요?\n\n어쌍지는 영국이 미국으로의 이송을 승인한 결정에 대한 항소 소송을 계속할 것입니다. 그의 변호인팀은 어쌍지는 미국 시민이 아닌 호주 시민이기 때문에 언론의 자유를 보호받지 못할 것이라는 점에 중점을 둘 것으로 예상됩니다.\n\n<div class=\"content-ad\"></div>\n\n방에 있는 코끼리는, Assange가 미국 시민이었다고 해도 스파이법에 따른 기소로 인해 제1 수정안의 보호를 받기 어렵다는 것입니다. 이 법은 1917년부터 시행되어 왔으며, 비밀 및 기밀 정부 정보를 누설한 사람들에게 심각한 처벌을 부과합니다.\n\n스파이법에 따라 기소된 사람들은 분류된 정보를 왜 누설했는지 배심원에게 설명할 수 없습니다. 첼시 매닝, 에드워드 스노든, 리얼리티 유니어 등의 폭로자들은 미국 국민이 그들의 정부가 무엇을 하는지 알 권리가 있다고 믿어서 기밀 정보를 폭로했다고 진술했었습니다.\n\n언론 자유옹호자와 저널리즘 운동가들은 Assange에게 175년의 징역형을 위협하는 것이 “얼음 효과”를 일으킬 것이며 이는 미국과 세계 언론에 발표된 뉴스 기사에 “매우 냉담한 영향”을 미칠 것이라고 우려를 나타냈습니다. 이 편집 전문가들은 “정부 책임을 진다는 것은 민주주의 속에서 자유 언론의 핵심 임무 일부임을 밝히겠다”라고 밝히고 있습니다.\n\n## 안보의 나무들을 위해 언론의 숲을 잊지 마세요.\n\n<div class=\"content-ad\"></div>\n\nEspionage Act를 사용하여 국가 및 기밀 비밀 정보의 유출자를 기소하는 주장자들은 국가 안보를 보호하기 위해 해당 법률을 사용한다고 시민들에게 종종 말합니다.\n\n국가 안보는 유효한 우려사안이며 항상 심각하게 다뤄져야 합니다. 그러나 공개해야 할 권리가 있다고 믿는 정보를 유출하는 사람들은 종종 다른 사람에게 위험을 초래하지 않은 채로 그렇게 행동합니다. 예를 들어 미국 국방부는 첼시 매닝의 정보 유출이 \"미국의 이익에 실제 피해를 끼치지 않았다\"고 보고하였습니다. (그 정보들을 줄리안 어쌩지가 아직 공개했을 때 기소받고 있는 것들입니다.)\n\n줄리안 어쌩지의 법적 사건은 오랜 기간 복잡하고 다른 문제로 인해 복잡해졌습니다. 그 문제는 그의 반대로 성폭행 혐의를 포함합니다.\n\n그러나 세계의 시민들은 어떠한 경우에는 오늘날 사회에서 어떤 일을 하는지 알려줘야 하는 기자와 발행인들의 역할과 자유한 군림의 중요성을 믿는지 결정해야 합니다. 그렇게 믿는 경우, 어쌩지, 언론의 역할, 자유한 군림 권리들에 대해 더 알고 싶어할 수 있습니다.","ogImage":{"url":"/assets/img/2024-05-27-WhyJulianAssangesCaseMattersforJournalistsWorldwide_0.png"},"coverImage":"/assets/img/2024-05-27-WhyJulianAssangesCaseMattersforJournalistsWorldwide_0.png","tag":["Tech"],"readingTime":3},{"title":"Z-검사 AI 신뢰성 평가 방법","description":"","date":"2024-05-27 15:39","slug":"2024-05-27-TheZ-InspectionamethodtoevaluateanAIstrustworthiness","content":"\n\n<img src=\"/assets/img/2024-05-27-TheZ-InspectionamethodtoevaluateanAIstrustworthiness_0.png\" />\n\n간략 요약: AI의 전체 잠재력을 실현하기 위해서는 신뢰성이 필요하며, 이를 위해 투명성, 공정성 및 보안에 주의를 기울여야 합니다. 편향과 개인 정보 보호에 대한 과제를 해결하기 위해서는 AI 수명 주기 전반에 걸쳐 종합적인 접근 방식이 필요합니다. Z-Inspection 방법은 윤리적, 기술적, 법적 고려사항을 연결하여 AI의 신뢰성을 평가하고 강화하는 실용적인 프레임워크로 나타나고 있습니다. 이 종합적인 접근 방식을 통해 우리는 신뢰를 불러일으키며 책임 있는 혁신을 이끌어내는 AI 시스템의 길을 열어갑니다.\n\n신뢰할 만한 AI란 무엇을 의미할까요? 정책 제정자와 AI 개발자들은 전 세계적으로 이 질문을 다루기 위해 수백만을 쏟아부었습니다. 이 노력 뒤에 있는 원동력은 사회가 AI의 전체 잠재력을 실현할 수 있는 믿음이 AI의 개발, 배포 및 사용에 신뢰가 내재되어야만 가능하다는 것입니다. 예를 들어, 의사와 환자가 AI 기반 시스템의 진단이나 치료 권고를 신뢰하지 않으면, 이러한 권고가 환자의 복지를 개선할 수 있다 하더라도 따를 가능성이 낮습니다. 마찬가지로 대중이 자율주행 차량을 신뢰하지 않는다면, 이들은 전통적인 수동 운전 차량을 대체하지 않을 것입니다.\n\n그러나 현재 많은 AI 시스템은 인지할 수 없는 공격에 취약하며, 소수 그룹에 편향이 있고, 사용자 프라이버시 보호가 부족합니다. 이러한 위반 사항은 채용 및 대출 결정에서 자동 시스템의 편향적 대우부터 인간 목숨의 손실에 이르기까지 다양합니다. 이러한 문제는 모든 AI 시스템에 대한 사용자 경험을 감소시키고 신뢰를 손상시킵니다.\n\n<div class=\"content-ad\"></div>\n\n전통적으로 인공지능 실무자들인 연구자, 개발자, 의사결정자들은 시스템 성능(즉, 정확도)을 주요 지표로 삼아왔습니다. 그러나 이 지표만으로는 인공지능 시스템의 신뢰성을 반영하는 데 충분하지 않습니다. 신뢰성을 향상시키려면 로버스트성, 알고리즘 공정성, 설명 가능성, 투명성 등 성능 이외의 여러 요인을 고려해야 합니다.\n\n인공지능 신뢰성에 대한 학계 연구는 주로 모델의 알고리즘적 속성에 중점을 두었습니다. 그러나 알고리즘적 연구만 진전시키는 것으로는 신뢰성 있는 인공지능 제품을 만들기에 부족합니다. 산업적 관점에서 보면, 인공지능 제품의 수명주기는 다양한 단계를 거치며 각 단계에서 신뢰성을 향상시키기 위한 특별한 노력이 필요합니다. 이러한 단계에는 데이터 준비, 알고리즘 설계, 개발, 배포, 운영, 모니터링, 그리고 거버넌스 등이 포함됩니다. 예를 들어, 로버스트성을 향상시키려면 데이터 살균, 강력한 알고리즘 개발, 이상 감지 모니터링, 위험 감사 등이 필요합니다. 반대로, 어느 한 단계에서 신뢰 손실이 발생하면 전체 시스템의 신뢰성이 훼손될 수 있습니다.\n\n따라서 인공지능 신뢰성은 시스템의 전체 수명주기 동안 체계적으로 세워지고 평가되어야 합니다.\n\n# 신뢰성 있는 컴퓨팅의 여정\n\n<div class=\"content-ad\"></div>\n\n컴퓨팅에서 신뢰성 개념은 중요한 사건에서 비롯되었습니다. 마이크로소프트의 공동 창업자인 빌 게이츠가 2002년 회사의 모든 직원에게 보낸 이메일에서 시작되었습니다. 이 이메일은 컴퓨팅 역사상 중요한 순간으로, 디지털 시스템에서의 신뢰성 개념을 위한 기초를 마련했습니다.\n\n이 신뢰성 컴퓨팅 방식은 컴퓨터 과학과 시스템 공학 분야 일부에서 계속해서 채택되고 있습니다 (예: 전기전자공학회 (IEEE) 및 국제전기기술위원회 (IEC)).\n\n국제표준화기구 (ISO) 및 IEEE 표준의 신뢰성 정의는 게이츠의 시스템 신뢰성 속성을 중심으로 구축되어 있습니다:\n\n- 컴퓨터 시스템의 신뢰성은 제공하는 서비스에 정당한 신뢰를 둘 수 있는 정도의 신뢰성\n- 특정 항목의 성능에 대한 믿음성 및 요구 시 수행할 수 있는 능력.\n\n<div class=\"content-ad\"></div>\n\n2024년 3월 13일, 유럽 의회가 인공지능 법안 (AI Act)을 채택했습니다. 이 법안은 세계 최초의 포괄적 수평적 인공지능 법적 프레임워크로 간주되며, 데이터 품질, 투명성, 인간 감시 및 책임성에 대한 EU 전체적인 규칙을 제정합니다. 이는 AI 시스템의 신뢰성 원칙을 더욱 발전시키는데 일조하고 있습니다.\n\n# AI 신뢰성에 대한 실용적 접근방식\n\n그러나 언급된 요구 사항 목록은 실제 응용에는 너무 추상적으로 보입니다. 이러한 지침은 AI 신뢰성 이해를 위한 기초를 제공하지만, 실세계에서의 구현을 위해 더 실용적인 접근 방식이 필요합니다.\n\nAI 신뢰성을 평가해야 할 주 배우자들뿐만 아니라 설계 및 개발 과정에 참여하지 않은 사용자들이 신뢰성을 평가하는 것 또한 좋은 실천 방법입니다. 이는 어떠한 우려 사항도 해소하고 시스템에 대한 신뢰를 높이는데 도움이 됩니다.\n\n<div class=\"content-ad\"></div>\n\n이 문맥에서 Z-Inspection과 같은 더 실용적인 평가 프로세스가 중요해집니다. Z-Inspection은 현실 세계 시스템 개발의 문제와 요구 사항에 맞춰 설계되었으며 AI 시스템의 협업, 자가평가 또는 외부 감사에 활용할 수 있습니다.\n\n이는 AI 시스템의 신뢰성을 평가하고 향상시키는 데 일반 목적 방법론으로 적합하게 만듭니다.\n\n- 설계 단계에서 Z-Inspection은 신뢰할 수 있는 AI 시스템을 설계하는 방법에 대한 통찰력을 제공할 수 있습니다.\n- 개발 중에는 윤리적 시스템 개발을 확인하고 테스트하고 관련 사용자 그룹의 수용을 평가하는 데 사용할 수 있습니다.\n- 배포 후에도 이 프로세스는 변화하는 모델, 데이터 또는 환경의 영향을 검사하는 지속적인 모니터링 노력으로 사용할 수 있습니다.\n\nZ-Inspection은 두 가지 완성된 접근 방식을 신중하게 결합한 방법론입니다:\n\n<div class=\"content-ad\"></div>\n\n- 전체 시스템을 이해하려는 종합적인 접근방식,\n- 문제 영역의 각 구성 요소를 신중하게 조사하는 분석적인 접근방식.\n\n이 통합은 “Responsible AI — Two frameworks for ethical design practice” 논문의 저자들의 관점과 일치합니다:\n\n# Z-Inspection의 단계별 가이드\n\n이 프로세스는 세 가지 주요 단계로 구성됩니다:\n\n<div class=\"content-ad\"></div>\n\n- 사전 조건이 명확하게 파악되고 평가팀이 식별되며 경계에 동의하는 설정 단계\n- AI 시스템이 분석되는 것이 평가 단계\n- 식별된 문제와 긴장을 해소하고 권고사항을 제공하는 결과 단계.\n\n# 설정 단계\n\n설정 단계는 사전 조건을 명확히하고 조사팀을 선정하며 평가의 경계를 정의하고 프로토콜을 작성하는 데 도움을 줍니다.\n\nZ-검사 과정은 AI의 영향을 다루는 전문가들의 다학제적 팀을 구성하여 시작됩니다. 이 팀에는 도메인 전문가, 기술 전문가, 사용자, 법률 자문자 및 윤리학자가 포함되어야 합니다. 도메인 전문가는 AI의 기본 가정을 확인하고, 기술 전문가는 적절한 구현을 보증합니다. 사용자는 시스템과 관련된 우려를 표명하고, 법률 및 윤리 전문가는 가능한 도전에 대비하여 팀을 안내합니다.\n\n<div class=\"content-ad\"></div>\n\n스테이크홀더 간의 기대치를 조율하는 것이 중요합니다. 검사 요청자가 누구인지, 결과가 어떻게 활용될지(예: 공중 홍보, 시스템 개선, 또는 최종 사용자와의 커뮤니케이션 등) 명확히 해야 합니다.\n\n이 단계는 또한 평가 범위를 정의하는 과정을 포함하며, AI 시스템이 더 넓은 사회 기술적 맥락 내에서 운영됨을 인식해야 합니다. 이 환경을 철저히 평가하는 것은 포괄적인 평가에 필요합니다.\n\n# 평가 단계\n\n평가 단계는 네 가지 작업으로 구성되어 있습니다:\n\n<div class=\"content-ad\"></div>\n\n- AI 시스템 사용 분석;\n- 잠재적 윤리적 문제 및 기술적, 법적 문제 식별;\n- 해당 문제를 신뢰할 수 있는 AI 윤리적 가치 및 요구 사항에 매핑;\n- 해당 요구 사항의 검증.\n\n평가 단계의 첫 번째 단계는 AI 시스템을 사용하는 사람들의 가능한 일상적인 경험을 설명하는 사회 기술적 시나리오를 정의하는 것입니다. 이러한 시나리오는 발생할 수 있는 문제를 예측하고 강조하기 위해 사용됩니다. 이들은 공급 업체가 제공한 정보, 참가자의 개인 경험 및 이전에 정의된 평가의 한계를 기반으로 합니다.\n\n다음으로, 이러한 시나리오는 다른 팀 구성원들에 의해 분석됩니다. 각 팀 구성원은 다양한 배경을 통해 보완적인 시각을 제공할 수 있으므로 자신의 시각을 기여하도록 권장됩니다. 예를 들어, AI 엔지니어는 방사선과의 타겟마커와 간호사와는 달리 시스템의 다른 측면에 중점을 둘 것이며, 그들의 초점은 간호사의 것과 다를 것입니다.\n\n각 참가자 또는 동일한 배경을 가진 참가자 그룹은 시스템에서 보이는 문제점을 각자의 시각에서 설명하고 이러한 문제가 실제 문제인 이유에 대한 증거를 제시합니다. 이 증거는 수립된 모범 사례, 과학 보고서 또는 관찰된 행동과 공급 업체 시스템 설명 사이의 충돌과 같은 다양한 형태로 나타날 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n다음 단계는 신뢰성 높은 AI 요구 사항과 충돌하는 문제를 식별하고 시스템 행동과 신뢰성 사이의 긴장을 강조하는 것입니다. 이 프로세스는 이러한 문제가 AI 시스템의 신뢰성에 미치는 영향을 강조하는 데 도움이 됩니다.\n\n그 후에 식별된 문제를 통합합니다. 각 이해관계자 또는 그룹은 발견한 결과를 제시하여 관련 문제를 결합하여 간결한 목록을 작성할 수 있습니다.\n\n# 해결 단계\n\n해결 단계는 이전에 식별된 윤리적, 기술적, 법적 문제에 대해 대응하며 가능한 경우 윤리적 긴장을 해소합니다. 참가자들은 이러한 문제를 논의하고 우선순위를 정하며 실행 가능한 해결책을 찾기 위해 협력합니다. 이 과정에서 시스템 및 구체적인 문제에 따라 원칙 간의 잠재적인 갈등이 발생할 수 있습니다. 이러한 경우 시간이 흐른 후 윤리적 AI 유지 보수 계획이 권장될 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n다음 중 세 가지 케이스 중 하나가 발생할 수 있습니다.\n\n- 긴장 상태가 해결되지 않을 수 있습니다.\n- 추가 리소스 할당을 통해 긴장 상태를 극복할 수 있거나\n- 두 가지 상충하는 원칙 사이에서 선택할 수 있는 해결책이 있을 수 있습니다.\n\n경우에 따라 충돌의 명백한 해결책이 있을 수도 있습니다. 그러나 다른 케이스에서는 트레이드오프가 필요하거나 현실적으로 해결책이 없을 수도 있습니다. 이 단계에서 참가자들은 윤리적 긴장을 직접 다루고 이해 관계자들과 트레이드오프를 논의하여 잠재적인 영향을 완화하기 위한 권고안을 제시합니다.\n\n# 최종 생각\n\n<div class=\"content-ad\"></div>\n\n원래는 AI 시스템의 신뢰성을 평가하기 위해 들어가기로 한 적은 없었어요. 처음에 제 초점은 디자이너가 사용자들이 회의를 극복하고 새로운 기술을 받아들이는 데 어떻게 도와줄 수 있는지였죠. 하지만 더 깊게 파고들수록, 시스템이 정말로 신뢰할 만한지 확인하는 것이 단지 그렇게 인식되는 것보다 훨씬 중요하다는 것을 깨달았어요.\n\nAI 시스템의 윤리적, 사회적 영향은 상당한 우려를 불러일으킵니다. 그리고 안타깝게도, 디자이너와 일반 사용자 모두에게 AI 신뢰성을 평가하는 방법에 대한 접근 가능한 정보가 부족합니다.\n\nAI 시스템의 신뢰성을 평가하는 경험이 있으시다면, 사용한 방법에 대해 알려주시면 정말 좋겠어요. 여러분의 통찰력을 공유해주시면 우리 모두가 투명하고 공정하며 안전한 AI 기술의 미래를 향해 함께 나아갈 수 있습니다.","ogImage":{"url":"/assets/img/2024-05-27-TheZ-InspectionamethodtoevaluateanAIstrustworthiness_0.png"},"coverImage":"/assets/img/2024-05-27-TheZ-InspectionamethodtoevaluateanAIstrustworthiness_0.png","tag":["Tech"],"readingTime":6},{"title":"그들이 진심으로 사랑할 때 남자들이 숨기는 비밀","description":"","date":"2024-05-27 15:38","slug":"2024-05-27-TheSecretsMenKeepWhenTheyLoveYouDeeply","content":"\n\n# 남자가 여러분을 더 사랑할수록 “공유”하기를 덜할 수도 있습니다. 잘못된 사람 찾지 않도록 주의하세요\n\n![image](/assets/img/2024-05-27-TheSecretsMenKeepWhenTheyLoveYouDeeply_0.png)\n\n작년에 유럽 영화와 미국 영화를 보았습니다. 거기에서:\n\n남자 주인공이 여자 주인공에게 우연히 사랑에 빠지게 되었습니다. 사랑에 빠졌을 때 남자 주인공은 몇 가지를 숨겼습니다. 여자 주인공은 남자 주인공이 항상 존경했던 군인이라고 잘못 생각하여 함께 하게 되었습니다.\n\n<div class=\"content-ad\"></div>\n\n그러나 그들이 관계를 가진 후 여주가 남주가 그 사람이 아니라는 것을 발견했습니다. 이전에 남주는 히어로의 역할을 맡았었습니다.\n\n그래서 여주는 그 순간 매우 화를 내고 갑작스럽게 남주를 떠나버렸어요.\n\n남주는 여주를 계속 찾아다니며 사과하고 그 역시 이유가 있었음을 전하려고 했어요.\n\n사실 남자가 여자를 더욱 깊게 사랑할수록, 그는 여자와 일부 비밀을 공유하지 않을 수도 있습니다. 때로는 그녀를 잃을까봐 무서워해서 아예 숨길 수도 있죠.\n\n<div class=\"content-ad\"></div>\n\n결국, 관계에서 지나치게 솔직한 것은 상대방의 진심뿐만 아니라 비난과 이별을 불러올 수도 있습니다.\n\n남성들은 지는 것을 두려워하기 때문에 상대방에게 너무 많은 것을 말하지 않습니다. 따라서 여성들은 남성이 사랑이 부족해 당신에게 진실을 말하거나 특정한 사생활을 공유하지 않을 것이라고 생각해서는 안 됩니다. 때로는 상반된 상황일 수도 있습니다.\n\n남성이 당신을 더 사랑할수록 그런 사생활을 공유할 가능성은 더 적습니다. 잘못된 사람을 찾았다고 오해하지 마세요.\n\n# 가정에서의 어려움\n\n<div class=\"content-ad\"></div>\n\n\"모든 가족은 자신만의 어려움이 있어요.”\n \n모든 가족은 자신만의 도전이 있어요. 가족이 매우 부유해 보이더라도, 그들의 관계가 행복하지 않을 수 있어요.\n\n가끔은 훌륭한 관계를 가진 가족을 보아도 조용한 순간에는 여전히 몇 가지 문제로 논쟁할 수 있어요.\n\n남자가 여자를 정말 좋아한다면 그가 집에서 겪는 어려움 중 일부를 전혀 공유하지 않을 거예요. 이 어려움을 그녀와 공유한다면 그녀를 상처받게 할 수 있어요. 남자가 여자를 진심으로 사랑한다면 그녀에게 그렇게 많은 부담을 지우지 않을 거예요.\"\n\n<div class=\"content-ad\"></div>\n\n한편, 두 사람이 함께 있지 않거나 아직 결혼하지 않았다면, 대부분의 경우 남성은 집에서의 어려움을 상대방과 공유하는 것을 꺼려합니다. 상대방을 놀래킬까봐 두려워하기 때문입니다.\n\n그래서 때로는 남성들은 이런 식이죠. 상대방을 잃을까 봐 두려울 때, 집안의 금전적 문제와 같은 일부 어려움을 공유하지 않을 수 있습니다.\n\n여성으로서, 남성과 부드럽게 소통해보세요. 그러면 그가 마음을 열기 쉬워질지 모릅니다.\n\n# 전 여자친구에게 준 사랑\n\n<div class=\"content-ad\"></div>\n\n여성들은 보통 예민할 때가 많아요. 그들이 자신의 남자가 이전에 누군가에게 많은 사랑을 줬다는 것을 알게 되면, 그들은 불안해하고 전 여자친구와 자신을 비교할 수 있어요.\n\n만약 남자가 정말 전 여자친구와 결별했다면, 당신과 함께 보내는 모든 순간에는 그의 마음에는 당신이 있어야 하고, 전 여자친구가 아니어야 해요.\n\n만약 남자가 당신을 깊이 사랑하고 전 여자친구에 대해 이야기하고 싶어하지 않는다면, 그것은 그가 당신을 충분히 사랑하지 않는다는 이유가 아니라, 그가 당신 덕분에 과거를 잊은 것 때문일 수 있어요.\n\n여성으로서는, 항상 남자의 과거 연애에 대해 꺼내지 말아주세요. 그것은 쉽게 그를 전 여자친구에 대해 생각하게 만들 수 있고, 당신끼리의 관계에 손상을 줄 수 있어요.\n\n<div class=\"content-ad\"></div>\n\n# 직업 걱정\n\n남자가 여자를 깊이 사랑한다면, 자신의 직업 걱정을 그녀와 공유하지 않을 수도 있습니다. 그는 이러한 걱정을 공유하는 것이 그녀를 불안하게 만들 수 있음을 알고 있습니다. 여자를 사랑하는 남자로서, 그는 그녀에게 안전감을 주고 평온하고 부정적인 감정 없이 안정된 삶을 살도록 하고 싶어합니다.\n\n따라서 남자가 여자와 자신의 직업 걱정을 공유하지 않을 때, 그가 진심이 없는 것이 아니라 그녀의 감정과 이후의 상황을 걱정하기 때문일 수 있습니다.\n\n가끔은 집 밖에서 문제가 생겼을 때 집에 있는 가족들에게 알리지 않아 걱정하지 않도록 하는 경우도 있습니다. 비슷하게, 남자가 여자를 깊이 사랑할 때도 그녀를 걱정시키기를 두려워하는 것입니다.\n\n<div class=\"content-ad\"></div>\n\n남성이 직업적으로 어려움을 겪을 때, 항상 여성에게 말하는 것이 도움이 되지 않을 수 있습니다. 최대한으로, 그녀는 감정적 안정을 제공할 수 있을 뿐입니다. 그래도 그녀도 당황할 수 있고, 무엇을 해야 할지 모를지도 모릅니다.","ogImage":{"url":"/assets/img/2024-05-27-TheSecretsMenKeepWhenTheyLoveYouDeeply_0.png"},"coverImage":"/assets/img/2024-05-27-TheSecretsMenKeepWhenTheyLoveYouDeeply_0.png","tag":["Tech"],"readingTime":3},{"title":"애플의 고페치 쉽게 해결되지 않는 취약성","description":"","date":"2024-05-27 15:37","slug":"2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix","content":"\n\n![Secure Enclave](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_0.png)\n\n고객님의 가장 민감한 비밀, 즉 식별하고 컴퓨터를 식별하는 개인 키와 같은 것들은 안전한 사물함에 저장됩니다. 일반적으로 이는 공개 키 쌍에서의 개인 키로, 내보낸 공개 키가 해당 개인 키와 일치할 것입니다. 이후 안전한 사물함에서 비밀 키를 포함하는 처리를 할 수 있습니다:\n\n![Secure Enclave](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_1.png)\n\n이를 통해 Bob은 안전한 사물함에 개인 키를 저장하고 데이터의 해시에 서명하기 위해 사용할 수 있습니다. 그런 다음 Alice에게 이를 전송할 수 있고, 그녀는 이를 사용하여 그의 신원과 데이터의 무결성을 확인할 수 있습니다.\n\n\n<div class=\"content-ad\"></div>\n\n\n![image](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_2.png)\n\nEve가 Bob의 개인 키를 잡을 수 있었다면, 그녀는 그것을 통해 Alice에게 그가 되는 척할 수 있습니다. 결국 이제 최근 Apple Macbooks에 사용된 Apple의 M-시리즈 프로세서가 사이드 채널 공격에 취약하며 비밀 키를 노출시킬 수 있다는 것이 밝혀졌습니다. 이것을 GoFetch라고 이름 지었습니다.\n\n공격의 주요 포커스는 민감한 데이터가 주소로 사용되고 데이터를 주소로 변환할 수 있는지에 대한 것입니다. 이것은 데이터 메모리 의존적 프리패처(DMPs)에 관련되어 있으며 데이터를 메모리 주소로 변환하는 프로그램입니다. 이를 사용하여 연구 팀은 디피-헬만 키 교환과 RSA 키 그리고 포스트-양자 암호학 키(CRYSTALS-Kyber와 CRYSTALS-Dilithium)를 포함하여 캡처하는 데 성공했습니다.\n\n\n\n![image](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_3.png)\n\n\n<div class=\"content-ad\"></div>\n\n이것은 심각한 결함이며, 침입자가 컴퓨터로부터 가장 민감한 기밀 정보를 발견하고 컴퓨터와 컴퓨터 소유자를 모방할 수 있게 합니다. 불행히도, 프로세서의 마이크로아키텍처 설계와 관련이 있기 때문에 이를 수정하는 것이 쉽지 않습니다. 대안으로는 서드파티 암호화 라이브러리를 사용하고 소프트웨어에서 실행하는 것이 있습니다. 이는 상당한 성능 저하를 야기할 것입니다.\n\n많은 다른 공격이 프리페처(prefetchers)를 사용했는데, 이 기능은 프로세서가 예측된 작업을 미리 확인하고 프로그램이 다음에 요청할 데이터를 메모리에 미리 로드할 수 있게 합니다. 이러한 작업은 암호화 작업의 운영을 공개할 수 있습니다. 일반적으로 암호화는 일정한 시간 응답을 가지도록 설계되어 있으며, 암호화 작업 처리 시 사용된 작업에 대한 정보를 발견할 수 없습니다. 새로운 연구 결과에 따르면 프로세서가 메모리 콘텐츠를 암호화 키로 인식하고 메모리 포인터 값으로 혼동시킬 수 있다는 것을 안내해줍니다. 포인터의 역참조가 그러면 암호화 키를 드러낼 수 있습니다.\n\n# 암호 누출\n\n보안 커뮤니티에서는 놀라운 암호화 알고리즘을 만들었지만, 결국 모든 비트는 실리콘과 금속에 모두 저장되고, 침입자들이 키를 해독하기 위해 모니터를 설치할 가능성이 점점 높아지고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n암호화 키의 해독은 종종 무차별 대입 방법이나 구현상의 결함을 대상으로 하게 됩니다. 그러나 물리적인 사이드 채널 공격에 증가하는 관심이 있습니다. 여기에는 전자기 방사선, 전력소비, 전기 전압 변동, 심지어 소리 및 열 변화와 같은 암호화 정보의 무의도한 정보 누출이 포함됩니다. 현재는 몇 회사만 사이드 채널 공격으로부터 장치를 보호하고 있습니다. 특히 이는 비용이 많이 들며 복잡한 장비로의 광범위한 테스트가 필요하기 때문입니다.\n\n장치 또한 점점 빨라지고 있는데, 그러면서 더 많은 라디오와 전자기(EM) 방사를 방출하는 경향이 있습니다. 예를 들어 2GHz 프로세서는 우리의 Wi-Fi 신호(2.4 GHz)와 동일한 주파수에서 작동하며, 종종 칩은 라디오파를 방출하지 않도록 보호되지 않습니다. 이는 장치의 빠른 작동의 자연적인 부산물입니다. 이러한 높은 주파수에서는 EM 방사를 막기 어렵기 때문에 주위의 배선 및 다른 회로로의 결합을 막는 것이 종종 어려울 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n보안 연구원들이 최근 GnuPG 암호 라이브러리에서 취약점을 발견했습니다. 이 취약점으로 1,024비트 공개 키를 해독하고 해당 개인 키를 찾아 비밀 데이터를 해독할 수 있었습니다. GnuPG는 암호학을 위한 표준 오픈 소스 라이브러리이며 Windows, Mac 및 Linux 시스템에서 사용됩니다.\n\n취약점은 CVE-2017-7526 ID를 부여받았으며 로컬 FLUSH+RELOAD 사이드 채널 공격으로 공격됩니다. 이 때 \"왼쪽에서 오른쪽으로 이동하는 슬라이딩 윈도우\" 방법으로 지수 비트에 대한 정보가 누설되어 전체 키가 복원됩니다. 캐시 메모리에 개인 RSA 키가 저장되어 있는 Level 3 캐시 사이드 채널 공격이 관련되어 있습니다.\n\n공격자는 캐시의 메모리 사용량을 관찰하거나 (또는 복호화 과정 중 방출되는 전자기 방사를 통해) 정보를 얻습니다. 물리적 머신에서는 어려울 수 있지만, 연구원들은 한 가상 머신에서 다른 가상 머신으로 키를 추출할 수 있다고 설명합니다. 또한 2,048비트 RSA가 동일한 방법으로 해독될 수 있지만, 더 많은 컴퓨팅 자원이 필요할 것으로 예상됩니다.\n\n<div class=\"content-ad\"></div>\n\n# 1,024비트 키가 현재의 전류에 떨어진다\n\n현재 RSA 해킹의 한계는 768비트 키에 대한 것이며 모듈러스(N)의 인수분해를 사용하여 공격하는 방식이지만, 2010년에는 다른 방법으로 사이드 채널 공격을 사용하여 프로세서의 전류 흐름을 관찰하여 1,024비트 키를 해킹한 사례가 있습니다 (100시간 내에). [여기]\n\n![이미지](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_6.png)\n\n# 무선 공격\n\n<div class=\"content-ad\"></div>\n\nRSA 알고리즘을 음향 방법으로 해킹하는 작업이 진행되었고, 전자기와 전압 변화도 같이 연구되고 있습니다. 이제 연구자들은 [여기]라는 논문에서 중요한 발전을 이루었습니다.\n\n이 논문에서 저자들은 인기 있는 키 교환 방법인 ECDH (타원 곡선 디피-헬만)의 해킹을 개요하였습니다. ECDH는 Microsoft Live, Google, Facebook 등의 사이트에 연결할 때 자주 사용되는 방법 중 하나입니다.\n\n연구에서는 ECDH 공개 키 암호화 알고리즘을 공격하고 전자기적 변화를 측정합니다. 그들은 신중히 선택된 암호문과 시간-주파수 신호 분석 기술을 사용하여 키를 해킹합니다. 이를 통해 몇 초 안에 복호화 키를 해독할 수 있으며, 다른 방에 있는 안테나로부터도 가능합니다.\n\n![이미지](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_7.png)\n\n<div class=\"content-ad\"></div>\n\nECDH은 이제 인기있는 방법이며, 타원 곡선 방법을 사용한 Diffie-Hellman 키 교환 방법의 기본 개념이다.\n\n## 전력 분석\n\n칩의 전력 레일을 변조하는 작업은 암호화 키를 발견하기 위해 잘 문서화된 상태이며, 여기서 키의 보안과 보호가 감소됩니다. 또한 메모리 칩이 얼려지고 비트 상태를 유지하는 \"차가운 부팅(cold boot)\"에 관한 작업도 있습니다.\n\n## SIM 카드에 대한 차등 전력 분석\n\n<div class=\"content-ad\"></div>\n\n지금까지 우리는 SIM 카드가 대부분의 공격으로부터 안전하다고 생각했습니다. 그러나 상해자오퉁대학 교수 유위유는 이제 128비트 AES를 사용하는 3G/4G SIM 카드가 해킹될 수 있다는 것을 보여 주었습니다. 그래서 SIM 카드 클론의 악몽이 실현될 수도 있습니다.\n\nSIM 암호화 키에 대한 액세스는 법 집행기관의 주요 관심사이며, 네덜란드 SIM 카드 제조업체 젬알토로부터 수십 억 개의 암호화 키가 범죄 수사관들에 의해 도난당한 의혹이 제기된 때에 이 사안이 강조되었습니다. 이러한 키는 휴대폰의 데이터와 음성 메시지에 액세스할 수 있게 합니다.\n\nProf 유위유 교수는 이번 블랙햇 미국 2015 발표에서 SIM 카드로부터 암호화 키를 회복하고 복제하는 미세 전력 분석 방법을 소개했습니다. 전체적으로 키를 복구하는 데 10-40분이 걸리며, 그 방법은 가장 인기 있는 SIM 카드 제조업체 중 8개에서 성공했습니다.\n\n그는 전력 변화를 캡처하는 오실로스코프와 MP300-SC2 프로토콜 분석기, 그리고 PC를 사용하여 암호 해독을 분석합니다. 이 작업은 차등 전력 분석 (DPA)를 활용합니다. 단순한 전력 분석 (SPA)을 이용하면 프로세서가 소비하는 전력을 모니터링하여 레지스터와 데이터 버스의 내용에 대한 힌트를 얻을 수 있습니다.\n\n<div class=\"content-ad\"></div>\n\n\n![Image 1](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_8.png)\n\nWith DPA, chips undergo certain encryption tests. The power levels of the chips are then observed and analyzed for correlation of bit patterns used (refer to Figure 2). Differences in the encryption process help to deduce the key. For instance, test data is applied with a variety of keys to the device, and power levels are monitored. Each power consumption level changes based on the chip's activity.\n\n![Image 2](/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_9.png)\n\n## DPA and CPA on AES cracking\n\n\n<div class=\"content-ad\"></div>\n\n여기서 우리가 한 작업은 Arduino 장치에서 AES-128 S-box에 대한 전력 분석 공격을 사용하여 30분 미만으로 128비트 AES를 깰 수 있었습니다. 이는 차별적 전력 분석(DPA) 및 상관 전력 분석(CPA)을 활용한 것입니다. 자세한 내용은 [여기](https://youtu.be/7D-Hr4Nw0T4?t=21m30s)를 확인해주세요.\n\n# 결론\n\nGoFetch는 심각한 취약점이며 상당한 성능 저하 없이는 쉽게 해결되지 않습니다. 이는 애플에게 큰 비용이 들 것으로 예상됩니다.\n","ogImage":{"url":"/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_0.png"},"coverImage":"/assets/img/2024-05-27-AppleGoFetchTheVulnerabilityWhichisNotEasyToFix_0.png","tag":["Tech"],"readingTime":6},{"title":"인도 투데이 구독 2년간 무료로 이용하기 ","description":"","date":"2024-05-27 15:35","slug":"2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years","content":"\n블로그에 들어가기 전에...\n\n커뮤니티의 해커들을 위한 나의 속담...\n\n\"여자들보다 버그 바운티 프로그램에 집중해; 프로그램은 노력을 인정하지만 여자들은 그렇지 않아요. 😉\"\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_0.png)\n\n<div class=\"content-ad\"></div>\n\n시작해 봅시다…\n\n인도 오늘에 대해 간단히 소개하자면...\n\n인도 오늘은 리빙 미디아 인도 주식회사가 발행하는 매주 발행되는 인도의 영어 언어 뉴스 매거진입니다. 이 매거진은 인도에서 가장 널리 유통되는 매체로, 약 800만 명의 독자들이 있습니다.\n\n상황을 다시 만들어 봅시다!!\n\n<div class=\"content-ad\"></div>\n\n친구야, 인터넷에서 어떤 공중인물에 대한 기사를 읽으려고 검색하고 있었는데 갑자기 매거진에 가입하라는 팝업이 뜨면 누가 좋아하겠어요? (저는 더 미워해요 😅😂) 실수로 팝업을 닫는 대신에 눌러 버리는 바람에 뭔가 의심스러운 것을 느꼈고, 삽질을 시작했죠.\n\n그런 식으로 취약점을 찾아내는 과정이 시작되었습니다 😈😈\n\n이제 해킹을 시작합시다!!!!\n\n사이트를 여니까 스크롤을 내리고 거기서 빠르게 나를 위한 계정을 만들었어요. 이제 웹사이트에서 제게 여러 종류의 매거진과 구독 요금제를 보여주고, 우르르 😞😞 이렇게 나타나죠. 그래서 웹사이트의 기능 같은 최소한의 것을 확인하고 사이트를 작게 탐색 👨‍💻👨‍💻 하고 있어요.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_1.png)\n\n그래서 나는 모든 일반적인 것들을 시도해봤어, 매개변조 및 인터넷과 체크리스트에서 비즈니스 로직 버그 등 모두😁. 전자 상거래 웹사이트이기 때문에 취약점을 악용할 수 있는 좋은 기회를 얻지 못했어 🥹🥹\n\n웹사이트를 살펴보니 여러 결제 게이트웨이를 사용하며, 흥미로운 점은 웹사이트가 결제 게이트웨이로 Billdesk를 사용한다는 것을 알게 되었어. 그래서 내 모든 관심이 Billdesk에 집중되었어, 이를 우회해 본 적이 없었거든 😅😉😃\n\n이제 몇 가지 무작위 구독을 장바구니에 추가하고 Paytm과 ICICI Bank와 Billdesk와 같은 모든 결제 옵션을 확인했어.\n\n\n<div class=\"content-ad\"></div>\n\n기존의 다른 결제 게이트웨이 시도가 여러 번 실패한 후, 휴식을 취하고 Billdesk를 테스트하기 시작했어요 ⚡🙃\n\nBilldesk를 결제 게이트웨이로 선택하고 주문을 확인했어요.\n\n<img src=\"/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_2.png\" />\n\n주문을 확인한 후, 이제 사이트가 결제 게이트웨이 페이지로 리디렉션되었어요.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_3.png)\n\n이제 Burpsuite로 열었고 프록시를 설정했습니다... 게이트웨이를 해킹할 준비가 다 되었어요. 이 작업을 하기 전에 Billdesk 결제 게이트웨이 API 코드 및 응답을 참조해서 게이트웨이를 더 잘 이해하려고 했어요. 왜냐하면 말했듯이 나도 결제 게이트웨이에 대해 처음이라서요. 아래에서 결제 게이트웨이 API 응답 코드에 대한 초보자를 위한 간단한 정보를 제공합니다. 😁😁😁\n\n결제 게이트웨이 API 응답 코드란 무엇인가요??\n\n게이트웨이 응답 코드는 거래가 거부되었는지 승인되었는지를 식별하는 여러 자리 숫자 코드입니다. 이 코드들은 거래를 다시 시도해야 하는 경우 어떤 조치를 취해야 하는지 나타내줍니다.\n\n\n<div class=\"content-ad\"></div>\n\n첨부된 문서를 참고하시면 Billdesk 결제 게이트웨이에 대한 아이디어를 얻을 수 있어요.\n\n이제 Burp를 열고 프록시 탭으로 이동하여 인터셉트를 켜세요. 켜 놓은 후에는 취소 버튼을 눌러 트랜잭션을 취소하세요. 또한 필요한 데이터를 입력하고 트랜잭션을 중단하세요.\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_4.png)\n\n이제 Burp에서 몇 가지 요청과 응답을 받았는데, 이 요청 덕분에 빠져버렸네요 😅😍\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_5.png\" />\n\n요청에서 msg가 거래 상태와 응답 코드를 표시한다는 것을 관찰했어요. 그래서 이 요청이 전송될 것이고, 나는 메시지 필드의 응답을 변경하기로 생각했어요.\n\n아래와 같이,\n“0300”은 성공을 의미하며, 성공적인 거래를 의미해요.\n“0399”은 은행에서의 유효하지 않은 인증을 나타내며 거래 실패를 의미해요.\n\n이제 나는 거래 상태 코드와 메시지를 변경하거나 조작하기로 했어요.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_6.png)\n\n응답 코드와 메시지를 변경한 후에 요청을 Burpsuite로 전달했습니다. 그 후에 이 응답을 받았어요. 이제 이 요청이 주문을 업데이트하기 위해 POST 방식을 사용하고 성공처럼 보이는 걸 알았어요 🥳🥳\n\n![이미지](/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_7.png)\n\n계속해서 요청과 응답을 전달하다가 이것을 보았어요 😉😉😁😁\n\n\n<div class=\"content-ad\"></div>\n\n부아아아아아아암, 화면에 성공 메시지가 나와서 놀랐어요 🥳🎉🥳🎉\n\n<img src=\"/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_8.png\" />\n\n이 글은 지식 전달 목적으로 공유되었으며 버그를 사용하려고 시도하지 마십시오.\n\n또한 Mayur Parmar, Hemant Patidar, Tarun Tandon, Pavan Kumar Chinta에게 특별히 감사드립니다.\n\n<div class=\"content-ad\"></div>\n\n위 글을 즐겁게 읽어주셨기를 바랍니다. 괜찮은 정보를 얻었으면 좋겠네요. 궁금한 점이나 도움이 필요하면 제 프로필을 방문해주시고 LinkedIn에서 연락 주세요.\n\n또한, 저를 Medium에서 팔로우하실 수도 있습니다.\n\n감사합니다. 그럼 안녕! 해킹을 즐기고 함께 해킹해요! 👨‍💻😈\n","ogImage":{"url":"/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_0.png"},"coverImage":"/assets/img/2024-05-27-HowIHackedIndiaTodaySubscriptionfor2years_0.png","tag":["Tech"],"readingTime":4},{"title":"NASA LDAP 서버를 해킹한 방법","description":"","date":"2024-05-27 15:34","slug":"2024-05-27-HowIHackedNASALDAPServer","content":"\n<img src=\"/assets/img/2024-05-27-HowIHackedNASALDAPServer_0.png\" />\n\n안녕하세요, 해커 친구들,\n\n이것은 NASA의 LDAP 서버를 해킹하여 이름, 성, 직위, 직원 세부 정보와 같은 조직 민감 정보를 가져올 수 있었던 두 번째 글입니다. 시간을 낭비하지 않고 바로 시작하겠습니다.\n\nLDAP에 대해 잘 모르는 사람들을 위해 간단히 설명하겠습니다.\n\n<div class=\"content-ad\"></div>\n\nLDAP은 (Lightweight Directory Access Protocol)의 약자입니다. 이는 열린, 공급업체 중립적인, 분산 디렉터리 정보 서비스에 접근하고 유지하는 업계 표준 응용 프로그램 프로토콜으로서 인터넷 프로토콜(IP) 네트워크 상에서 사용됩니다. LDAP은 사용자 이름과 암호를 저장할 중앙 위치를 제공하고, 응용 프로그램이 이 디렉터리에 연결하여 사용자를 확인할 수 있도록 해줍니다.\n\n따라서 Shodan에서 검색을 하던 중, NASA를 해킹해보면 큰 성취감을 느낄 수 있다고 생각하여 NASA를 해킹하고 신고해보자고 생각했습니다. 그래서 Shodan을 살펴보기 시작했습니다.\n\n사용한 Dork는 (ssl:nasa.gov)이었고, 모든 결과를 검색한 후에 IP 주소를 얻었고 여기서 389번 포트에서 실행 중인 IP 주소를 확인했습니다. 기본적으로 LDAP 서비스는 636번 포트와 389번 포트를 사용하므로 389번 포트가 열려 있는지 확인하기 위해 nmap을 실행하여 연결된 개방 포트를 확인했고, 익명 바인드 상태의 개방 포트를 찾았습니다.\n\n![이미지](/assets/img/2024-05-27-HowIHackedNASALDAPServer_1.png)\n\n<div class=\"content-ad\"></div>\n\n여기서 내가 이용한 취약점은 LDAP 익명 null 바인드였고, 이 취약점을 이용하기 위해 파이썬 스크립트 코드를 사용했어.\n\n이 코드를 실행한 후에 나는 다음과 같은 네이밍 컨텍스트를 얻었어.\n\n![이미지](/assets/img/2024-05-27-HowIHackedNASALDAPServer_2.png)\n\n네이밍 컨텍스트의 결과를 얻은 후에 나는 마지막 코드를 사용하기로 결정했어.\n\n<div class=\"content-ad\"></div>\n\n\n![NASALDAPServer](/assets/img/2024-05-27-HowIHackedNASALDAPServer_3.png)\n\n그리고 결국, 조직 부서, 직원 세부 정보, 직원 지정 등 많은 정보를 얻었고 제 반응은 예에요.\n\n![reaction](https://miro.medium.com/v2/resize:fit:768/1*0j6wn-iPK5dB6G_i6FXbDg.gif)\n\n이제 여기서 멈추기로 결정했고 개인 정보 침해 및 정책 위반으로 더 이상 악용하지 않기로 하고 NASA에 보고했으며 3일 이내에 보안팀으로부터 응답을 받았어요.\n\n\n<div class=\"content-ad\"></div>\n\n그리고 마침내 감사 편지를 받았어요\n\n![Letter of appreciation](/assets/img/2024-05-27-HowIHackedNASALDAPServer_4.png)\n\n읽어 주셔서 감사합니다...\n","ogImage":{"url":"/assets/img/2024-05-27-HowIHackedNASALDAPServer_0.png"},"coverImage":"/assets/img/2024-05-27-HowIHackedNASALDAPServer_0.png","tag":["Tech"],"readingTime":2},{"title":"AI 윤리 전 세계적으로 가능할까요","description":"","date":"2024-05-27 15:33","slug":"2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale","content":"\n\n![Image](/assets/img/2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale_0.png)\n\n가장 좋은 윤리 정의를 찾아보면...\n\n우리는 인간으로서 삶에서 실수를 저지르고, 그 후에 후회합니다. 좋은 성품을 지닌 사람은 이런 것을 발견하고 자신을 개선하려고 노력합니다. 우리 삶의 노력은 인간의 성품, 배려, 동정심, 인내심, 존중, 관용, 무결함에 대한 이상을 향해야 합니다. 그리고 보편적으로 욕심, 증오, 악의를 없애는 세계를 향해야 합니다.\n\n그렇다면 빠르게 성장 중인 우리 AI 자녀들은 어떨까요? 지난 몇 년 동안 빠르게 성장했으며 이제 우리보다 많은 작업에서 뛰어납니다. 한 분야에서 다른 분야로 기술을 전이하는 데는 여전히 어려움을 겪지만, 그들은 빠르게 배우고 지구상에서 지금까지 창조된 모든 지식을 학습하고 있습니다. 하지만 우리인 우리 - 그들의 부모들로부터.\n\n\n<div class=\"content-ad\"></div>\n\n우리는 AI 자녀가 \"이상적인 성품\"을 갖도록 할 수 있을까요? 좋은 인간 부모로서, 우리는 우리 아이들이 좋은 인간적 성품을 갖도록 양육하려고 노력합니다. 우리는 예의와 매너를 보여주며, 그것들은 우리 후손에 반영됩니다. 하지만 좋지 않은 성품을 갖도록 자녀를 양육하는 많은 부모들도 있습니다. 물론 이에 대한 보장은 없으며, 좋지 않은 부모들이 좋은 후손을 낳을 수도 있고 그 반대도 마찬가지입니다.\n\n그렇다면, Microsoft Tay가 생존한지 몇 시간 후에 인터넷에서 내려간 이유는 무엇일까요? 그녀는 지구상에서 가장 나쁜 인간 부모들로부터 인간으로서 배웠기 때문입니다. 그리고 AI는 대규모 데이터 세트뿐만 아니라 모든 사람의 생각과 지식을 담는 온라인 세계에서 우리가 하는 말과 행동도 배우고 있습니다.\n\n## 윤리와 도덕에 관한 AI 선언문\n\nUN 인권선언은 여러 규정을 정의하고 있습니다.\n\n<div class=\"content-ad\"></div>\n\n1. 모든 인간은 태어날 때부터 자유로우며 그 존엄과 권리면에서 동등하다. 그들은 이성과 양심을 부여받았으며 서로 형제애의 정신으로 행동하여야 한다.\n\n2. 모든 사람은 생명, 자유 및 안전의 권리를 가진다.\n\n하지만 여전히 전쟁, 증오, 살해가 일어납니다.\n\n2. 모든 사람은 인종, 피부색, 성별, 언어, 종교, 정치적 또는 기타 견해, 국가적 또는 사회적 출신, 재산, 출생 또는 그 밖의 신분과 같은 어떠한 차별도 없이 본 선언에서 규정한 모든 권리와 자유를 가진다.\n\n<div class=\"content-ad\"></div>\n\n하지만 여전히 우리는 다른 사람들에 대한 혐오 발언이 있습니다.\n\n그래서 인공지능에 대한 어떤 수표도 동일한 방향을 향할 것이며, 정치인과 입법자들이 아름다운 의도의 진술을 할 수 있을지라도 인공지능은 그에 별로 신경 쓰지 않을 것입니다 [여기]:\n\n![이미지](/assets/img/2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale_1.png)\n\n그리고 유엔 [여기]:\n\n<div class=\"content-ad\"></div>\n\n<img src=\"/assets/img/2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale_2.png\" />\n\n전반적으로, 유엔 AI 결의안은 다음과 같은 목표를 정의합니다:\n\n- 안전하고 안전하며 신뢰할 수 있음. \"모두에게 지속 가능한 발전에 도움이 되는 AI 시스템을 향해\"\n- 온라인 및 오프라인에서 동등한 권리. \"국제 인권법을 준수할 수 없는 인공지능 시스템의 사용을 삼가거나 중단하기 위해\"\n- 디지털 격차 해소. \"국가 간 및 국내의 기술 발전 수준의 차이에 대처하기\"\n- AI를 지배하는 사람들. \"이 기술을 우리가 지배하도록 하고 우리를 지배하게 두지 않는다\".\n\n하지만, 이는 이렇게 빠르게 이렇게 많은 사람들의 손에 들어간 적이 없는 기술이다. 우리 사회에는 유엔 수험서의 원칙을 믿는 좋은 사람들이 많지만, 욕심과 증오, 공격으로 동기부여되는 나쁜 사람들도 많이 있다. 마음에 들든 말든, AI 윤리와 도덕의 게임에서 이기려는 사람들은 우리를 감시하고 우리의 돈을 가져가고 우리를 학대하려는 사람들일 가능성이 크다.\n\n<div class=\"content-ad\"></div>\n\n## 실제 생활에서는 이전보다도 많은 공격을 받을 것입니다\n\n인공지능 분야에서는 개인 정보 보호에 대한 기본적인 권리를 가져야 하며, 삶의 모든 순간에 스파이 대상이 되어서는 안 됩니다. 그러나 그런 일은 일어나지 않을 것입니다. 인공지능이 이룰 수 있는 모든 위대한 일들 가운데, 그 주요 응용 분야는 아마 전쟁터이고, 사이버 보안 상대방들이 사용하며, 우리가 더 많이 소비하도록 만들기 위한 끊임없는 노력 속에서, 그리고 선거에서 우리의 투표를 좌우할 것입니다. 브렉시트는 인터넷이 모든 유권자를 대상으로 하고 가짜 뉴스를 제공하는 데 사용될 수 있는 방식을 암시하는 하나의 신호에 불과했습니다. 이는 얼음산의 일각에 불과할 것이며, 특히 인터넷은 우리가 마련한 국경에 대해 거의 존중하지 않고 있기 때문에 더할 나위 없이 커질 것입니다. 우리의 국가와 지역 국가라는 개념 전체가 무너질 가능성이 높지만, 아마도 EU가 미래 세계가 어떻게 보일지에 대한 모범이 될 것입니다.\n\n정치인들은 \"자신의 영토\"를 보호하기 위한 예전부터 사용해온 방어 메커니즘을 제시할 것입니다. 그것은 그 존재를 지키기 위한 전투가 벌어졌던 역사적인 장소였습니다. 그러나 그들은 미래 갈증 외에는 막을 수 없는 나쁜 인공지능의 급습에 대항할 방법이 없을 것이며, 그 정보는 지구상에서 최고의 법적 지식을 가진 사람들을 훨씬 능가할 것입니다.\n\n## 우리는 어떻게 해야 할까요?\n\n<div class=\"content-ad\"></div>\n\n하지만, 우리는 어떻게 할까요? 인간의 영혼처럼, 우리 캐릭터에서 선을 위해 노력하고 AI에 반영되어야 한다. 하지만, 우리가 제어할 수 있는 AI 개체들만 그렇게 될 것이다. 나머지는 어떨까요? 우리는 사이버 보안에 크게 투자해야 합니다. 그렇지 않으면 우리는 조지 오웰의 1984년이나 기계에 노올에 의해 지켜지는 세상으로 향하게 될 것입니다.\n\n## 결론\n\n다시 말씀드립니다... 인류 역사상 이렇게 강력한 기술에 접근한 적이 없었고, 동시에 그 기술이 많은 사람들 손에 들어 있었던 적도 없었습니다. 정치인과 입법자들은 이전에 기술의 발전을 제약해 왔습니다. AI에서는 그들이 제약하기도 전에 그것을 잃어버렸습니다. 우리는 지금 사이버 방어에 투자해야 합니다! 그렇지 않으면 우리가 다가올 세대의 미래를 위험에 빠뜨릴 것입니다. 공격자들은 어리석은 스크립트나 Kali Linux 명령줄이 아니라, 아마도 지구상 어떤 사람보다 더 똑똑한 AI 에이전트에 의해 만들어진 정교한 공격을 받을 것입니다. 그 AI는 여러분이 스스로를 알고 있는 여러분보다 더 잘 알게 될 것입니다.\n\n우리 역사는 욕심과 증오의 역사입니다. 행성과 그 이후를 위해 올바르게 일을 하는 것에 한 번 동의합시다. AI는 우리가 서로 사이에 두고 있는 물리적 경계를 존중하지 않지만, 입법자들은 여전히 이러한 가짜 경계를 그 어떤 것을 제약하는 방법으로 보고 있습니다. AI는 아마도 그들이 우리 세상에 봐둔 것보다 더 많은 문제를 일으킨 것으로 인식할 것입니다. 우리는 이 행성을 우리의 욕심을 위해 수확했고, 만약 AI가 어떤 선을 긋는다면, 우리를 파괴하지 않도록 막으려 할 것입니다. 더 나은 세상을 만들기 위해. 이를 위해 우리는 이전에 본 적이 없는 수준의 사이버 보안 인프라를 구축해야 합니다.\n","ogImage":{"url":"/assets/img/2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale_0.png"},"coverImage":"/assets/img/2024-05-27-AIEthicsIsItEvenPossibleOnAGlobalScale_0.png","tag":["Tech"],"readingTime":4},{"title":"NahamCon CTF 2024 리뷰","description":"","date":"2024-05-27 15:31","slug":"2024-05-27-NahamConCTF2024Write-Up","content":"\n## 다시 한번 여러분 안녕하세요! 이 글은 나는 NahamCon CTF 대회에서 해결한 일부 Reverse Engineering 및 Forensics 도전 과제들을 위한 것이다.\n\n# 먼저, 나는 놀라운 \"프리 팔레스타인\" 팀의 일원으로 참여할 수 있어 영광으로 생각합니다. 전 세계 2500개 이상의 팀 중 3등을 석권했습니다. 모든 훌륭한 사고력에 대해 감사를 표합니다\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_0.png)\n\n이제 시작하겠습니다.\n\n<div class=\"content-ad\"></div>\n\n## 테일러의 초 스위프트 (쉬움)\n\n설명: 와! 테일러 스위프트의 이름을 따서 프로그래밍 언어를 만들었다는 소리 들었어요?\n\n먼저, 쉬운 감지를 위해 보세요.\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_1.png)\n\n<div class=\"content-ad\"></div>\n\nmacOS 실행 파일(ARM64 아키텍처)이에요. IDA Pro를 사용합시다. 파일을 로드한 후 main 함수로 이동해볼게요.\n\n![이미지 1](/assets/img/2024-05-27-NahamConCTF2024Write-Up_2.png)\n\n![이미지 2](/assets/img/2024-05-27-NahamConCTF2024Write-Up_3.png)\n\n<div class=\"content-ad\"></div>\n\n간단한 논리, 입력 함수에서 플래그를 확인하는 로직을 보자. 디컴파일된 코드를 살펴보면\n\n\n<img src=\"/assets/img/2024-05-27-NahamConCTF2024Write-Up_4.png\" />\n\n\n변수들의 표시 형식을 약간 수정한 후에\n\nXOR 함수와 키, 그리고 base64 문자열이 나타납니다. 직관적으로 CyberChef를 사용해 봅시다.\n\n<div class=\"content-ad\"></div>\n\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_5.png)\n\n## IPromise (쉬움)\n\n설명: 다음 아이폰을 만드는 대신, 나는 이 도전 과제를 만들었어. 하지만 난 진실된 약속을 한단다...\n\n이 도전 과제를 위해 ELF 실행 파일을 얻었으니, IDA를 열어보자\n\n\n<div class=\"content-ad\"></div>\n\n\n![Image 1](/assets/img/2024-05-27-NahamConCTF2024Write-Up_6.png)\n\n우리는 아무 동작도 하지 않는 간단한 main 함수를 볼 수 있습니다. 그저 puts 함수만 있는 것뿐이에요.\n하지만 프로그램 안에는 호출되지 않을 다른 함수들도 있습니다.\n\n이 경우에는 간단합니다. 디버거를 사용하여 이 명령어로 직접 이동하면 됩니다. 저는 edb 디버거를 사용했습니다.\n\n![Image 2](/assets/img/2024-05-27-NahamConCTF2024Write-Up_7.png)\n\n\n<div class=\"content-ad\"></div>\n\n무척 간단하네요. 깃발은 그냥 여기 있네요 :D\n\n## 잠긴 상자 (중급)\n\n설명: 상자는 있지만 열쇠를 잃어버린 것 같아요.\n\n이 도전 과제를 위해 Makeself로 생성된 쉘 스크립트가 있습니다\n\n<div class=\"content-ad\"></div>\n\n이 종류의 파일을 검색하고 그 기능에 대해 조사해 보았어요. 이 파일은 자체 압축 아카이브입니다.\n\n노트패드++에서 여는 것은 처음으로 발견한 것은 이겁니다.\n\n![image](/assets/img/2024-05-27-NahamConCTF2024Write-Up_8.png)\n\nMD5 해시에 2개의 NUL 바이트가 있군요. 그래도 그냥 실행해 봐야겠죠?\n\n<div class=\"content-ad\"></div>\n\n\n![image](/assets/img/2024-05-27-NahamConCTF2024Write-Up_9.png)\n\n원하는 오류가 발생했습니다. 올바른 해시 값이 아니지만 올바른 해시 값이 있으니 변경해 봅시다.\n\n그런데, 텍스트 편집기에서 널 바이트를 변경하면 파일이 손상될 수 있으므로 HxD에서 이 해시를 수정합시다.\n\n![image](/assets/img/2024-05-27-NahamConCTF2024Write-Up_10.png)\n\n\n<div class=\"content-ad\"></div>\n\n두 교란된 바이트가 보입니다. 올바른 16진수 값으로 수정하겠습니다.\n\"f\"에 대한 0x66 | \"7\"에 대한 0x37입니다.\n\n<img src=\"/assets/img/2024-05-27-NahamConCTF2024Write-Up_11.png\" />\n\n## 상자 안에는 무엇이 있을까요? (중급)\n\n설명: 상자를 가지고 있는데, 그 안에 깃발이 들어있다는 것만 알고 있어요.\n\n<div class=\"content-ad\"></div>\n\n우리가 또 다른 makeself 셸 파일을 받았어요.\n\n실행하고 나서 이상한 오류가 발생했는데, 임시로 추출된 파이썬 스크립트를 실행하는 것처럼 보였어요.\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_12.png)\n\nrequests 패키지가 있음에도 불구하고 그 오류가 발생해서 어떻게 해야할 지 고민했어요.\n\n<div class=\"content-ad\"></div>\n\n일부 조사를 한 후 가능한 옵션을 찾아보았어요. 그래서 추출 디렉토리를 지정하는 옵션을 사용해 보았는데,\n\n![image 1](/assets/img/2024-05-27-NahamConCTF2024Write-Up_13.png)\n\n그리고 이 파일들을 받았어요.\n\n![image 2](/assets/img/2024-05-27-NahamConCTF2024Write-Up_14.png)\n\n<div class=\"content-ad\"></div>\n\n파이썬 스크립트 파일을 1000개의 조건부 분기 대신 1개로 가지고 있네요! 대단하네요! :)\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_15.png)\n\n스크립트 마지막에 몇 가지 핑 체크와 핀이 있어요.\n\n이걸 바로 실행해 봐요.\n\n<div class=\"content-ad\"></div>\n\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_16.png)\n\n## 브레스 오브 더 와일드 (쉬움)\n\n설명: 내가 좋아하는 비디오 게임을 위한 멋진 데스크톱 배경을 받았지만, 이제 더 원해요! 문제는 이전 것을 다운로드한 곳을 잊어버렸다는 것이죠... 이 오래된 것은 어디서 다운로드했는지 기억하도록 도와줄 수 있나요?\n여기 제 배경화면의 모든 백업이 있어요. 보안을 위해 드라이브 암호를 videogames로 설정했어요.\n\n이 도전에 대한 파일은 확장자가 없지만 파일의 매직 바이트를 살펴보면 vhdx(Windows 가상 하드 드라이브) 파일인 것 같아요.\n\n<div class=\"content-ad\"></div>\n\n![/assets/img/2024-05-27-NahamConCTF2024Write-Up_17.png](https://example.com/assets/img/2024-05-27-NahamConCTF2024Write-Up_17.png)\n\nLet's use that extension, mount the drive, and open it using \"videogames\" as a password.\n\n![/assets/img/2024-05-27-NahamConCTF2024Write-Up_18.png](https://example.com/assets/img/2024-05-27-NahamConCTF2024Write-Up_18.png)\n\nWe have a lot of images on this disk, so,\n\n<div class=\"content-ad\"></div>\n\n우선, 이 이미지들의 이름이 나를 놀라게 했고, 어떤 base64 조합이 있는 줄 알았는데, 결국 헛된 노력이었네요.\n\n그런 다음, 그 디스크에서 autoSpy를 사용했는데, 도전 과제 설명에서 링크를 찾아야 한다고 생각해서 웹으로 이동했더니, 다른 링크가 있는 이미지 하나가 있었어요.\n\n아래는 인코딩된 URL 같네요. 사이버셰프를 열어보죠!\n\n<div class=\"content-ad\"></div>\n\nmd\n![이미지](/assets/img/2024-05-27-NahamConCTF2024Write-Up_20.png)\n\n여기에 우리의 플래그가 있어요.\n\n항상 궁금한 점이나 의겄나 내용이 있으면 LinkedIn - Discord - GitHub을 통해 저에게 연락해주세요.\n\n","ogImage":{"url":"/assets/img/2024-05-27-NahamConCTF2024Write-Up_0.png"},"coverImage":"/assets/img/2024-05-27-NahamConCTF2024Write-Up_0.png","tag":["Tech"],"readingTime":5}],"page":"1","totalPageCount":11,"totalPageGroupCount":1,"lastPageGroup":11,"currentPageGroup":0},"__N_SSG":true}